{
    "name": "Marseille",
    "place_id": "ChIJDf7etFNYwokR_b7pJ_D2_dM",
    "grid": "MN4",
    "address": "630 9th Ave, New York, NY 10036, USA",
    "rating": 4.6,
    "user_ratings_total": 3877,
    "phone_number": "(212) 333-2323",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obmRVVlRURGN0Y0U5NWFIcHhaMGhRWkU1MlNGRRAB",
            "text": "Perfect place to eat before heading to the theater. Staff was friendly and efficient"
        },
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdWFGbzVXV3RHWTBkblVWaG9VamxOYW1sU1ExRRAB",
            "text": "Julia was our fabulous waiter. She guided us through a wonderful selection of wine apps and dinner!!!"
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMWNUTTRhM2gyZGpSc05qTnNUSFpuZW5GalkyYxAB",
            "text": "Julia was sociable, well-informed and accommodating! Host was also super accommodating to our changing circumstances."
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR1Eyb3lTV04xY1hjM0xUUlZZMFpsVlU4eGJHYxAB",
            "text": "We had drinks and starters, the food was delicious and the drinks were just right. Julia was our server and was very helpful with recommendations."
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabWFVRjNXVWh0TTB4UGMxbHdPSE5pUlcxa2QwRRAB",
            "text": "Amazing cozy vibes and very attentive and personable service."
        },
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTmVWWm1abEV5T1c5eFNGUlZUR2RNYlhWNFluYxAB",
            "text": "Superb service, food and  drinks and close to theaters. Can be a bit noisy."
        },
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbU5qaHlUVVp4U1Zob1RsUnFNVUYxV1MxTGIxRRAB",
            "text": "Carlos gave excellent service"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTFJtMUVTa2hVT1ZnMVNHOUlaMUZtUVVkQlUyYxAB",
            "text": "My friend and I were originally going to a brunch spot in Chelsea but we stumbled upon  Marseille and decided to go here instead, and I’m glad we did! We arrived with 45 minutes left of bottomless brunch, and they surely made it worth our while. Emma, the mimosa hostess, was especially memorable. She was so kind and ensure our glasses were never empty. Food was delicious and atmosphere was great. Hope to be back soon!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadmFYcFRjM0ExUzFZdGVrMVZRMHhLVUVkNlNFRRAB",
            "text": "Living in the neighborhood, we are regulars at Marseille, and never have a less than five-star experience. The reasonably priced food and ambience are peerless in the area, and although we always have pleasant and competent servers, I was compelled to review this most recent experience specifically because of two individuals. Carlos and Emma gave my weekend five-top family the one-two punch of efficient, knowledgeable service and fantastically warm and personal pampering. In short, they provided my aunt and uncle with a visit they’ll never forget (despite the fact that my uncle overindulged a bit and left them with spilled wine and a broken glass to contend with). We were already obviously repeat visitors, but it’s this type of thoughtful care that earns a business a patron’s loyalty. Try them; you’ll find the same."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMVRHSTFMV1pKUW5sMWQweHZUMjgxWlMxVVZuYxAB",
            "text": "Always great food and drink, friendly service and great atmosphere at Marseille"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5V2EzRlBiRFZsVjE4NGJ6ZDJTaTFZTUUxalluYxAB",
            "text": "Wish I had taken pictures but I had to grab a quick dinner before an event. The decor is quaint and inviting, my server Nahomy suggested I start my meal the smokey paloma and I’m glad I did. Ate a delicious warm goat cheese salad with a flavorful poulet roti. She was very sweet and attentive! Will be back with friends and more time!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTVJHeHViVWg1U0VGcVVubzJNamxyVGpkc04wRRAB",
            "text": "Great pre-theatre spot. Same owner as 5 Napkins so not surprising that the burger is excellent."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM2VIVnpXVEYwTFc5Q1drZzJWVTB3TFdoYVRsRRAB",
            "text": "Wonderful meal here before Chess on Broadway. Impeccable service by Andreas and his team made our anniversary treat all the more special! Definitely coming back soon!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM2N6VmpjMUJNUVdGcVlYSmtNRlJhTWpOdGVtYxAB",
            "text": "Fantastic service and food. Ryan was excellent. Highly recommend: Brigette Bardot, Oysters, and Vegetable Couscous with Shrimp"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMmNXTjNNbXRJTkRoWGIyMWpZbGhpYUd4UFVuYxAB",
            "text": "Johnny M was just the most welcoming, friendly, attentive… could not do any more for all of us…this was our son’s birthday and Johnny was brilliant - it was our 6th and last day in NYC and we all agreed that Johnny was the best server we had experienced and made our last day… leaving on a high and thinking how do we get back soon!!\nThank you!\nDaniel Little & his fam x"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1ZuVXhOM00xYlU1NmQzTTRkWEUzZGtsWmVXYxAB",
            "text": "Johnny service"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNE5pMXJkRWxTY21SQlFqVXhWRzExVFc5WldVRRAB",
            "text": "We thoroughly enjoyed our time at Marseille. Greta good and atmosphere. Johnny is the best!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbU0zcE9ka2xZY1dkSGFUVmFkV1UzVFVjNGVuYxAB",
            "text": "Good service Johnny"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weFltRnhRMDloUjBoM1FrVkhjR3h5YVd0SVRXYxAB",
            "text": "Jose! Took great care of us on a busy pre-theatre lunch crowd!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNFpsZGtPRTR3TTJJMmRFNTNZVkpLU1dweVoxRRAB",
            "text": "Always a fabulous time @Marseille! Johnny made it even better! Professional, kind & helpful. Already looking forward to the next time!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUVlWWmZkbFZUYlRkUk9Ga3lVWEpTYkVWallVRRAB",
            "text": "Johnny was very attentive and we enjoyed our pre theater lunch immensely."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVVIxTndiREJQUmpJdFJFTk9hMG95WW5oUllXYxAB",
            "text": "Johnny M is wonderful!"
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeFQxUkxObXRyU0U1a2FqVmFORTlUU0RFeFdWRRAB",
            "text": "Bonne expérience malgré le fait que ce soit un peu cher. Sugestion: mettre un peu plus de chocolat dans les profitroles. Enfin une viande exepcionnel à New York."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWE1HTmljRFZhTlc5eWJ6RkJjRVJrTVdOTlQzYxAB",
            "text": "Marseilles, in thr heart of the Theater District, has been a favorite restaurant of mine for over twenty years when it opened. The food is classic French bistro and it is relatively small and beautiful inside. I love many of their dishes but the branzino, skate and steak frites are flawless.\nWhat also makes Marseilles a stand out is the staff. The skillful hospitality of Syed, Prince and all the wait staff and bartenders is rare in NYC because it is authentic and gracious. So many staff working as one team is extraordinarily. Today, I met Johnny and he embodies Marseilles’s service. Kudos to all of you for years of fine food, beverages and service at a reasonable price!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRlFuTkZWV1ZLZEZSMlRtbGtTbTVhWWxSNFVIYxAB",
            "text": "A brasserie. Everything was just great!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSU5ubEhNalF4VVU4Mk9XNWZOa2w1UVdwcFoxRRAB",
            "text": "Food is very good, and exotic. The price isn't bad for the area. Good service. The atmosphere is average but nice agreeable."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFlXSnViakYwWkhrd2VrMU9lVmhHZUVFeVdFRRAB",
            "text": "Laura was very attentive. Food was wonderful!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUlMwMVRRelZRVmw5Rk1XTTJUMncyUjNsS2NtYxAB",
            "text": "Johnny was amazing! Wonderful service. The food was delicious- a very consistent experience from start to finish"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcWRISlRMVnBQT0ZSRFZ5MUlSa2xOUmpOWlZtYxAB",
            "text": "Austin at the bar is a total asset! Knowledgeable and super fun.\n\nFood was killer. Best espresso martini I’ve ever had."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WlNGQkNTakp3Y0VZeVRHZFRka3N4VUhsVGFrRRAB",
            "text": "Loved everything about this place! The food, the staff? 10/10\n\nOur server Carlos was super friendly. And Emma the bottomless mimosa girl was just as equally friendly and attentive. Will definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214amNEbFhkbGxIT1VGRlZFUmxXRTF5TmxkRmVVRRAB",
            "text": "Ryan was fabulous!"
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ1N6VnlTekppTmxwa2FXSlFiRTlzVjA1SFUwRRAB",
            "text": "Super resto on est très bien accueilli avec un super service souriant et attentionné de Johnny"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTWJFRXRlWFJoVWxjeFV6TTRhazVRVVVaSmFYYxAB",
            "text": "My first time trying French cuisine and it was outstanding. The restaurants is beautifully decorated and amazing attentive staff. Our waiter Johnny went above and beyond. Constantly checked in on us. Will definitely be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bFRHbGxVbkZtYlROeU5GUlBZMUptU2sxRFVuYxAB",
            "text": "Our waiter Johnny M. was SO kind, attentive, and fun! He made the experience even better. The food was delicious and the atmosphere was beautiful. Will definitely return!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNFRsZFpOa3BoY1hOQlVqSnNRbEl0TFhCUE9WRRAB",
            "text": "Johnny was absolutely the best! His energy and recommendation we let spot on"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaVJWUnVhV3h0VGxoa2NHTXRlVTU1U0hKS1lYYxAB",
            "text": "Food was fantastic and so was our server Nahomy, we’ll definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad2RXRTFZVE5UZHpsNE0yZG5XR0Y0YUVJMlEwRRAB",
            "text": "Johnny M. Was amazing and I’ll definitely be back! He was a pleasure!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0d2JtcHJaVFpqWW5GR2RrTnNabmxZTFRoNVExRRAB",
            "text": "Jose was super waiter. Great food and drink choices. French bistro in theater district"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUGEzWjBlazlIVDA1dFQwOXVTa0ZCUVRaRVZGRRAB",
            "text": "This place never gets old.  The food was delicious.  Melanie was fantastic.  One of the best servers we had in years."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRVQxVjNhalI2YVVwT1JtdGlaWE0yVDBFeFNGRRAB",
            "text": "Food was excellent, staff was a bit slow. But the atmosphere is great and I will definitely go back, it is a bit pricey"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUlYzRkxMVGhOWDFKd2RVdDVhSGt5ZW5ST05HYxAB",
            "text": "Melanie helped make our anniversary lunch a very genuine celebration, candles and all. Her recommendations were perfect. She was great."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNk4zUktXV2g1ZUVsTFNqWlRWVTFPZEZGQ01rRRAB",
            "text": "We had a wonderful meal with exceptional service from Melanie."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2JGWkVORW95WmpOcVZqUlBkSEZ5VmtKVFltYxAB",
            "text": "We were unfortunately very unimpressed with our visit to Marseille. I picked Marseille for a nice pre-theater meal with my husband and father. We had a reservation 2 hours before the start of our show which was just a few blocks away. Due to poor management of tables by the restaurant, we were seated about 20 minutes late. Even after being seated, we had to flag someone down after another 10-15 minutes to try to get our order started. Since we had been waiting we already knew what we wanted and we made sure the waiter knew we had theater tickets and for what time. For starters we had the bistro salad and french onion soup. The soup was fantastic, but the salad was inconsistent - I was very unhappy with mine, but enjoyed it when I tried my dad's portion. Turns out my salad had been extremely underdressed and was just lettuce essentially. Our entrees were slow to the table and fairly underwhelming for the price point - the hanger steak for the steak frites on the Prix Fixe menu was chewy and tough though the sauce was tasty, while the NY Strip steak frites on the regular menu was a superior cut of meat, but the béarnaise sauce that accompanied it was runny and bland. My duck was fairly flavorless though the accompanying vegetables were tasty and my dad enjoyed his salmon. We had pre-ordered profiteroles as part of the Prix Fixe and asked to add on a pot de creme. Desserts were fantastic, but we had to ask our waiter for both the desserts and our check multiple times before we got either and ended up rushing to our show. We heard multiple other guests complaining about similar problems that night. Given their overall previous ratings, seems like it may have just been an off night for them, but I would not personally return."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlZHdDVlVVkyTnkxYVdUVlhOakJPVDI5dlIyYxAB",
            "text": "Austin at the bar is amazing!!!\n\nGreat food, friendly service, and the drinks are divine!!!!\n\nMake sure to order the Brunch Basket, delicious pastries!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUmFXNTJWVWMzVlUxaVpFbENkR05sTlRsUk5tYxAB",
            "text": "I love this place. I’ve been coming here for the past 15 years, but I wish they had an Apple Pay option so I wouldn't have to walk around to pay."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlJXdGZabWhhZUdoS2J6ZDNVbFp3YlUwME1HYxAB",
            "text": "Great service and food, the staff was incredible and served the lunch really fast ( we were starving), Selma, our hostess, was wonderful and very pleasant, her aura set up the mood of our quick lunch and she was mesmerizingly beautiful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcllpMUxabDlwYjNFNFdGZHVZM1JuZUd4dGQwRRAB",
            "text": "Amazing restaurant. Melanie was fantastic. We will be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVFUzRlhTekp0UjBNek1UbEVTRXBTUm1Nek5VRRAB",
            "text": "Very good food, excellent service by Selma. We had lamb Tagine and duck. Hors d’oeuvres included duck liver pate and grilled octopus. Three type types of sorbet/ice cream for dessert.  Highly recommend this restaurant."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYVZEbDNUVzg0WjBKWlpUWnhRbEppWHpCT04yYxAB",
            "text": "Our waiter Melanie was so attentive it makes our experience so memorable. This beautiful restaurant is a must see when you visit NYC! Thank you Melanie and Reagan."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVFpYVnlhV1kxWDJWeVpGUjZVRmRmYVZKNlYwRRAB",
            "text": "One of my favorite places for dinner. Always amazing!"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnODlQNXBBRRAB",
            "text": "고기에서 냄새나고 모양만 그럴듯함. 맛도없음. 서비스 너무 안좋고 인종차별 당함. 응대가 아주 엉망임. 내 인생 최악의 식당. 두번다시 갈 일 없음. 동양인분들은 가지마세요 인종차별당합니다! The meat smells bad and tastes bad. The service is so bad and racist. The reception is terrible. The worst restaurant in my life. Don't go again."
        },
        {
            "date": "3주 전",
            "language": "ko",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V01HUjZSbkV5ZFRoUlZqTktPRzlQWDB0d2QwRRAB",
            "text": "음식은 평범했고 서버들은 엉성했으며 뉴욕 물가에 비해 비싸진 않았다"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcmU2M3ZRRRAB",
            "text": "정말 맛있고 분위기도 좋지만 가격이 살~짝 비싼 느낌이 없지 않아 있었습니다!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcW9fYjN3RRAB",
            "text": "스테끼는 뉴욕스트륍 있는거 미듐레어로 시켰는데 굽기도 적절했고 덕 브레스트도 엄청 부드럽고 맛있었음!!!"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOG9IVFpnEAE",
            "text": "브런치를 먹었는데 음식이 맛있고, 뉴욕물가대비 가격이 reasonable.   친절한 웨이터덕에 케익서비스도 받고 팁을 주어도 아깝지 않았던 첫 경험 ㅋㅋ"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdEl1a0h3EAE",
            "text": "늦은밤에 갔는데 종업원들도 친절하고 와인도 맛있게 잘먹었습니다."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wblVVSTNRMU4yZFdoSlRWUmxMWEV6ZDB4RE4yYxAB",
            "text": "Shared a lovely lunch with my aunt at Marseille. This is our regular spot when she’s in town. Our waiter, Johnny M, introduced himself and Jose, who was in training with him. Johnny was a charming and attentive waiter. After our meal arrived, he even offered to take our photo for us, which I’m grateful for, because I would’ve forgotten to get one together. Lunch was simple, well-made and delicious. I got the avocado omelette with spinach and goat cheese. My aunt had the avocado toast, which also looked beautiful. There were several delicious-looking menu options, but somewhat limited for vegetarians. I’m not picky though, and we come to Marseille because of its atmosphere, convenient proximity to Port Authority, and the relaxed lunch-time atmosphere. The restaurant was quiet when we arrived, but started to fill up as we were leaving around 2pm. We enjoyed our time there and appreciated Johnny’s hospitality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcVJWSmFTMFJaTTE4NFNrMDBTekpRTWpGaVoyYxAB",
            "text": "We came here on a whim and absolutely no regrets! The food here is terrific and the options are wonderful if you don’t want so much starch or not in the mood for meat. My partner got the beef rib pasta and omg -it was so tender. I’m going to have to figure out how they made it! I got the skate with the French lentils. Skate is a fish I rarely see on any menu so I had to try it. It was delicious and I liked the buttermilk? glace they used around the lentils and spinach. Everything was cooked to perfection and the staff, servers and host, Emma, were absolutely welcoming and accommodating. And everyone gets their own warm bread! Will definitely be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobldYVmpNVkU0Ym5VNVV6bHNjRVZQT0UxVU0xRRAB",
            "text": "I picked this restaurant because I had wanted to bring mom somewhere special for restaurant week and the menu selection just sounded so delicious and high class.\n\nI definitely knew that I would be needing to order escargots because when in a French restaurant ~ most definitely did not disappoint!!! Herbaceous and lemony and paired with the baguette. Say no more!\n\nThe apps to entrée to dessert were dishes I normally wouldn’t make at home and the flavors were so intoxicating. Creamy , buttery, luscious, and for the desserts, not too sweet.\n\nBut what was the sweetest and the cherry on top was our waitress, Sara ❤️\nShe was so attentive, sweet and made the whole dinner experience so comforting, comfortable and so relaxing.\nIf you get the opportunity to have her as your waitress, consider yourself BLESSED!\n\nCome check out Marseille! The atmosphere is sophisticated, charming and so inviting.\nYou have to come try their food!\nI will be back even if it’s not restaurant week!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c1ptTk1UMEZIZEZWblFVTjJSMEp2UTJwVVgyYxAB",
            "text": "We had the pleasure of being served by Johnny. Food tasted incredibly delicious, seasoning was so good. If you love oysters, the oysters are fresh and delicious here. The view from our seat was great, we got to people watch. We ordered a bottle of Chablis (favorite wine) everything was perfect and attention to detail was great. I saw how organized and clean the restaurant is. Great venue for a relax afternoon with friends and family."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYUJ5b1gtekl6djhnRRAB",
            "text": "Absolutely loved my experience at Marseille! The service was top-notch—friendly, attentive, and genuinely welcoming from start to finish. As for the food? Phenomenal. Every bite was full of flavor and beautifully presented. You can tell they care about quality here. Whether you’re stopping by for a casual night out or a special occasion, Marseille delivers. Can’t wait to come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM1oxUkliblZ6Y201NFYxUnFhREpSUmpSM1pGRRAB",
            "text": "Had an amazing second experience at Marseille.  The atmosphere is warm and inviting and feels like dining in a Parisian brasserie.  The food is excellent right from the start with an amazing fresh roll that arrives warm to the table and is served with butter and olive oil.  The steak frites were amazing!  Service is impeccable- shout out to my server Julia!  She was friendly and welcoming and definitely enhanced an already terrific experience either way her amazing service.  She also ensured that dinner would be paced in a fashion that I would make my 7:00 theater performance . Marseille is not to be missed- it does not disappoint.  It has become a not to be missed for me for future New York travels!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM2ExVTBUVzlFYldWTVNVOUNiakJFWmtwQmJtYxAB",
            "text": "We went and had the restaurant week menu. Over all a very good valued 3 course menu. The Coq au Vin was definitely the best part of the meal, very distinct flavors.\n\nThe service was very good. Thank you Melanie for the great service!\nThe outdoor experience was also very nice on a good day."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQlptWndPVEJoVDA4MFEzSXdRbmc0ZW1RMGNsRRAB",
            "text": "We just happened to walk by this cute restaurant on our last morning in the city. Loved everything about it. Our awesome server, Liza, was very attentive and personable. The food and drinks were delicious! Good way to end our trip to NYC!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMmRXeFRWMVpRWVU5aVZYaEJaSEZUU1ZKNGMzYxAB",
            "text": "Just came back from a lovely lunchtime meal with a girlfriend at this very classy restaurant after a recommendation from a friend. From start to finish the experience was outstanding, the first greeting from the lady at the door (sorry I didn't get her name) was outstanding. Had  a main meal and a glass of wine as we caught up after not seeing eachother for a few months. The waiter was friendly, attentive and we never felt that we were being rushed even though we were there for a while. Service was speedy, the food delicious and there was attention to detail. A very enjoyable meal would definitely recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMDR2bGlnRRAB",
            "text": "What a great spot for brunch! The decor is light and airy, the service is top notch and the food was exceptional. Our server Addyson was very attentive. The prices are very reasonable. Between the three of us we shared the bread basket, yum!  Entrees were Croque Madame, Omelette Florentine and Eggs Benedict.  We all ordered crème brûlée for dessert.  I’ve never had a bowl of cafe au lait before but it was great too. I highly recommend brunch here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21samNuRkpjV1pCWWxsaGRrOW1SRVZKU25wR1QzYxAB",
            "text": "My husband and I loved it here so much the first time that I brought my (adult) daughter back as a special treat. Our servers, Selma and Taher, provided perhaps the most exceptional service in NY. From helping me narrow the incredible menu down to one good choice to their unwavering attention to service and detail, this is a spot you don’t want to miss. Casual and classy is my favorite combination! Highly recommended for a taste of Paris in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV2QwTkpPRzkyVEVReVlUQnVkamhwZDFkTWIyYxAB",
            "text": "I had the mussels, which was tasty and the portion is enough for one person. The white wine has some citrus flavor and refreshing. The fries was good enough to enjoy. It is not too far from public transportation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZk9XdFlMV2RGTFZaUlRsWkhhemhZTUVkNGFVRRAB",
            "text": "We just stopped here for happy hour oysters before a play. What an absolute delight!  Our server, Henry, was just lovely…. In fact, he kinda made our evening!\nThis is s perfect restaurant to enjoy before or after a show. The food is top-notch and the service is extraordinary."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbmFrZGFNVk42UWpoRFZqRkRUVkZ2ZUZKTFQxRRAB",
            "text": "While running errands near Hell’s Kitchen, my mom and I stopped into Marseille for an early lunch, and we couldn’t have had a better experience. Even though we arrived a bit before opening, the hostess Reagan kindly welcomed us in and got us settled with drinks while we waited. Henry prepared our cocktails, Louis brought bread and made us feel right at home, and our server Johnny was fantastic—knowledgeable, attentive, and spot-on with his recommendations. The entire team, including the manager Saeed, made us feel cared for from start to finish. The food was delicious, the ambiance lively, and the hospitality truly memorable. We’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oemFWbGZkbUZEZGpoSE1uSmhObTVKVGkxQ09FRRAB",
            "text": "So glad my friend and I decided to stop at Marseille. Definitely a 5 star experience. We went for brunch. The Lorraine was the best omelet I've ever had, and my friend's French toast was a work of art. Our waiter, Henry, gave us impeccable service. We ate outside because of the beautiful weather, but the restaurant's interior is gorgeous. I look forward to coming to Marseille again the next time I visit New York."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFkwOURkM1JXUjBGTE5qQmhjWEl3ZEZVeFpXYxAB",
            "text": "A wonderful brunch experience. Everything you’re looking for when dining in the city. Great atmosphere, delicious food and the best service! Onion soup was just as it should be and the burger (last minute choice) was sooooo yummy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNWFHWldVa1pTVTNwQ1EzRnBTRVpGTTBOTlkyYxAB",
            "text": "Ooh la la Marseille NYC is magnifique! Delicious escargot served elegantly. A Rosé wine, light and dry. Attentive staff, Johnny was excellent as server too, as was Tegan the hostess. Staff also have a wonderful camaraderie! A perfect meal prior to seeing Art, a French play."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWFVUSldNSEZ5TVZoNFRXNXlURUpqWm05RVVFRRAB",
            "text": "We had the lux to have Henry as our server this even, along with the food being very flavorful, Henry also made this experience a 10/10. He was very attentive with our meals and ensured that we were ok through our time here. If you’re around the area, stop by!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObmN6Rnlka05QT0hSSWFFVm5TbWh1TkRKbGJtYxAB",
            "text": "Walking into this gem near the theater district evokes the feeling of entering a classic Paris bistro. Just as charming, but even better than Paris when it comes to food quality and service.\nAt the door, we were greeted warmly by the maitre d' with a friendly \"Happy Anniversary.\" The feeling of being welcome was enhanced by an anniversary greeting card that was waiting for us on the table, as we were greeted by our incredibly helpful waiter, Johnny.\nLooking for a light lunch, I was delighted to find a lump crab salad on the menu. The fresh shaved fennel and asparagus slices was perfectly infused with the wonderful flavor of crabmeat, and enhanced further by tomatoes, chives, and a perfect topping of fresh grapefruit. My wife's warm goat cheese was paired with roasted beets and a great honey-sweet relish. I was fascinated by the perfection of the breaded and fried goat cheese that stands out from anything I've ever seen at other establishments. She loved the beautifully presented profiterole dessert, and I enjoyed sipping a perfectly drawn espresso, topped by a nice crema.\nIf you're in the area, stop by for a warm greeting and a wonderful French gastronomic treat. You won't regret it, and if you're lucky you'll get to meet Johnny."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUpuUkV3EAE",
            "text": "They offer oysters for $1.50 each during their happy hour (at the bar or table), they are the tasty blue point oysters from Connecticut. I had their skate as my main course, it comes with a butter sauce. It was good, but I have had much better skate elsewhere. On another visit there I had their Fava bean hummus, it was appealingly presented on the plate. I found that it had little flavor, therefore I was disappointed. Their sticky toffee pudding dessert (pictured below) is annually taken off the menu during the mild/hot weather months. It was as good as it gets anywhere. It came with a mild flavored vanilla bean ice cream."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvazlmeFlnEAE",
            "text": "Such an awesome brunch! Ryan was super attentive. Our table looked super colorful and Spring was in fool bloom. The Aperol spritz is pure perfection. Steak frites yum. Great place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOU0dzTG0tdnJXUVV3EAE",
            "text": "We had dinner at this restaurant before heading to a Broadway show, and it turned out to be a lovely French dining experience. The food and drinks were quite good, but the service left something to be desired. Even though our server was very kind, our table wasn’t checked on for long stretches of time, which was a bit disappointing. Overall, it was a nice meal, but I wish the service had been more attentive to match the quality of the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPanVodENpMHJQSXBnRRAB",
            "text": "They have amazing cocktails here — especially the Espresso Martini, which is a must-try. The Niçoise salad was excellent, and the French onion soup was absolutely delicious. On top of that, the atmosphere is really cool and enjoyable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQlFXcGxOVXBKUlRVdFVETkRUWE5xYVZsamMxRRAB",
            "text": "Top pre-theatre spot with fantastic oyster happy hour!\nMarseille is one of my go-to places in Hell’s Kitchen – whether you’re heading to a Broadway show or just in the mood for a great meal. The pre-theatre atmosphere is lively but never rushed, and the service is consistently friendly and efficient.\n\nTheir oyster happy hour is a standout – fresh, flavorful, and a fantastic deal. Also highly recommend coming for brunch! The brunch basket is perfect to share and full of warm, flaky pastries. And the Croque Monsieur? Absolutely on point – rich, crispy, and deeply satisfying.\n\nMarseille combines classic French bistro charm with NYC energy. Definitely worth a visit before or after a show – or just because."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdVNWUTJWa1UyTkUxdk1XUnhXRmcyYmtNeE5sRRAB",
            "text": "Went there recently to celebrate my birthday, and the experience was nothing short of amazing. The impeccable service started the moment we walked in—we were warmly greeted by a lovely hostess (I wish I had caught her name!). She wore glasses and spoke Russian, and her kind, welcoming attitude truly set the tone for the evening. It's people like her who make a visit truly memorable—I hope the management takes note.\nShe congratulated me and gave us a beautiful table, which made both me and my guests feel extra special. As for the food—wow! We tried a variety of both vegetarian and non-vegetarian appetizers and entrees, and everything was absolutely delicious. The desserts and cocktails were equally impressive—elegantly presented and full of flavor.\n\nHighly recommend this place for a special occasion or just a great night out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKclIyZ3lUVGRzTkVSYU9VcG9SRjlMVm1seWJtYxAB",
            "text": "Excellent food and traditional style atmosphere. We tried several dishes and all were great. The prices are a bit high."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMVYyaGxSbGd3V2xCM01YcEdRbTlUVVdKd1NIYxAB",
            "text": "As someone who owns three restaurants and is married to a chef, it’s not easy for me to go out and be impressed — I’m very strict about service, ambience, and food. But at Marseille, everything was done right and it was so refreshing.\n\nChef Xavier Monge runs a kitchen with consistency and precision. I started with the oysters and Mimolette (a hard French cheese) — both absolutely delicious and the perfect way to begin the meal.\n\nThe steak frites was cooked to perfection, with a caramelized crust and tender center, paired with crisp fries and a béarnaise sauce to die for. The daube of beef short ribs was so tender and flavorful that I actually dreamt about it afterward — comforting, refined, and unforgettable.\n\nThe cocktails were just as impressive: balanced, creative, and a perfect complement to the food.\n\nMarseille is the whole package — service, ambience, food, and drinks all in harmony. In a city with endless options, this brasserie truly stands out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S2NHMVhaM2RZTVZOeVdtSllhbDlaYVdnNVQzYxAB",
            "text": "Sunday brunch @ French brasserie! A nice welcome by Emma with a smile. We were seated promptly on a nice table. Packed house full of energy and great ambiance. Croque Madame, avocado toast, shakshuka eggs, strawberry rhubarb tart & chocolate mousse - to die for- and make it happen- friendly service by Luna and Daniel, made our luncheon a so pleasant one! Kudos to Chef Xavier for his concoctions and a net work of smooth team play with smiles floating all around. Manager Prince touched our table ample times to check if we were enjoying. Calls for professionalism. Ty alllll! 🫡🙏❣️😋😋 Will definetely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OUx5QTFRRRAB",
            "text": "My family had Sara as our waitress, and might I say this was one of the best experiences I’ve had at a restaurant in a long time. We went for my 31st birthday. Not only were the oysters delicious but every piece of the meal from the appetizers to dessert were delicious. The drinks were quick and delicious. I will absolutely recommend this to all my friends and other family members. Sara was also extremely knowledgeable about different allergies and cared about us as her customers!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veVdXWk5lRkJWZFRkNlUyOXRheTE0ZURGc1VFRRAB",
            "text": "Had a great time! The Pain Perdue French toast was absolutely delicious and my waiter, Henry, was really kind and attentive. I was looking for a brunch spot before my flight left and they helped accommodate my luggage and even let me rest there a little longer till it was time to leave. Lived my experience here and will be back next time I’m in the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXB2Vjl3RRAB",
            "text": "We came to celebrate our 8th wedding anniversary hoping for a lovely meal…the experience was above and beyond our expectations.  Incredible food, lovely atmosphere, fantastic support staff and our waiter Ryan was simple outstanding - from suggestions to service to how personable he was.  Just a perfect evening."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFVYTTJlRzQ0T0hkclVVNDNVV290V0U5Zk5HYxAB",
            "text": "Had an incredible dinner at Marseille last night—every single dish was a hit. We had the French onion soup, fava bean hummus, and duck liver mousse with cherries and sourdough to start (that sourdough… wow), and then the NY steak with potato purée, which was perfectly cooked and full of flavor. Classic French cuisine done beautifully and affordably. The service was top-notch—every server we interacted with was warm and attentive. I’m seriously still thinking about that sourdough… do they make it in-house or get it from a local bakery? Either way, it’s unforgettable. Will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeFoxVXdOREp0VDIxQ1prOXZPWGw0ZWpWaFFrRRAB",
            "text": "First of all Sara was FANTASTIC! I usually take more photos but it was so good I forgot. We came for restaurant week and had the Heirloom Tomatoes and the Haricots Vert Salade. Both very exceptionally fresh and so delightful. We had sourdough bread and butter which was perfection. We both got the Chicken schnitzel that has incredible greens and a fresh lemon to squeeze. It’s a showstopper and we had the Profiteroles which were like magical ice cream pastries and the Tart au Citron which was lemony and sugary and the meringue was perfect. We had a martini and a glass of sauv blanc and will never stop coming here because it’s truly fantastic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdDVQMWpnRRAB",
            "text": "We have been coming to Marseille since they opened. We have been absent for a while since the kids were born. Now we return after several years for our daughter’s 17th birthday. The stars aligned for us to return as this was her first restaurant. We took her here for a Mother’s Day Brunch when she was a month old. It was so wonderful to walk in and feel like coming home. Atmosphere is still cozy, super friendly and competent staff but more - they were warm, efficient, attentive, we didn’t have to ask for anything like more water, more coffee. Our waitress - Melanie - was absolutely fantastic. We had allergy concerns and she kept us updated of every order. She was super accommodating and the staff seemed content. Kudos to their manager, Sy. So glad to see him still there. They provided a complimentary birthday cake for our daughter to commemorate the 17 years since her first brunch. This is a testament to its chef and kitchen staff. They care about the way they serve their customers. The food was beautifully presented and flavorful. The portions were reasonable and so are the prices. We highly recommend Marseille."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdVl6SlBkbEp2VkdwUlpVaERjMGRXV1ZWUFVtYxAB",
            "text": "The food and ambiance could satisfy any hungry customer looking for a unique and fun dining experience, but the service alone, especially by Johnny M., exceed all. With his kindness, I was able to try and enjoy multiple dishes. Do yourself a favor and treat yourself to an amazing meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS1dGRlNTamd3ZW1kcGRIVTVWa0pFUkVkS1RrRRAB",
            "text": "We had an incredible brunch at this French restaurant! The food was absolutely delicious and beautifully presented. Every plate was a delight. My two favorites were the summer risotto and the salmon pâté, both full of flavor and perfectly prepared.\n\nThe service was outstanding. Our server, Johnny, made the whole experience exceptional. He was kind, attentive, and welcoming, keeping us refreshed, explaining the menu in detail, and making sure everything was perfect. His positive attitude really stood out and elevated our brunch to the next level.\n\nIf you’re planning to come here for brunch, definitely ask to sit with Johnny. He’ll make sure you have the best experience possible. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd04xaFZWWGxETTFoa2VXdGlWSHBEV201T1lWRRAB",
            "text": "My wife and I recently had the pleasure of dining at Marseille for lunch, and our experience was nothing short of exceptional. From the moment we were seated, we were warmly welcomed by Johnny, our server. His professionalism and deep knowledge of the menu elevated our visit to a truly memorable culinary experience.\n\nJohnny took the time to understand our preferences and guided us through the menu with genuine passion and expertise. He recommended two appetizers to start: escargot and salmon tartare. Both were exquisitely prepared, bursting with flavor, and set the perfect tone for the meal. For our mains, Johnny suggested a beautifully prepared chicken dish for my wife, one of his personal favorites, while I opted for the classic steak frites, cooked to perfection. We ended our lunch with two of the restaurant’s signature desserts, both as decadent as they were unforgettable.\n\nWhat truly stood out was the impeccable service. Johnny was attentive without ever being intrusive, striking the perfect balance between professionalism and warmth. His recommendations were spot-on, and it was clear he takes great pride in curating an outstanding dining experience for his guests.\n\nIf you’re visiting Marseille for the first time, I highly recommend requesting Johnny as your server. His guidance transformed what could have been a great meal into an extraordinary experience. We will undoubtedly be returning, not only for the exceptional food but also to once again enjoy Johnny’s unmatched hospitality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ga05VVXRhamgwZDFwUWJHNU9NRlE0U0RKWFNWRRAB",
            "text": "This place doesn’t get enough love. We’ve been very happy everyone we’ve gone and today was the same. Went to a matinee and then caught the end of Oyster Happy Hour — $1.50/each. Very delicious but surprisingly they don’t have a choice of oyster.\n\nDinner was excellent the Restaurant Week Prix Fix was an extra treat. Duck Confit, Pork Schnitzel, and short ribs were all excellent. Desserts seal the deal.\n\nOur waiter Henry and the hostess Reagan were the best! I wanted to take them home with us.\n\nWheelchair accessibility was no problem. For some reason, Google search for restaurants near a theater often leaves them out. Show them some love!! Go and review!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNVNIaHJhR1ppUzBKVVNUUk5ZMEprT1hscVpIYxAB",
            "text": "The staff was awesome.  Kind, friendly and very welcoming.  Our server was Sara and she was a delightful addition to a great experience.  Sara was attentive, engaging, and informative.  She made the evening that much more enjoyable.  The food and the atmosphere was wonderful.  My family was from out of time and was very impressed with the food quality and atmosphere and of Sara.  I look forward to bringing my friends here for a afternoon or night out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reFRFeEZhR1JyY2tjMWRrRnFaV3RsWnpWc1oyYxAB",
            "text": "today is my birthday, I have a tradition of trying something new. Today I wanted to try onion soup. I wanted this for a long time, and went hunting , in search of a decent place . I stayed in complete delight- the food, atmosphere, service was all on top level. my waiter was very accommodating and friendly. I will definitely be back to show this pearl to my friends. Thank you Marseille for helping make my day even better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVlNITm5OVE51VmxSeVNEWmlNVE15ZUVoaWVuYxAB",
            "text": "Went here for restaurant week, summer 2025. Had a very good experience. Ordered the risotto, coq au vin, and profiteroles. Serving sizes were generous and food was high quality. I added salt to bring out the flavor of the savory dishes, just personal taste. The main course was quite large and had lots of different tasty elements. The profiteroles were a very satisfying end to the meal. Staff were all very pleasant and professional. Environment was lovely, aside from an intermittently screaming baby. I would dine here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMVVGZFVhM0owYkdGcmFtWnJObTV3VUZoRFFXYxAB",
            "text": "The food was delightful. I recommend the short ribs. Henry, our server was witty, charming and  a lovely visual  dessert."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbU5yb0lnEAE",
            "text": "Ryan was our server for brunch and he did such an amazing job at explaining everything and giving recommendations. I booked the reservation on a whim and was very glad to do so as it quickly became packed after opening at 11am. The food was amazing, atmosphere was great ! Marseille is a great place to catch up with friends or to just have a good brunch and dessert at."
        }
    ],
    "reviews_count": 99
}