{
    "name": "Cheeseboat",
    "place_id": "ChIJr3AB_oJZwokRod2Io-keXUk",
    "grid": "MN4",
    "address": "747 9th Ave, New York, NY 10019, USA",
    "rating": 4.7,
    "user_ratings_total": 653,
    "phone_number": "(646) 684-4214",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlJqaGhVSEZXYlVGc1dFeG9WVWxTUlhCa1JVRRAB",
            "text": "Needless to say the food is true authentic Georgian and delicious. Staff is friendly with a very warm and attentive attitude. Overall a cozy and delicious restaurant to visit."
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTlJVUjFjM1Y0TjFGaVVFSTJaMTluYkRsSldYYxAB",
            "text": "I had a chicken Cheeseboat! I loved it so much - so soft and so so creamy! I am coming back with my friends to try many other cheeseboats and khinkali.\n\nHuge thanks to lovely staff❤️"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1VsSXhORGR4V0RKdk1IcDFTWE5ZY1c1emMyYxAB",
            "text": "Delicious food like in Georgia for affordable price"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMFRsbHNaMVpEVnpKMmF6TktMVTEwYlRodFNIYxAB",
            "text": "The good and the service are fantastic! Especially steak cheeseboat, kebab and khinkali. Drinks to die for - we tried some cocktails: Churckhela and putins tears are very very authentic and flavorful!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaExVZEtkamhIYTNReWVXbHJNRVkzYVcxQ01HYxAB",
            "text": "Came here with my girlfriend and wow — everything slapped! The steak was cooked to perfection, super juicy and packed with flavor. The Cheeseboat was insanely good, like comfort food heaven. We also tried the khinkali — so soft and juicy, hands down one of the best I’ve had in NYC.\nService was on point too — super friendly and chill vibe all around. Cozy spot, good music, great food. 10/10, we’ll definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVVJUbHhjWEZMTW5KZmMzRnhUVFJoV2tsemVGRRAB",
            "text": "So unfortunately, I’ve had nothing but positive reviews just speak on behalf of my experience here, but unfortunately, the last time I went, as well as the time before I felt very uncomfortable due to the fact that the waiters were very unprofessional and immature, and the way that they acted towards me and my boyfriend. I feel this behavior personally made me feel very uncomfortable because it seemed to us that they were talking and giggling behind our backs, which is very uncalled for and not professional whatsoever. Therefore, I will never go back to a place where I feel uncomfortable before I have to eat the meal that is served And I hope nobody ever has encounter the same situation which is why I am leaving this review today in description, the server I believe is the only African-American server along with another European server that has very tall and carries gauge earring. I’ve been testing out different types of arms for multiple years as a hobby of my best friend and I and never have I ever encountered the situation in which I was demeaned in such a way and I hope this is never repeated best of luck to everyone else."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNWVsUnZjRkZCZDB0eFdHRnJZVzk1TmxoVVozYxAB",
            "text": "The food is good and tasty, but the staff is quite strange. I wanted to relax and eat, but they sat me in the center of the table when the whole restaurant was free... It's funny, it's a shame that the restaurant suffers because of the staff."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc1JuWkZiMFpCV0hKNGRVNVRiVUU1YUZadVpsRRAB",
            "text": "Watch out for the raw meatballs! It gave me food poisoning! I ordered $28 meatballs cheeseboat yesterday and I accidentally chew on raw meat. I notified the server and was told they’ll make me a fresh one but that was a lie! I was on my last piece of overly cooked meatballs when I realized it was the raw one that I chewed and pieces that I spat out. That was my first time in this restaurant and I’m never going back. They also didn’t apologize, they didn’t feel sorry about it. I didn’t take any photos because I didn’t want to make a big deal out of it but waking up with a bad stomach urged me to warn everyone."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWFJWcG1VakZ6VVVSVWQwZEJVa0pXTkd0R2FrRRAB",
            "text": "We ordered and waited 30 minutes for the order, they didn't bring anything. Having found out in 30 minutes that no one had prepared the order, we left hungry, we felt indifference"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWU5qRTNPVzFvTkdkd1ExaGlSVVl4ZG5CSFdXYxAB",
            "text": "Terrible service! We have been wafting for 30 mins since we made an order with 2 kids - NO FOOD.\nIt’s insane! I have never been so humiliated. Nobody cared about us.\nThe waiter is very arrogant and not friendly.\n\nWe love Georgian food but the level of treatment that we got is unacceptable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTmMxQkJlV293UzNremJHUjFPWGhxZUVwaWRIYxAB",
            "text": "Visiting third time this place. Quality of food and service went down drastically."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSFlrODNNMFF3VUVKWFh6WnViV1JNYkVOMVUwRRAB",
            "text": "I don't think enough people know about cheeseboats... once everyone finds out, the line will be down the street! Always so delicious!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaVQzUndVbTVqVjJsMk0xcE9hVXBuWDJoVVFYYxAB",
            "text": "Lovely Georgian restaurant with friendly service. Cheese boat with spinach was delicious and freshly made (sorry, no photos!). Lots of vegetarian options—but cheese is the primary ingredient"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeVRuRnZNVE0wT1VGSlMwVnRjbXBUTlVabWQyYxAB",
            "text": "It's OK.\n\nIf you've been to Georgia, you'll probably be disappointed in the mellow flavors and distinct lack of spices in most dishes we tried.\n\nKhinkali aren't always available, which was also a disappointment. Hopefully they're there for the late dinner rush."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNU5QQUF3EAE",
            "text": "Update Oct 2025:\nI am updating my review after 2 years from five stars because I really feel the quality has gone down. The cheese boat is continuously shrinking in size, it’s a bit of a joke how small it’s gotten! I’d usually order the magic mushroom which was a mix mushrooms, now it’s just regular white mushrooms. I don’t know if they’re cutting costs on produce but the price is higher so the value just isn’t worth it anymore imo.\n\n_______\nOriginal review:\nLovely little restaurant in Hell’s Kitchen. Plenty of tables and good for couples or a larger group.\nWe ordered the soup dumplings, the eggplant rolls with walnut and the \"magic\" mushroom cheeseboat. The soup dumplings were very tasty, the pastry a little thick. The eggplant was good. The cheeseboat… excellent. Incredibly delicious. Our first time eating Georgian food so we didn’t know what to expect but the cheeseboat was a winner. The accompanying green sauce very good too.\nDefinitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT0xWWkVNRmh1YUU5U1pFMHdNbHBUVUdreFlsRRAB",
            "text": "We were visiting Hells Kitchen and I was so excited to eat Georgian food. The khachapouri did not disappoint. The restaurant is true to its name in that the majority of its menu is interesting cheeseboat combinations. I had a hard time deciding!! I went with the classic and oh my goodness was it divine. My husband got the steak one. Perfectly cheesy and the egg yolk in the middle makes it heavenly. I also had Georgian soda and it was so delicious. I wish we could eat here more often. We found a table very quickly and we even had a stroller with us for our son and they were very helpful and obliging. The cooks and waiter staff were so sweet in giving our son attention and waving at him. Such a wonderful experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNE9IcG9kbWREV0haclMzQlBOVW8yU0dSVmJFRRAB",
            "text": "Cheeseboat never disappoints! The menu has Georgian classics and comfort food, and delicious wine. The staff make you feel welcomed. I love coming here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbk1GZDRWMm81UkVjeVIwRlFRVTl4ZVVsWVVXYxAB",
            "text": "Always down to try Georgian food, this time for a quick dinner.\nThe khachapuri (cheeseboat) was average size but tasty. I would say it’s good enough for 2 people if you don’t eat much.\nThe atmosphere is great, so it’s the decor. We were taken to our table really quickly and the server was very attentive.\nThe Georgian soda pear flavor is definitely a must try at any Georgian restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRWEwaFFUQzFuVG5aRVRXMVdUbmxzVW5Ka1pFRRAB",
            "text": "The dinner was so delicious. The cheeseboat was so good and had so much cheese in it. Staff is very friendly. Interior is also very cool, you feel authenticity and you’re like in your Georgian grandma’s house. Truly recommend and I will definitely visit again!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3enBfdmJ3EAE",
            "text": "I ordered borscht, two lamb dishes, and a napoleon from this place. As a Ukrainian, let me tell you that their borscht tastes nothing like borscht. It has some weird Georgian spices in it and has no meat. This is definitely NOT an authentic Ukrainian borscht! The bread that came with it was stale and old. The lamb dishes were just OK and the \"Napoleon\"... c'mon! This is not Napoleon! Ugh. Maybe their Khachapuri Ajaruli (cheese boats) taste better, but my food was just a weird take on buzz word dishes. Very disappointing. The lamb dish in the picture costs $30. It came with no side dishes, just another piece of stale, stinky bread :("
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeFFVd3pkV055U1djeldHRkpNa2R3VWt3ME1tYxAB",
            "text": "Wonderful service! Food is amazing! Brings me right back to Georgia! 🇬🇪"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaGFsQnJkRFUxWkdobFJWQnZOVGxLT0hkR2FIYxAB",
            "text": "This family-owned Georgian bistro is absolutely transforming my taste buds! Perfect for adventurous foodies ready to explore beyond the usual NYC dining scene!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTFZVcGZNMmhYZUd0c1dTMDVTRTV1Y2tOUVFYYxAB",
            "text": "Never knew what Georgian food tasted like. Very delicious I found out. Home made bread to go with every home made meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscU1WTlZTM0JLZUc1MWFqVkVSbkJ6YzNKemVsRRAB",
            "text": "Really fresh!! Everything was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1FVTTBUbU5IV2xKU1h5MTZTalZQY0RGR2FrRRAB",
            "text": "Delicious food, friendly staff. I will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd1RVcEVOM1ZMVFhGZk5VSmtZMUEyVUdSZk4xRRAB",
            "text": "This Hell’s Kitchen Georgian Bistro is queer and trans friendly. Many of the staff are queer and the restrooms are single person use with an explicit sign that is affirmatively inclusive of all gender expressions. The bathroom cleanliness is more dive bar than high end hotel.\n\nWe visited Cheeseboat Hell’s Kitchen on the recommendation of a gay couple who had spent time in Georgia in the early 2000s. We started two Watermelon and Goat Cheese Salads. There is a little dressing. Know this salad is both delicious and maybe unexpected since it’s really just diced watermelon and goat cheese with a little dressing, no greens or lettuce. Our family recommended the Adjarian Khachapuri (classic cheese sauce made with cheese, butter, and egg yolk). The cheese sauce was delicious, and it was a delightful experience to cut and tear apart the bread (soft Ciabatta-style bread) what is essentially cheese fondue. It was so good that we ordered the Khinkali (beef soup dumplings on family recommendation) and a second Cheeseboat with Ratatouille.\n\nWhile we would have tried to go for dessert, that amount of food for a party of two was overwhelming and we are bringing back a take away bag, nicely bagged with a compostable green bag."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd1JGWTVOMDQ0V1RGTlRtOUthVGx1U2tkNFJuYxAB",
            "text": "I keep coming back because they never let me down. My visit validated the good reviews. The employees deliver prompt and courteous service. The food incorporates uncommon components with great taste. I discovered this enjoyable place while searching reviews."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNVFWb3dSVXRsZHpKUFZVZHZiWFJTWkZKdFYxRRAB",
            "text": "I came for to eat khinkali soup dumplings but they told me they didn't have any today. I asked for eggplant roulette, but they said they didn't have any. So, I tried the Staek 'n' Mushrooms, which the waiter recommended. It was delicious, especially the cheese, and I definitely recommend it. The only thing the waiter wasn't very friendly at all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNVdFOUVYM00zVUV4WWFtcHZia3hMWm5WclRHYxAB",
            "text": "What a cool little place to get your Georgian cuisine fix. From borscht soup and savory dumplings to the final dessert, you'll be thrilled to chow down on this chef's specialties. The star of the show has to be the cheese boat selection. Delicious fresh baked bread fashioned into boats filled with, of course, cheese. Then choose the little passengers in the boat like meatballs, spinach, brie and honeycomb, steak and mushroom, or leek. The possibilities are endless, it seems. You will never, ever leave here hungry. Nika will make sure of that, and take care of you with true Georgian hospitality! An easy walk from anywhere in the Theater District."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveldYbFFOM1JOTVZKcmNrSmFWRmhQUjBJeFZYYxAB",
            "text": "I will begin this review by stating that I've been overseas to Georgia and tasted this cuisine before.\n\nCheeseboat, and its staff, are top-notch. They graciously allowed me to speak and order in Georgian (to the best of my ability, of course!) My husband and I had amazing wine, khinkali and chakapuli. I wanted a taste of Georgia and I'm so glad I found it in New York City. I'd absolutely return. მადლობა!"
        },
        {
            "date": "2달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aVZIZE5iMVJpTVUxVFVtZ3paMnd5TkRaTlUxRRAB",
            "text": "外からは想像できない良店。シルクロードの地中海料理は意外に親しみやすいお味です。看板料理のチーズボードは一度試してみては！"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMVNIUkJSalkwYnkxT1JGUnBhVEJFVDBSNllrRRAB",
            "text": "Really Authentic Caucasian Cuisine Combined with best Service! Highly recommended from Azeri Family"
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFJsSnhUVFJtY1ZkeWVtVklWM2s0WmtSUVZVRRAB",
            "text": "Przepyszne jedzenie ! Spore porcje. Spokojnie jednym daniem można się najeść. Przemiła obsługa. Polecam !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQlVtcFlTMVJVZVY5Qk1tcGFVakpvZUVWQlpHYxAB",
            "text": "Randomly went here with a friend to catch up and it’s so good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMVpXTklNazVZWkZwdWExcEhjVU5OV0RWRVZGRRAB",
            "text": "It used to be very good, but these days the portions are smaller and the quality has dropped, even as prices keep going up."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZmVtZE5OV0pDZW1sdFJsaGhRM1pRYjNvek9YYxAB",
            "text": "I tried to eat slowly, but I couldn't. It was so good!\n\nMy husband and I shared the Kartvelian Salad (Fresh tomatoes, cucumbers, green onion, and red onions with fresh cilantro, herbs, ground walnuts, homemade sunflower seed oil & Georgian spices) and a steak and mushroom cheeseboat. You can see by the pictures that I didn't even let my husband take pictures before I started to eat.\n\nThere was plenty of food -- we left feeling good and not too stuffed. I COULD have eaten the cheeseboat by myself, but I would not have been happy afterward.\n\nThe server was friendly and attentive. We came on a Wednesday around 8. It was raining, so the place wasn't crowded, just a good mix of people enjoying good food. The atmosphere was nice, with a cool mural that our waiter said represented a famous Georgian poem.\n\nMy only regret -- we're in NYC for only a week, and I found this gem on day 4. BOOOOOO. I want to go back and try everything."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONGQxa3hjVnByU0dsNU5teFdXV1l0ZVVSbVpVRRAB",
            "text": "Been here before but it keeps getting even better. I love all the ways you can eat cheese in one place, brilliant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeE1YRXljemRtUm10MVlsQmphazU2Wkc5eFJVRRAB",
            "text": "Fantastic food and service! Truly one of the best meals I have ever had!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbU5YTnJXR05DVmtKS09EZHlaVk5VYjJkNWIwRRAB",
            "text": "The environment at Cheeseboat shows the same care as the food. Remarkably friendly accommodating bright pleasant employees without any attitude. The cooking is consistently excellent and the atmosphere stands out. This restaurant delivered perfectly in all areas. I want to come back without much delay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bU5sZGZaR3ROWmtNM1duZEZSVmxIYm0xelprRRAB",
            "text": "Good food and good eats."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OM1dIWlBkRTVOZW1KRFVXTlNkMGxVTkRkaU5rRRAB",
            "text": "This place is a real gem. Highly recommend 👌 👍"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmVxWmN3EAE",
            "text": "Nice folks and great food.\n\nHave some chacha.\n\nUpdate 7/31/25: Still great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVJsRmFURzlDTTNrNFRURnpWREZGYmxCU04yYxAB",
            "text": "🇬🇪 the best restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUVlYaHhaazVpZVhsbFdGTTJaVVprZUhGemFIYxAB",
            "text": "Delicious food and great staff, I ordered the prosciutto cheeseboat and the borscht. Both tasted incredible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd2NsSlpkVTFGY0VwUVkzWnFVSGg1Vm5RMFptYxAB",
            "text": "Deliciously!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaE5uZHFRMjVEVVd4WVFuWlpabkJWVmtKUmRtYxAB",
            "text": "Tooo cheesy, if you are fan of cheese and bland food then this is the place for you. Basically another form of deep dish cheese pizza"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeE0zY3lVM1ZXWW04d0xXTnlhMnhYZW10SU0xRRAB",
            "text": "Cool Georgian spot with a variety of Khachapuri. The  spot  had  a nice vibe.\nWe only ordered two dishes which were pretty filling.\nThe meat crepe was really good.. flavorful and easy to eat.\n\nThe cheese boat was good as well. First time having one with steak.\n\nIt's a glass enclosed kitchen so you can see what they are cooking.\nThe bar seating is small. Tere was only 4 seats I think.\n\nService was great despite only one person on the floor who was also making drinks. His name was Georgie.\n\nWant to go back and try other dishes like their borscht and kebabs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a01sWjZOamxDVGpjelEwNHRXRXhIUTNkUGJVRRAB",
            "text": "Cheeseboat is one of those spots you simply can’t miss if you’re in the mood for something both unique and incredibly satisfying. This place brings a whole new twist to comfort food with their specialty: the Adjaruli khachapuri, a traditional Georgian bread boat filled with cheese, butter, and a perfectly cooked egg. It’s rich, creamy, and indulgent in the best possible way. If you’ve never had it before, you’re in for a treat!\n\nThe menu offers a variety of cheesy dishes, from their signature khachapuri to hearty soups and other Eastern European-inspired comfort foods. Every dish is bursting with flavor, made with high-quality ingredients that ensure each bite is satisfying.\n\nThe atmosphere at Cheeseboat is casual and relaxed, perfect for enjoying a leisurely meal with friends or family. The staff is friendly and attentive, making sure you feel right at home as soon as you walk through the door.\n\nWhether you’re craving a cheesy, decadent treat or just want to try something new, Cheeseboat is the place to go. The food is delicious, the vibe is great, and you’ll definitely leave with a full stomach and a smile on your face."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM00wNTFXVWg0T1ZKM1dqQlFlamhMTUc0eFdIYxAB",
            "text": "Love love love!  Friendly. Nice atmosphere.  The food was amazing!  Shkmeruli Chicken Boat is my new favorite food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFpFd3hOMGRLT0RGa00wTkNVV0p1U210dGMzYxAB",
            "text": "We came into this restaurant very curious about what Georgian cuisine was all about. From our drinks to our main dishes, we were amazed by every single thing we ordered. The staff was very attentive and friendly with helping us out in picking our meals. I HIGHLY recommend Cheeseboat to anyone that comes to Manhattan!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dDl1ZU53EAE",
            "text": "This is an amazing spot to dive into authentic Georgian cuisine! The chicken cheese boat was absolutely delicious—rich, cheesy, and perfectly baked. The borscht soup was another highlight, bursting with hearty flavors and warmth. Also the hummus was outstanding. While the spinach cheese boat was just average for me, the overall experience was fantastic. The cozy vibe and friendly service make it a great place to enjoy something unique. This is definitely a restaurant I’d recommend to anyone looking to try Georgian food, and I’ll certainly be revisiting soon to explore more of their menu!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKT0E5S3FvaTQ3VDhnRRAB",
            "text": "Felt like a little escape, cozy, welcoming, and full of charm. The food was fresh and full of real Georgian flavor, especially the khachapuri. Simple, honest cooking that hits the spot. Loved the vibe, too, relaxed and atmospheric without trying too hard. Definitely a place I’ll come back to."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMk9yNGxBRRAB",
            "text": "I visited 5 times! The spinach cheese filled dumpling is THE BEST! I came to eat this again:) Also, cheeseboat and chicken with sauce was amazing. I recommend this place for everyone. Every time I come here with people who never tried Georgian food.\nPlus, they should add Spinach dumplings in menu (please)!!!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHJPbmFBEAE",
            "text": "🥟We absolutely loved the food! I’ve never tasted such delicious Georgian cuisine in New York before. The bartender was incredibly helpful in choosing the perfect wine—he understood exactly what we wanted with just a few words. We will definitely be coming back. Thank you for such a wonderful experience!🍷"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNnIxYWJJOTZ2Q0tBEAE",
            "text": "Nika was a great host — validated all my choices (and he was right when he said they were good ones!) Fresh frozen raspberry daiquiri, the chicken entree, and meatball cheeseboat split between the 2 of us. We were so happy to have Nika as a server, so kind and happy to be there! Easy to make and change reservations as needed too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPclY4SlR5NHFYQXNBRRAB",
            "text": "Great Georgian cuisine place. Food was delicious. They specialize on khachipuri, but have a great selection of other dishes as well. We had khinkali, ajapsandali and cheeboat. Everything was amazing. We will definitely come again"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLVlDVWJnEAE",
            "text": "One of my absolute favorite Georgian restaurants! Everything is delicious! The atmosphere is wonderful, and the staff is incredibly warm and welcoming. Among the more modern dishes, the steak khachapuri is a standout. Also, the borscht is phenomenal—one of the best in the city!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXZPbGFREAE",
            "text": "My FAVORITE place to visit in NYC when I’m craving super cheesy, flavorful dishes. The pictures speak for themselves. Don’t miss out and share a cheeseboat + creamy Georgian chicken stew with your next date. I can’t recommend this place enough it just hits the spot and it’s executed perfectly every time we visit.\n\nI just got off a flight and this is the first stop I wanted to make for dinner with friends. Well worth the $$"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReUxUX0VREAE",
            "text": "Cheeseboat in New York, NY. Come have Mama Cheeseboat cook some authentic Georgian food for you! I never had Georgian cuisine before and it did not disappoint. The fresh flavors were absolutely delicious-especially the CHEESEBOAT! Make sure to try some Georgian wine! Located in Hell’s Kitchen and Williamsburg-Cheeseboat has you covered!\n\n🌀Kartvelian Salad-Fresh tomatoes, cucumbers, red onions with fresh cilantro, herbs, ground walnuts, homemade sunflower seed oil & Georgian spices.\n\n🌀Cheeseboat-Classic, traditional Cheeseboat (Adjarian Khachapuri) Caldron of cheese in bread w/ egg and butter.\n\n🌀Khinkali Soup Dumplings-Stuffed w/ ground beef, Georgian spices & herbs, served w/ traditional garlic Neeor'tskali sauce.\n\n🌀Georgian Lula-Kebab- Ground beef on a skewer cooked with the addition of barberry, which gives freshness and juiciness to the kebab. Served with Tkemali green plum sauce.\n\n🌀Napoleon- Very thin decadent puff pastry cake with homemade rich custard cream in between the layers served with sliced fresh strawberries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGRxemRBEAE",
            "text": "We came here before a show for lunch on a Sunday, and had a wonderful experience! We ordered multiple dishes for the table to share, and for four people, we left stuffed. The eggplant and the cheese bread were the stars of the show. Food was flavorful and cooked to perfection. The cheese bread comes with a pool of cheese, egg, and butter. Our server mixed it up table side, giving us a fun show! I cannot say enough how much I enjoyed both of these dishes. We also had the meat roll ups, soup dumplings, and shakshuka. Everything was delicious. Highly recommend coming here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cVlHSUlBEAE",
            "text": "Been to this place twice now - one for dinner one for takeout and both times the food was amazing.\nI love Georgian food & was so happy when another spot opened!\nThe dumplings are some of the best I’ve had - they are super doughy but they also are NOT shy with the filling. The shkmeruli chicken is rich and decadent and divine. The cheeseboat selection incredible & the flavors S tier.\n\nThe only reason I knocked off a star is the service. It’s slow slow. I ordered wine and did not get it. I waited long after I sat to be greeted.\nStill worth going."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGRpNWRBEAE",
            "text": "Absolutely delightful food all around. I can't speak to the authenticity of Georgian food, this was my first experience. Everything was incredibly flavorful and delicious! I recommend coming as a group and splitting everything. I tried the soup dumplings, the potato and cheese bread, and the meat crepes. No complaints whatsoever! Everyone left happy. Only downside is the food is very expensive. Be prepared to spend $50 per person. It's worth it though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLXJ1Rm5RRRAB",
            "text": "My family and I came to this restaurant for a birthday and we had the greatest of experience! The food was excellent and even went beyond my hard-to-impress family members’ expectations. The service and staff were also amazing. They took the time to make great food reccomendation and even offered some off menu items for us to try. The staff interacted with us the whole night and brought out a lovely cake with a candle for the birthday person. Would strongly recommend trying this restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOEt6RFlnEAE",
            "text": "Great service, and amazing food! Hands down the best meal we have had all week. We ate until stuffed, then kept going! Don’t sleep on this place, trust me. The Shkmeruli chicken was probably the most flavorful chicken I’ve ever had, and the hummus was incredible. Not gonna lie, the steak and cheese boat came last so we only ate the steak and cheese- we were too full lol. We will definitely be back here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMVlIS3R3RRAB",
            "text": "Great music and vibe ! Decor also great. We tried a traditional Georgian cheese boat as well as a gluten-free eggplant roulade! This enjoyed with some delicious Georgian wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb195bDJnRRAB",
            "text": "We had a wonderful dining experience at Cheeseboat. We tried the traditional Georgian Khinkali and Eggplant Roulette, and both dishes were absolutely amazing! The flavors were authentic and delicious, with the Khinkali being perfectly juicy and the Eggplant Roulette rich and flavorful. The service was also good – friendly and attentive. Overall, a fantastic place to enjoy Georgian cuisine, and we can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcUk2ek13EAE",
            "text": "Yum and Fun. Went here and had a fun time along with some great wood and decent wine.  Have never been to a Georgian restaurant before.  Bottom line is will be back.  We got the khinkali soup dumplings (enjoyed them, very interesting, very juicy filled with broth and meet was chocked full of savory spices, very filling, lots of dough not exactly to my taste but I have nothing to compare them to since this is my first time trying a dumpling like this  - 4 out of 5.  Also got the traditional cheese boat, and this was by far the star of the meal.  Bread was outstanding, cheese was delicious, fun to eat food and filling as well.  Really enjoyed it with some wine.  6 out of 5. Loved the green sauce as well ( like a Georgian version of a Chimichurri)\nService was very attentive and helpful. Atmosphere was enjoyable.  Will definitely be back to try different variations of the boats."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQckwyZnRBRRAB",
            "text": "Really good cheeseboats and Georgian wines - food was amazing but a person in our party didn't get the food they ordered. Luckily, the atmosphere was pretty good and it didn't matter that we had to wait longer.\n\nOverall a really good place to visit if you're in or around times square!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGZ2RiSTF3RRAB",
            "text": "First time to try the Georgia food. It was amazing. The beef and mushroom cheeseboat tasted savory, soft and delicious. The sweetness level of their Napoleon cake was just right for me. I will definitely recommend this place to my friends."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMkxpVTNBRRAB",
            "text": "Excellent restaurant !\nThe katchapuris are delicious. We tried the original one with bacon and the brie one with honey.\nThe original is DELICIOUS! And the bacon just adds another layer of deliciousness. The green sauce is also amazing.\nThe brie with honey one with some nuts and apple slices is sweet and good but not as good as the original one. Great as a desert.\nService is amazing, our waiter was incredibly kind.\nThe restaurant doesn't look that good from outside, but give it a chance and you'll have a great dinner.\nEdit: went there again after a few months and it is still excellent with amazing service. Highly recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dF9qalpnEAE",
            "text": "Yum! We will absolutely be coming back. For an unassuming restaurant in Hell’s Kitchen, the food here really packs a good punch. Absolutely delicious. We got the leek cheeseboat and salad. The service and atmosphere was also great. Highly recommend for vegetarians and also a surprising number of vegan options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa3F6MGt3RRAB",
            "text": "Had a wonderful lunch at the Georgian restaurant in Manhattan! The atmosphere was cozy and inviting, and the staff made us feel right at home. The khachapuri and khinkali were delicious, perfectly seasoned, and served piping hot. Their wine selection complemented the meal nicely. One minor hiccup was a slightly delayed service, but overall, it didn't detract from the meal. Definitely recommend this spot if you're looking to explore unique flavors and enjoy a taste of Georgian cuisine for lunch. ⭐⭐⭐⭐"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM09hVTZ3RRAB",
            "text": "Cheeseboat is a beautiful restaurant with delicious food. I came here for my birthday and my group ordered the imeruli, the prosciutto cheeseboat, the steak and mushroom cheeseboat, and the Shkmeruli chicken boat, all of which were absolutely delicious and perfectly cooked. We also ordered cocktails which were very nice, the Motherflower being our unanimous favorite. We also had the white wine sampler, which was a very nice introduction to Georgian wines, and the waiter was very knowledgeable about the wines they had. When we first ordered our drinks, they took a while to arrive but after that the service was at a more regular speed. We were seated at the back in a small alcove with a beautiful mural on the wall. Since it was my birthday, I received a (surprise!) complementary Napoleon which was large enough to share with my group. Overall, I highly recommend Cheeseboat and would absolutely return"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODR6cmVnEAE",
            "text": "We were very happy with our dinner and wonderful waiter. It was great to experience new food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldGI2cnFBRRAB",
            "text": "Great place with an amazing atmosphere and authentic Georgian food. The menu has a lot of vegetarian options. Wonderful backyard showing to you very unique and specific view to the 5 floors buildings from inside. Open kitchen made this place more cozy and homey. Georgian wine, Georgian Chacha and the cocktails also are great and tasty. It will be great if in the menu also will be a Georgian mineral water :-)\n\nCan't wait to come back. Right the way that place became one of my favorite place in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN2R2RGFREAE",
            "text": "Georgian cuisine is one of my favorite cuisines in the world. It's rich in flavors and tradition, featuring delicious dishes like khachapuri and khinkali. Cheeseboat was amazing. I highly recommend this place to anyone who wants to have a real Georgian experience. 🧀"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X1pEQlBnEAE",
            "text": "Hidden gem.  Awesome array of dishes from carnivore to vegetarian.  Drinks with different types of liquor you don't find in regular bars.  The outside doesn't do it justice- I'll be back!  Definitely worth a stop."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZjFzOHlYd29PQ1lBEAE",
            "text": "Great place with nice decor and very friendly service. Food was delicious and up to a high standard! Definitely Georgian's style!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMVktUVRnEAE",
            "text": "This Georgian restaurant is an absolute gem! The service was top-notch, and the food was nothing short of amazing. Hands down the best meal we’ve had all week. Every dish was packed with incredible flavors, and we couldn’t stop eating—even after we were full, we just kept going! If you’re looking for an unforgettable dining experience, don’t sleep on this place, trust me. You won’t regret it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWZ0l1YjJ3RRAB",
            "text": "A Georgian restaurant with traditional menu and food.\nIt's definitely worth the experience.\nThe food is different than you're used to . While it can be a bit heavy but is worth it.\nThey have good wine, too . Ask for a taste .\nIt's not too pricey but not cheap, either.\nThis is a place where you are experiencing traditional food, so go past the looks of the restaurant"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbUpDRDFBRRAB",
            "text": "The restaurant is very casual, but the food is on point. Very authentic. Lived Zelensky drink and the napoleon for dessert. My go to place for Georgian food as a pre-theater lunch/dinner place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b0pMX253RRAB",
            "text": "Absolutely delicious meal! We let the server know it was our first time trying Georgian food and their recommendation did not disappoint. Portions were generous, everything was coursed out nicely, and cocktails were delicious and complemented the food. I know the cheeseboat is the special, but we cannot stop thinking about the shkmeruli chicken! Cannot wait to come visit again soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzdldmFnEAE",
            "text": "The cheeseboat was pretty salty but it was still good along with the Georgian dumplings. The sauce that came with it was pretty underwhelming though. Service was fine at first, they were welcoming and nice, and checked up on us to see how we were enjoying the meal. But then… they kept coming back lmao and checking up on us, it almost felt like they want us to hurry up and finish the food and get out, despite the place being empty. Guess the staff want to sit idly around in the restaurant and have the place to themselves🤷‍♀️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc18zcTF3RRAB",
            "text": "perfectly delicious and traditional Georgian cuisine. friendly service, professional and responsive speed. at first glance the establishment is gray but the atmosphere after a piece of khachapuri, a sip of wine - will make your day bright and pleasant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNFlxaDh3RRAB",
            "text": "We stopped in here on a food tour and absolutely fell in love with the cheeseboat that we sampled.  We came back the next day to have another cheeseboat (with bacon this time) as well as dumplings and an eggplant dish.  All were very tasty and fresh, and the freshly baked bread is delicious.  The staff were friendly and helpful and offered tips on how to eat the dishes that weren't obvious (dumplings have a trick).  Our server gave a nice show mixing the cheese and the egg together.\nWe highly recommend eating here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHRHblpnEAE",
            "text": "This is an awesome place with awesomene people working there. Mama and Junior Cheeseboat are rocking the place. The meal was very delicious, if you like cheese but who doesn't. The atmosphere is very nice! They're very friendly and hard workers. Thank you so much!!!"
        }
    ],
    "reviews_count": 86
}