{
    "name": "Bocca di Bacco Theater District",
    "place_id": "ChIJAbHSp8NZwokRV56pK23WC_Y",
    "grid": "MN4",
    "address": "635 9th Ave, New York, NY 10036, USA",
    "rating": 4.5,
    "user_ratings_total": 520,
    "phone_number": "(212) 262-2525",
    "reviews": [
        {
            "date": "1일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4YWExcHVWbVZzVTA5UU9WZDFNQzFmY0RKamNWRRAB",
            "text": "Pedimos la comida y la trajeron en menos de 2 minutos.\nSin sabor, totalmente artificial.\nDe italiano solo tiene el nombre."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORGNpMVhhR1ZEYUZCRmVXbDNObVl6VUZCR1JXYxAB",
            "text": "Bocca di Bacco is an absolute gem! The octopus dish was perfectly tender, the seafood pasta packed with fresh flavor, and the tiramisu the perfect sweet finish. The service was attentive and friendly, and the atmosphere had a great energy — romantic yet lively. Definitely worth the value — can’t wait to go back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVJYZzFTamxGVmxGRlNtVndYMWgzU1cxelNVRRAB",
            "text": "Beginning with the reservation portion, I had a reservation at 6:45 PM and did not get seated until 7:10PM. What is the point of having a reservation if the hostess is not welcoming guests and has to be flagged down by a crowd waiting at the door. Secondly, our waiter did not even introduce themselves even after having us wait. He did not ask for our drink or appetizer order. We ended up flagging him down and ordering. The food was mediocre, the temperature and presentation of the food was good but it had no taste. The vodka rigatoni was chewy and the steak frites tasted burnt. The waiter did not check up on us once and we had to flag him down multiple times while he was attending to other tables. He was very distracted and not attentive to any of the consumers. Overall I do not recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM01FTnBUbkJwUjBKM1UyWklkM3BPYzBab1RsRRAB",
            "text": "I tried their short rib main course ($39). It came mashed potatoes and spinach. The spinach and the mashed potatoes had the appropriate amount of flavor, the large size portion of short rib was dry and did not have enough flavor to match others i have had elsewhere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMWFYWkpVbXN3U0doSFVHMDFTSFpqZERKMWJrRRAB",
            "text": "What an amazing restaurant. The waiter was so nice and welcoming his name is Roman, he made our experience so special. Also, the food is crazy good. I highly recommend the Pollo Piccata"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV1VXOUNjMHByUkUxc2FqbEVXamxDZFdaNFQyYxAB",
            "text": "Giving this location 5 stars. We came here without a reservation and were happily welcomed by a gentleman in the front. His hospitality was so infectious! Our waiter was fantastic I believe his name was Fernando. We got a bunch of items to share between 4 of us. Pricing at the location was average and food portions were great. We spent $122 a person with 2 appetizers, 3 entrees, two desserts, and 3 drinks each. I would recommend the burrata, and any pasta dish really. We did not love the rice balls but it was just a filling preference. Overall the stars of the show were the cocktails and desserts. Their watermelon vodka martini was exceptional with fresh watermelon making it so refreshing. This drink was not too sweet very well balanced. The dessert was such an incredible surprise when it came out we gasped! Amazing presentation and very yummy! We sat there for hours without anyone bothering us. The gentleman that greeted us was so happy we were smiling on the way out and told us to please come again! We will absolutely be visiting this location again! Thank you all who did an amazing job serving us!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZlJqUjFObFpQWm1WcGNtWklkV2hyU1Vkc2RuYxAB",
            "text": "I cannot say enough good things about the quality of service here! Very efficient, extremely friendly, and not to mention, the food was incredibly tasty. A nice sized menu and wine list and not unreasonable prices. Very cool atmosphere, too, Highly recommend coming here before a show."
        },
        {
            "date": "2달 전",
            "language": "nl",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST1FXRjVkMGx5VTFKVVNrUXRkMHN3VDNsTVMxRRAB",
            "text": "Scammers. Lang geleden dat we ons nog zo in het zak gezet voelden. Buiten een bord om volk te trekken met zogenaamd happy hour, van zondag tot vrijdag. Als je de rekening krijgt blijkt alles netjes full price aangerekend. Als we een opmerking maken over de oneerlijke info krijgen we de mededeling dat dit alleen aan de bar geldt. Je mag dit overigens zelf uitzoeken want het wordt nergens vermeldt. Wat een afzetters!! Er is keuze genoeg aan restaurants en bars, ga gerust elders eten."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM1JWWXpMWEZ0ZW1aQmVqQXlVSEo2WkRsRFkwRRAB",
            "text": "Great spot. Ulysses was a wonderful host and bartender. A definite pre or post spot for a show. 🤌…"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMmJVVkdRbTFUZFVWbU5rbElja3RZUnpSNFJYYxAB",
            "text": "Espectacular. Moi moi recomendable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUmNVTkZRbFZpUlhJNU0waFNMVEoyYld0RWJFRRAB",
            "text": "seems like pre made food re heated in a microwave.   absolutely no"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObE9UbHFOQzFVWVZFd2IwaG9SbUZwT0dGaU5XYxAB",
            "text": "Bad service, they are paying attention to everything but the customers! Bad service, they are paying attention to everything but the customers!\nThe Happy Hour on the website is misleading, when you arrive at the restaurant the options are limited and more expensive!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFFVSjBUMjlDU1ZNeFVFaDZaWGREVFdWdVZGRRAB",
            "text": "Happy hour menu did not match with the happy hour menu in the site.\nBrought up to the managers and bartender and they did not care.\nWon’t return to this location"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVmEwaDVhRkZWVkVkaWVYQXlka3c0V205dWVtYxAB",
            "text": "Delicious Italian food, good for lunch, small bites and dinner. Well made drinks. A bit on the experience side but not much. Will go again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NFozSm9jVEZITFhoV2EwcHhPRTlUTTJaaVNVRRAB",
            "text": "Incredible service from out waitress, Natalia, we think she is the kindest and has great recommendation. We had the chicken parm, gnocchi and the lasagna!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUlEwUnNVVEF5V0RGV1prUjRabFF5UTNkWVNWRRAB",
            "text": "Went for lunch. Had tuna tartar, which was excellent.  The fish was delicious and served with a spicy mayo dressing, which was exceptional. I also had the Bolognese, which was almost inedible - the pasta was not al dente (it was just undercooked) and it was really salty.  Ate three bites and that was it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVdFVldORVI1UkdaSWJFdG9iMFIwYUdGTVRHYxAB",
            "text": "I’ve lived in the neighborhood for over a year and this has been my go to spot to sit at the bar during the day. They have a wonderful prefix menu and drinks. Most importantly the bartender Roman has been the reason I go back. I work in the industry and people like him are what really makes a restaurant. I will come back even when I no longer live here!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1IwRkdiRzlRVEZCb05FTXlPRTQzWDNKblRXYxAB",
            "text": "Excelente todo!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb1VDMWlRVmgzUm1sSFZHbEJabGRCZFdKcE5XYxAB",
            "text": "Cute little spot close to the Westside Theater. The bread was good, we enjoyed the calamari/zucchini, and our main entrees, rigatoniand fettuccine ai funghi were great. Friendly service and we appreciated how they beverage let our waters empty on a 100 degree day."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNmJGRlZjVkpLY2t4c1gyNURjRGRHUTBkWU1YYxAB",
            "text": "Do not recommend this location, try the Hell's Kitchen of Chelsea spot instead. Don't know if it's because of the location, the 3 course prix fixe dish portions are laughably smaller than the other locations. Food's still good, nicr bread as well as service, but the portion size difference just cannot be ignored."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sc1VrazJRVWRXV1VKU0xVTnBOMDlaZFZwZmNrRRAB",
            "text": "LOVED this restaurant! Perfect dining experience for family of 4 (2 teens). Fantastic drinks, food, and dessert. Best fruiti di mare I've had in a long long time. Fantastic service too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObWF1dXFua1ltMllREAE",
            "text": "I always get the rigatoni and vodka sauce… with sausage added. I could eat it everyday."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNkp1ZXJibHI3eVZ3EAE",
            "text": "An amazing experience, 10/10 recommend the Bocca di Bacco location in the Theatre District. We dined in on 5/30/25 after seeing a show on Broadway.\n\nService: The service was fantastic, from beginning to end. The staff (the manager on duty) were so welcoming to us. We made a reservation for 9:30 PM, however I made it for the wrong location (made it for the location on 54th Street in Hell's Kitchen). The manager was completely okay with what had happened and was very understanding, and still accommodated us.\n\nFood: This was my third experience at Bocca di Banco, but my first at this location. We chose to skip the appetizers this time. From my past experience, I would recommend the burrito (see previous posts). I had the gluten free rigatoni pasta and it was filling and cooked to perfection. My sister had the bolognese. If you have dietary restrictions and have to eat gluten free, they do offer gluten free pasta. You have to ask to substitute for gluten free pasta when you order, I don't recall seeing a disclaimer for the pasta on the menu, but they do have it available. Our dishes came out warm, the presentation was extraordinary and appealing.\n\nWine/Cocktail Selection: The wine and cocktail menu- there are so many options, and you can immediately tell that the management team is careful and selective of the wine they place on their menu. I ordered a bottle of Sangiovese, and it was the perfect combination with my Rigatoni dish.\n\nWe visited on a Friday night, and they were open late, so if you're looking for a real Italian dish, a fun/relaxed atmosphere, this is your place. They are also open late until 11PM on Fridays, so if you need a late dinner, they are accommodating and this is a go-to!\n\nIt was also my sister's birthday, and when the manager asked what brought us to the city after making conversation- we told him we were celebrating her birthday. The manager told our server and when we finished our dinner, she brought my sister out a few pieces of cake drizzled with chocolate. The manager didn't know the server brought out a dessert, so the manager brought out a SECOND dessert with a candle on it. At that point, we hardly had any more room to fit food, but the fact of the matter, was that the staff and manager were thoughtful beyond measure. They also took a picture of my sister with her birthday dessert with a panoramic camera and gifted her the picture as a surprise."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYjc5dmo4ejRhTFpREAE",
            "text": "Nice pre-theater spot. Not a traditional Italian restaurant (Crab cake! Raw tuna! On guacamole!). But they also have the usual suspects. In American portions."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcS1fa19RRRAB",
            "text": "The service was fine, but the food was nothing special. We were just two people, and they forced a 20% tip on us without even asking. Honestly, I do not recommend this place. Out of all the places we tried in New York, this was the only one that charged us a mandatory tip - and to top it off, the food wasn't even good. Definitely would not recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM1lIU1BnEAE",
            "text": "We had the eggplant parmesan, brussel sprouts, a lemoncello, and tiramisu. It was all so good! If I had to choose the best I'd say the eggplant parmesan. We arrived around 6 and were sat within 10 min. Attentive service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2ZhN2J3EAE",
            "text": "It was great! Amazing food and great people."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaU9yWGRnEAE",
            "text": "We chose this spot because it's close to the theater district for dinner before a show. It was clear that their primary goal is to get people in and out as quickly as possible, to the detriment of the food and service.\n\nWe ordered our food and it was delivered to the table so quickly I was suprised the pasta was fully cooked (< 8 minutes). I ordered a pasta dish with chicken in it. The sauce was very good but the chicken had clearly been chopped and cooked earlier in the day and then reheated when they prepared by meal, as it was dry and had the consisentcy of canned chicken. I was expecting much more from this place.\n\nServers were kind and courteous, though they were hovering to clear dishes before we finished eating. Someone was lurking over the table to bus my dish before I put the fork down from my last bite.\n\nIt's good if you're looking for something REALLY quick before a show or event, but otherwise I'd recommend skipping. There are a lot of other places nearby with a better experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN19mVFFREAE",
            "text": "Excellent service and delicious food. We had a larger party for a bachelorette dinner and they took such good care of us and customized the experience to our needs! Elegant ambiance as well and beautiful presentation of plates. I recommend this for any occasion like a family dinner, night out with friends, or a romantic date. I cannot recommend enough! We will certainly be back, thank you to the staff and attentive manager!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdy1uUy1RRRAB",
            "text": "A wonderful restaurant with personable, attentive wait staff. A close table to table ambiance with wonderful menu selections... they'll respect your timing and get you out in time for the theater!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZzRmTVhREAE",
            "text": "The food was spectacular! I had the Branzino Griliato, and it was one of the best I've ever tasted. The service and ambiance were great also. I will definitely visit again next time I'm in NY."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLXR6OHBRRRAB",
            "text": "Would recommend\nGreat happy hour\nExcellent bartender"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NF8tOFFnEAE",
            "text": "Okay the service here was just specular, I think because we went early but they were just generous with the wine, gave us limoncello and dessert and in general made us feel welcome and special. Great place."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNDdfNUlnEAE",
            "text": "Hoy tuve una cena estupenda junto a mi pareja y tuvimos una velada muy agradable. Quería resaltar la labor de uno de sus trabajadores, Ulises tuvo el detalle de prepararnos unos negronis realmente ricos que no pudimos sacarles defecto alguno.\nDefinitivamente recomiendo este lugar para tener citas en pareja y una velada de lujo."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncmY2Vy1RRRAB",
            "text": "Took my daughter for her 13th Birthday dinner before seeing Great Gatsby. My 13 year old discovered the restaurant on tic tic of all places. I was skeptical but it was her birthday/her choice. We definitely were not disappointed. The food was  great as well as the service! Found our new spot for dinner before the show when visiting NYC! Highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLWJhTkxREAE",
            "text": "After I had a birthday dinner a few friends of mine and I came into this place because Rudy’s was so crowded but in the End we were not disappointed. This place has a cozy atmosphere and it’s definitely suitable for a date. I ordered an Old Fashioned and it was pretty well balanced."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMTZHZEpREAE",
            "text": "Disappointed x 1000! Chicken was raw…TWICE! Had to order something different the third time. Staff and owner not even apologetic. Lights also kept flickering? So annoying. Would NOT recommend. So many better theater district food options."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbGR1WVZnEAE",
            "text": "I love it.  The food was not greasy or had overwhelming sauce. The food was excellent, and the service was outstanding. I'm definitely coming back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdmZqRUxnEAE",
            "text": "Good location for dinner before or after Broadway show!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOGVUOG1BRRAB",
            "text": "Although the hostess was very friendly, I will leave a bad review due to several issues:\n1.\tTerrible salmon: The salmon I ordered was awful. I order salmon wherever I go, and this was the worst I’ve ever had. It was almost raw, lacked good flavor, and was under-seasoned.\n2.\tUnhelpful response from staff: When we mentioned this to the person who cleared our plates (not our server), she apologized and said that if I had mentioned it earlier, they would have changed the dish, but more like a complaint.\n3.\tInappropriate response from our server: When our server brought the check and we mentioned the issue with the salmon, their response was dismissive and disrespectful, stating that it was strange because no one had ever complained before.\n4.\tPoor quality Aperol Spritz: The Aperol Spritz was terrible.\n\nThey don’t have a good chef, bartender, or team. It’s unfortunate. I will never return."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMFk3TF93RRAB",
            "text": "Una mala experiencia con la jeta del mesero que te hace un favor y el salmón crudo y aun así lo cobraron pésimo"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOXJXVHBRRRAB",
            "text": "Food was ok but website needs to be updated to show the proper menu. The website showed pizza was available for dinner in the theater district but was nowhere to be found on the actual menu and was not available when I asked."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2XzVEcHpBRRAB",
            "text": "Waited a long time for food , but the food is good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ODRicFRBEAE",
            "text": "We arrived a bit early for our reservation and were greeted by a friendly hostess who seated us promptly. Unfortunately, our pleasant experience ended there. We were passed by several servers countless times. After about ten minutes someone stopped by to offer us water having noticed we had been waiting for quite a while. He said he would let someone know to come over. We waited another fifteen minutes or so and asked the hostess if someone could come by and she went over to speak with the manager. Still no one came after another five minutes or so. As we began putting our jackets back on to leave, someone stopped by to ask if there was an issue and we explained that we were opting to go. The hostess apologized upon our departure and we thanked her for trying to help. We waited over thirty minutes to get nothing but water. One plus was that we sat there long enough to book a table at a different restaurant within walking distance and it's delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2czhMdnpnRRAB",
            "text": "The worst service I have ever had! I would give them 0 stars for service if I could. There were 3 of us and we ordered an appetizer, 2 salads and salmon. It took over an hour to get our entrees. All the other customers around us were served and finished with their meal. One person in our party was attending a 7:00 show and the other two had 8:00 show tickets. The person with 7:00 tickets had to leave because his food did not come. I asked the server for the check and 2 cups of coffee. She finally brought our food, no coffee and the check. My salmon was raw. I asked for it medium. No apologies from the manager or anyone else from the restaurant. If you are attending a show, I would NOT suggest this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bmZXMF9BRRAB",
            "text": "I was very pleasantly surprised by this restaurant on the edge of the Theater District. It had a very homey feel with efficient service and outstanding food. Service was quick even though they were hammered with the pre-theater crowd. I would highly recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2amNXLU5REAE",
            "text": "Everything was great, would recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M2NHaDVBRRAB",
            "text": "We had 3 courses plus drinks and cappuccino, but you could eat there for less than this review indicates. Best Italian meal I have ever had in a restaurant. We sat and ate for 3 hours! Split the Burrata Caprese Salad and the Roasted Fig special for appetizers. The Ratatouille with Red Shrimp special still lives in my dreams. Definitely splurge and finish with the table side Tiramisu...you will not be disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MXRlSEFnEAE",
            "text": "A bit loud but food was overall very good. Service was so/so but we were in a big group."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbl9uRFRBEAE",
            "text": "Bocca di Bacco Theatre district is my go to. Manager and staff are friendly, attentive and the food delicious. I have been to multiple Bocca but this place is in a different level. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaFBQSXd3RRAB",
            "text": "Amazing Food! We enjoyed everything we ordered! Highly recommend the calamari, shrimp, and zucchini. Gnocchi was soft and delicious. Carbonara was great. For drinks we had the tangerine and pear and it was delicious. Overall definitely a great Italian spot! Service was excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicHN1RV93RRAB",
            "text": "Came here to try the Restaurant Week menu and loved it. The service was attentive and refills on our sparkling water as always prompt. We ordered tuna tartare and scampi which were light and tasty, and the side order of grilled octopus was paired nicely with the potatoes. The atmosphere was ok with the full bar and intimate lighting but it was quite casual and nothing drew the eyes. Finally, the last course of dessert arrived and both the cheesecake and chocolate lava cake were delicious and well-made with a richness in the filling and chocolate that capped off the meal."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMF9qZjdRRRAB",
            "text": "We are here on our honeymoon and wanted to check it out, per all of the recommendations. It did not disappoint! Madison was our server and she was very helpful with decisions that left us torn, and she was super attentive without hovering. I highly recommend this place and definitely make sure to ask for Madison!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dnBDMkZnEAE",
            "text": "Nice dinner at Boacca di Bacco. The food was good but the restaurant was dark and the service was not great.\nThe truffle pizza was the best. Also, I asked in advance a special desert for my husband’s birthday but it never came and we just decided to go somewhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGVmUmNBEAE",
            "text": "Overall, this is a good Italian place with enough options for everyone. I would recommend getting the pasta, as the pizza I got had raw flour stuck to the bottom. It’s a bit pricy for the quality, but they give you large portions you can take to go. Their desserts are delicious though, highly recommend their tiramisu or chocolate cake.\n\nThere are lots of vegetarian options and a limited number of vegan selections. The dining area is long, but if you go during dinner time on the weekend it’s best to get a reservation. If you are concerned with accessibility, the front entrance is wheelchair friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOEpLbGtnRRAB",
            "text": "We wanted a great meal before seeing a Broadway show and this place definitely fit the bill! Everything was delicious from the drinks to the main dishes and the little complimentary dessert sampler our server brought out. Definitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3NYRFJ3EAE",
            "text": "Great place for an intimidate dinner. Myself and four friends met up here to catch up. Aperol Spritz was great and loved the Bocca Basil Cocktail. So refreshing! Carpaccio was delish and gnocchi was filling. Vodka pasta also very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd3ZUR2dnRRAB",
            "text": "While visiting New York City, we had an absolutely delightful dining experience at Bocca Di Bacco in Hell's Kitchen. After a nice visit to Central Park, we arrived at the perfect time on Monday, around 3pm, which was right after the lunch rush and just before the dinner rush. This timing allowed us to enjoy a relaxed and leisurely meal.\n\nThe ambiance of the restaurant was charming and welcoming, setting the tone for a wonderful dining experience. The service was impeccable, with attentive staff ensuring that we had everything we needed throughout our visit.\n\nThe menu offered a fantastic selection of Italian dishes, each bursting with flavor and expertly prepared. We particularly enjoyed the Pollo Parmigiana, which was tender and perfectly seasoned, and the Caesar Salad was fresh and crisp. The tiramisu was a standout dessert, rich and creamy with the perfect balance of coffee and sweetness. To top it all off, the strawberry gelato was a refreshing and delicious treat.\n\nOverall, Bocca Di Bacco exceeded our expectations in every aspect - from the quality of the food to the attentive service and inviting atmosphere. We highly recommend this restaurant to anyone looking for an exceptional dining experience in Hell's Kitchen.\"\n\n#BoccaDiBacco #ItalianCuisine #FiveStarDining #Hell'sKitchenEats #CentralParkVisit"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONmZPSktnEAE",
            "text": "Came here before a show a few weeks ago and the service and food were terrific! The portions are very generous so I left comfortably stuffed. We split the arancini and fried zucchini - both delicious. I got the rigatoni alla vodka and would highly recommend for a main. For dessert, we split a tiramisu (the beside presentation is a fun plus) and the lava cake! The only complaint I might have is that the lava cake was a little too well done so it didn't actually have a molten center but was tasty nevertheless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOExtZzlRRRAB",
            "text": "I love this place.  It would be a great date place or a place to bring my wife.  It definitely gives off a romantic vibe.  Service was excellent and so was the food.  I’m sorry I found this place on my last night in New York.  I wish I had found it sooner.  After a day of Italian food at the San Genaro Feast, this was probably my favorite food of the day.  The lasagna was outstanding, as was the biscotti.  They also have a great wine selection.  I highly recommend.\n\nPaul"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNXBuQUJnEAE",
            "text": "This is a beautiful elegant restaurant. I sat at the bar and had the full attention of the bartender. I ordered the homemade lasagna. It was incredible. The pasta was perfect, not too chewy, not too mushy it was absolute perfection. The meat nestled inside was so delicate and tender that it basically melted in my mouth. I had to stop myself from inhaling it and asking for more. it's a perfect portion, I was full without being stuffed. By the time I concluded my meal, the bartender was very busy. Another server came over to run my credit card which I really appreciated. It seems the staff helps each other out in a manner that is pleasant and kind and not \"you owe me\". I would really like to visit again. You can't beat the homemade pasta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NHQzNDV3RRAB",
            "text": "My first time at Bocca, certainly not last! Wonderful food, drinks, and staff! Ana (hostess) and Sammy (bartender) were amazing professionals, friendly and courteous. I can’t wait to be back to NYC and come here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteXNQYmpBRRAB",
            "text": "Great food. Ok service. We loved the lasagna and sea bass, with a side of amazing mashed potatoes. Split a yummy green salad with tomato wedges, pine nuts and goat cheese. Enjoyed with a glass of cab. Would definitely return when in the theatre district of Manhattan. If I could change anything would be to encourage a more engaged serving staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaVpxdFlBEAE",
            "text": "Its an entire vibe . The waiters were attentive, the food was absolutely delicious. Portions were great . Salmon was perfectly crispy on the outer and the inside melted in my mouth. Pesto and cacio de pepper was fragrant. Zucchini fries were crisp . Will be returning. Found parking easy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeU9iVW5RRRAB",
            "text": "Definitely must try! We went for brunch. $24 for bottomless drinks and they have a selection you can choose from. I think there was only 2 servers and they did a great job. Our mimosas stayed full the entire time! The food was delicious. New York prices so can’t complain but the service and taste was worth it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMlpQalJBEAE",
            "text": "Packed choca block before the 8pm theater openings; terrific food and great service. Our steak was cooked perfectly and truly delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcllYMGJBEAE",
            "text": "Bocca di Bacco is an Italian food themed restaurant.  They have a number of locations so be careful when making a reservation as to which location you are going.\n\nThe restaurant decor is very nice but the tables may be a little too close for some.  We went before theatre at 5 pm and the restaurant quickly filled up.  Once filled the volume of guests voices was rather loud to the point of discomfort.\n\nWe choose Caesar salad, Cacio E Pepe, and Melanzane.  The Caesar is very traditional so the dressing is extremely fishy and the serving size is minimally adequate.  The entrées were both enjoyable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3JqUEh3EAE",
            "text": "Brunch today, a very mixed experience. The service was excellent, the drinks ( bottomless bloody Marys in my case ) very good but the food very average . I had eggs Benedict , the second egg was hard and there was very little hollandaise sauce . The side potatoes were a very small portion and soggy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlamNlOWt3RRAB",
            "text": "Lovely ambiance and good food. Had a quick dinner - loved this place from the moment I entered and talked to the hostess who immediately looked after me as a tired solo dining lady. I indulged on some Carbonara pasta, which was very well executed. The atmosphere is really lovely, cute enough for me to want to return with my husband. My only minus was the bread, which was a bit stale. But overall, the visit did its job."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMy1hX1F3EAE",
            "text": "Came here after a reservation and was quickly seated. Service was quick and we were well looked after. The wife got Pasta Carbonara and I had a Locale Pizza (peps, sausage, chilli oil). Carbonara was fantastic and my wife even had to take…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwejlyU053EAE",
            "text": "We came here during restaurant week. Food was great. Really enjoyed the gamberoni and pappardelle. Service was amazing. Don’t confuse this location with the other ones on 9th Ave. This is the one that’s close to 45th St."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzczZLZmpRRRAB",
            "text": "Madison was an exceptional server! Friendly, attentive, and sweet! Food was delicious. We had the Portuguese octopus to start- highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ak02UFN3EAE",
            "text": "Great service, delicious food and nice wines! It was not too busy and staff was friendly. Great date night or casual dining!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eklybXZRRRAB",
            "text": "The food was delicious! From the antipasto to the pastas. Our server was Natalia and she was amazing. Overall a great experience!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bnBfYnFBRRAB",
            "text": "This place is awesome!!!! Great service, great food and amazing staff. First class all the way. Every item we ordered was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eTZuVl9BRRAB",
            "text": "Fantastic pre show dinner! The pear salad was very good, with a ripe, but firm pear spiralized and just enough gorganzola to give it the kick. The special housemade fettuccine with ragu was very tasty tonight!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtODhtcFhnEAE",
            "text": "This place is amazing! I was at the original some years back. This one just as special. Staff was friendly, professional, and great! Food was Oh my Goodness. My wife got the Chilean Sea Bass and loved it! I got the lasagna. First I love lasagna and this family recipe lasagna is a family I want to hang out with. So, So, good. I highly recommend! Prices are very reasonable. Great place to eat before a Show!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscTg3NUd3EAE",
            "text": "Great place! Highly recommended! Ornela is a great waitress! Me and my mom were visiting New York and will definitely come back here 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbmRpTVBREAE",
            "text": "The food is amazing and the service is excellent!!  Top notch restaurant!  You won’t be disappointed!!"
        }
    ],
    "reviews_count": 79
}