{
    "name": "Alfie's Kitchen & Craft Beer Bar",
    "place_id": "ChIJo1fD3qxZwokRtJas3NuJcFw",
    "grid": "MN4",
    "address": "800 9th Ave, New York, NY 10019, USA",
    "rating": 4.5,
    "user_ratings_total": 1463,
    "phone_number": "(212) 757-2390",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV05sVjZOMTgwWVRSblRIVXpiSGwzVlRSdlFYYxAB",
            "text": "We went to Alfie’s for their bottomless brunch ($28 per person with purchase of an entrée) and it was a good deal. We got the Croffle sandwich and burger, which were both delicious, and everyone else’s food was good too. They offer mimosas in different flavors, plus Bloody Marys and beers for variety. Definitely a fun, easygoing spot for weekend brunch. Our server (Lucy) was awesome."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eFowSmFVbVpsUkhGQlJIUjJRbWR3ZEdneE1YYxAB",
            "text": "Alfies was so good I went back twice. I was visiting the city and was on the hunt for Sat. Happy hour that wouldn't break the bank. Enter Alfies! Great little location, attentive and reasonable service and a lovely Manager! 👏🏽\n\nI had, what I can only describe, as a goblet of gin and tonic for $10! It was citrus. It was smooth. It was BIG and it was worth every penny. My friend got the margarita. Delicious all around. Did I say, $10?? Handcut fries and Soppressata Flatbread rounded our Sat. Late lunch and it was awesome!\n\nSunday afternoon brunch was no slouch either. Delicious pancakes, solid eggs, bacon. The yogurt bowl had good fruit and and granola. Cappuccino to top off!!\n\nGo to Alfies! You will not regret it!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWFUxSkdRams1VVhsbmJsWkZXamxUYUZWaFNtYxAB",
            "text": "happy hr was pretty good in the summer! I enjoyed the spritz"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelVVOUZXRmh5VFROS1drczJTVEZHTUZReVUyYxAB",
            "text": "Not impressed. This place is only average for beer, and everything else falls flat. The food and cocktails are seriously lacking—well below standard. Compounding the issue, it's also a bit pricier than the average spot in this area. The biggest problem was the service. Having to hunt down the waiter after waiting 20 minutes on several occasions made the experience frustrating."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSVUwbHJTWFF0WmtwdVQzcFNOV0pEY2t4dlFYYxAB",
            "text": "Late breakfast Lunch menu until 4:30ish. Appetizers and cold drinks were good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc1dFTnRhemRmVkhSdU4wVkllWGw0V25kME1HYxAB",
            "text": "Perfect for a draught beer and an american breakfast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZlFrVnlhVTFPV0cxTE1YbGFZVGxRVTJrd1NsRRAB",
            "text": "Food and drinks were great and service was top notch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nd1pUZGpibkZTU0d4WmJqQlRPRkpHWWtkZlRuYxAB",
            "text": "Terrible guy wearing glasses in the front, incredibly rude and disrespectful about how little we tipped, even though it was a 20 percent tip. I’ve never had the experience of being shamed for tipping too little. Very shameful and would never come back here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1YwcGxNbVZxWkU1WGJIVjVPRWxvUzFFMlltYxAB",
            "text": "Alfies is our Hells Kitchen home away from home. We have been coming here for years and the excellent service and consistently delicious food and drinks keep us coming back. We love the late night happy hours and that the kitchen stays open late so we can get dinner after a show. The servers are always very attentive about food allergies and dietary restrictions. The entire team is warm, kind, and welcoming and we love to bring our family and friends here for brunch, lunch, dinner or drinks. It’s our go-to recommendation in the neighborhood so we thought we should share here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TVFXMHdRa1JITURVMFYxOXpSRUppY25OclYxRRAB",
            "text": "the bartender was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlVYRllhblYxTTFOT1ZVcFJaa3h1WWtWZmRrRRAB",
            "text": "Nice waitress and cool outdoor sitting but the food is bland and tasteless. They don’t believe in seasoning or using salt.  Places like this are abound in nyc where they hire unskilled cooks to cut costs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TWNYTnNla3N6Y1ZNNVYzWkJTMUpUZDBWbU4zYxAB",
            "text": "Food was good but service and attitude was awful.\nBoth servers disinterested and surly.\nAlmost like rude service like it was intentional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMlgxQldaMFpJTVd0aWRYTlhXWGhDTWtwZlJsRRAB",
            "text": "I’ve been to Alfie’s for a variety of reasons and it’s always great. Staff is attentive, food is good and well priced. Can sit outside with my dog and can usually just walk in for a table with no wait. Great neighborhood spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQk9XeHlkRXREU0Rkb1VUSmFVRTU0VkZOb1IyYxAB",
            "text": "We were looking for a place to stop to eat something light and stopped here.\nQuite a good and rich brunch served in a nice restaurant with indoor/outdoor tables.\nBig sizes, more than enough for a lunch, too.\nMy yogurt with granola, fruit and honey was very good, and the eggs that my sister had were tasty, too. Service is quick."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRVlWTnJSRW8zUjFoWFRVMTBkMkowVTJoVVRGRRAB",
            "text": "Love love love alfies. Go to order is turkey burger with sweet potato fries and a delirium beer. Obsessed with this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMExWWjVSMVJxZVhGbFh6TXdlWFZzTjA5RGRXYxAB",
            "text": "No atmosphere there It was empty and no music\nThe waitress was terrible No quests service at all\nNot asking for a drinks no clear the table no friendly not interesting of us at all The worst service in NY I had\nThe food wasn’t nothing special apart from avocado on the toast . “ English” breakfast was ok\nand French toast witch ham was terrible\n20% sevice charge as well !!! For what !!???"
        },
        {
            "date": "2달 전",
            "language": "cs",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVFozcDFXVU0wZDJ4VGMzbHpiWGx6YTJ4UWVYYxAB",
            "text": "Jídlo fajn, ale 20% spropitné za donešení jídla je trochu moc."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobVYxUnhNVk5zTVdsQ01IaExWREZrWDNrNFMyYxAB",
            "text": "I was drawn in during my lunch break, by the welcoming bar. Bartender was very friendly and attentive, a sports channel was playing and the ambiance was definitely nice, would bring my family/ friends to a place like this. I got the kale salad, and I have to say this was best kale salad I’ve had all summer on NYC. Really good kale base enhanced with a vibrant and refreshing dressing. Loved the hard boiled eggs, pickled onion, hearts of palm, grilled sweet potatoes, toasted pepitas, and goat cheese. So good, I’m looking forward to coming back and trying more food on their menu! Thanks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVk0wNVBiSGxDWjB0d1dsY3hYMkZzY0dkUVJHYxAB",
            "text": "Found a piece of plastic on the schnitzel. Big apologies etc…but then they offered a cheesecake (I would have offered the schnitzel). Very disappointing the fact that I had to pay $10 more because I paid with credit card, never saw that before. Overall nice place but poor service (both waiter and manager). Ah 20% gratuity already included in the check, without even asking an opinion"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1EyRTNabk00ZEZGbmFFWkdObmszTnpJME9WRRAB",
            "text": "Brunch here never disappoints- amazing food unlimited drinks ! Must go on ur next visit-"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dWJqWXljSE5wWHkweFgwZDNVRmN0TlMxNU1VRRAB",
            "text": "A chill, cozy spot in Hells Kitchen. Went for evening drinks. Service was phenomenal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFNsbHNkMnhIVTNWU056RXdYMW93YzA1NlQzYxAB",
            "text": "Went there last night for drinks with friends and had such a great time! The star of the night was the Frozen Watermelon cocktail🍉 soooo good, super refreshing and perfectly balanced for summer. We sat outside which made the vibe even better. I also tried the affogato, and it was a nice little sweet treat to end the night. Will definitely go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS2R6QXlkMUkzVjB0S1EyMXpaSG81V0hocmJGRRAB",
            "text": "Met some cool people. The bartender Tommy is a legend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSkxYQkdlV2RZTVVSUVdta3hhM0JETkhCaFNFRRAB",
            "text": "Great neighborhood bar with great menu and tap list.  I stopped in for a late bite.  Alfie’s signature burger with truffle fries is AMAZING!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TVVXeHBUelJqYWtad05YaG9WemRTYTB4c2FrRRAB",
            "text": "Great little restaurant on HK. Good food, great service… amazing for seating out during the summer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRWJXSXpVVVZxVmtWSVgwWmpkRVpEUlZac2RHYxAB",
            "text": "Best Irish coffee I have ever had. The lady that took care of me made my coffee with this cold foam that just made the drink delicious!! Food was great and location was awesome. Strongly recommend!!!"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMVh6RXdjR3hoUzFsSFEySkZMVlJrZDJ0TFRtYxAB",
            "text": "Bella scelta di birre, lo staff  gentile. Però il cibo mediocre è il locale è rumorosissimo. Consigliato super un drink, meno se si volesse cenare."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNVZHWkhlRTU0TW1zeVltUk9aM2RVV0daV01XYxAB",
            "text": "Best fries I’ve ever had in my life, and the burger was giving luxury. The watermelon frose was the icing on the cake."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdllXRnJkVmxIV1VabVNEbEZYMnR5Y2kxd09WRRAB",
            "text": "I was here last Saturday for brunch and had a great meal. Al was a fun and attentive server, answered all of our questions about the menu, and gave great recommendations. We’ll be back!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWFVMVlOVTgwWTFsTE5GcHdORGhzTFhOellsRRAB",
            "text": "I live in the LIC area so Alfie's is my midtown go-to as a central location for meeting friends after work. The food and drinks are great but what is exceptional is the service. The manager and wait staff are so incredibly kind. Today, I was supposed to meet a former colleague to catch up and as I awaited her arrival it was uncharacteristically loud (and a bit frat bro-ish) so I had to leave and the Alfie's team generously comped my one HH drink. They are truly the best and I will of course be back for a calmer night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaWVVRjVZalI0WDNsMFVqUmFUMVIxYUZSSExWRRAB",
            "text": "All I wanted was another happy hour drink and I was late by one minute to order….they said NO!\nNo big deal, but seriously…is beer that expensive? Lol"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd2VtUlpja2czWjNaaWRHZGlWMVEwT1RkYU5IYxAB",
            "text": "I love Alfie’s. I’ve been a few times now, and have always felt so welcome. Everyone that works here is so personable and I always leave wanting to come back. Huge shoutout to Al. He remembered me after the first time I came in, and has always made it a point to say hello to me and have a conversation with me. I’ll definitely be back, especially when Al is working!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVRtZHRZVmxTYUVOTFVEQnlTSEJ4TFhCcU5tYxAB",
            "text": "William is the best, he’s so nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVlVHbzVVamRJWkcwMWJsVTJhSEJzZERRM1EyYxAB",
            "text": "I love Alfies! The drinks are great and food is so good. Al has been our waiter most of the time we’re here and he’s amazing!!! He makes the experience that much better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUU5IaENVWE5HYkRjNE4weE1MV1ZSZUhneFNIYxAB",
            "text": "The BEST service and food ever!! Al was my server and he was excellent - super quick and attentive, had us laughing all meal long!! Highly recommend!! I had the croffle sandwich and it was DELICIOUSSS 10 out of 10. The atmosphere from the second you walk in the door is so welcoming and fun, I’ll definitely be back :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNVVFVlJha1UzYWxSVVVYcDZWVzVCZEd0M1kyYxAB",
            "text": "Al was so funny, kind, and welcoming. Had no problem joking right along with us!!! Amazing waiter, sweet soul!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNGJqVjFOVTQwV0hZNVpVaEtkMFJyU0doT2JWRRAB",
            "text": "sliders and alfies amber was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblZsbHFiM3B5TnpGSGVGRjFZVUZyUm5WS2VuYxAB",
            "text": "I am a regular at Alfie's and part of the reason is due to the amazing staff. It is overall a great bar but Al, Marli, Niamh, Tommy, and William make it special every time I go. If anyone is strolling through Hell's Kitchen, I highly recommend making a stop at the best pub in town."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTE5tNUdRblYxUTBRNWFVY3pla2hEWlZSNFJIYxAB",
            "text": "Great place and vibe! Shoutout to our amazing server, Al! 🙂 thanks for the recommendations!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsamMxZE1aR2hFVm10RVozUlBTMHBrZUZWWWVuYxAB",
            "text": "What I love most about Alfie’s is it is a very versatile bar, so it’s always top of my list regardless of my purpose for grabbing a drink. It’s probably the only bar in the area with decent outside space which catches the sun until late, so perfect for people watching and relaxing after work. Inside has a great bar to sit with friends, and the restaurant is perfect for family meals.\n\nThe food is reasonably priced and of a very high standard, open from brunch through to very late (great for after the theatre).\n\nThe drinks are good, beer always fresh (not a given in NYC) and they serve a good selection of non alcoholic drinks (I have taken business meetings here for coffee in the day when the vibe is quiet and calm).\n\nBest part of it though is the very excellent and consistent service. The whole team are super friendly, attentive and helpful. I notice the staff always look familiar, which I think reflects well on the place as it shows they like working there, something that always comes through with the service you receive.\n\nThey are also family friendly so a reliable place to take kids for lunch (not sure if there is a time limit to this) so it’s a great pick when you have people visiting.\n\nTicks all the boxes for me as a really great “bar and kitchen”. Would give six stars if I could."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVWIzUjJaa1E0ZUhOWFYyUkRYMmsyU0U1M2IxRRAB",
            "text": "They close at 3 not 4"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRU5YVjJhQzEyVlhObFowSkdiSEE0U0Vkc1JtYxAB",
            "text": "This place was great.   Our server was great and the food was on point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMR203ZUdHai1iRzNRRRAB",
            "text": "Pity they’re illegally charging a 3.5% card payment surcharge - (in NYC, you can offer a discount off advertised prices or advertise both prices but this firm is adding a charge at checkout)\n\nThe buffalo chicken salad (apparently only available on weekdays and provided they don’t overcook it) is the main reason to come."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRlFYcDRlRVo2TVRrMFJXaHlabVpYV0hGWVZVRRAB",
            "text": "Great food, great brunch, great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdkQ1cXpzN1BPX0N3EAE",
            "text": "Stopped in for a drink while sightseeing. Great beer selection and had the truffle parmesan fries and ricotta toast. Wow, highly recommended,  Super friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOblY1c2FrcE1iYXN3RRAB",
            "text": "First pub I've ever been to in my life that refused to seat me at the bar because I wanted to eat in addition to drinking."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbXBuT2F6dnN1TlZREAE",
            "text": "pretty good basic american food, nice outdoor seating, great drinks, cocktails, beer, and respectful waitress"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbVYyNUhlRjl6ZUZCMlkwUmphSFJuWm1wb2JHYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nWe were visiting from Houston and decided to stop by Alfie’s — and we’re so glad we did! Everything was absolutely perfect. The atmosphere, the drinks, the food…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcVppSkRWeS1LN0VREAE",
            "text": "Typical bar food, but with a couple of twists and interesting takes. The server was really gracious and fun."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZlV3cERRbmRPVUxREAE",
            "text": "Alfies is easily my favorite bar in the area. Tommy always brings the right energy,\nfriendly, on point with drinks, and just makes the place feel easy. Great spot, great bartender, zero pretense. Five stars, no question."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV0NzZFNVelphOFZBEAE",
            "text": "Es la segunda vez que visito este lugar y la verdad su comida es deliciosa (las dos veces justo he estado en brunch), sus cocteles también soy muy buenos, la chica que nos atendió fue muy amable y las mesas en el exterior son muy cómodas perfectas para este calor! Lugar recomendado"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQa04tQjBBRRAB",
            "text": "The space is a good size and they have some outdoor seating.  It's nicely decorated.  We had the Shrimp Basket and Truffle Fries they were both good.  They have a good happy hour.  The prices on the food are reasonable.  The prices on Cocktails and some spirits are good.  It's a laid back atmosphere with a good playlist.  Btw, Stephanie, the bartender was very helpful and patient"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNTQtdUlBEAE",
            "text": "Alfie's Kitchen and Craft Beer Bar is a brunch place located in Hell's Kitchen, with a nice atmosphere and wide range of bar seating. We came in a little before noon, but the place was still decently packed, and began filling up as time went on.\n\nThe staff were very friendly, checking in on our water, allowing us to move seats if the temperature in the place was uncomfortable (since it was a cold day and they had the heaters on), as well as bringing the food out in a reasonable time.\n\nWe got the American Breakfast, Alfie's Brunch Burger, and the Hazelnut Nutella Pancakes. The Brunch Burger was juicy and tasted great, the fries were a bit too salty for our liking but the ketchup helped neutralize it. The Hazelnut Nutella pancakes were a highlight, it came with multiple different toppings like hazelnut, banana, blueberries, & more. The pancake was a decent size for the price, and was light and fluffy, going well with said toppings.\n\nOverall, a great experience for a casual brunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPdUhfWjdLM05yRFlREAE",
            "text": "Good place to hangout. Little loud to hear. Service was good. Food was decent, needed to add a lot of salt to the salmon but the rest was fine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3QzMDBRRRAB",
            "text": "The fries are out of this world!\n\nWith that said, I will say that we came here on a Tuesday night to enjoy some drinks and food and we’re completely overjoyed. The drinks are incredibly reasonable and I received the old-fashioned as well as the Jenn cocktail that were nine dollars apiece. Totally reasonable and absolutely delicious seats 10 or 14 tables, but there were a ton of families in large groups inside it was loud and lovely. Food was delivered very quickly and we loved everything.\n\nThe only small critique would be that my wife did not enjoy the sweet flavor (jam?) added to the grilled cheese, but again, the fries made up for it.\n\nLove this place! Would definitely come back highly highly recommended! Everyone on the staff was just wonderful"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfalo3dFdBEAE",
            "text": "Loved it here. Excellent service, clean bathrooms, warm, delicious food, and great quality inexpensive ale!\n\nI especially loved the Amber Ale. So light and tart-— a nice, warming drink for a cold day. 💜"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbFp1N1ZREAE",
            "text": "I got the Caesar salad with salmon and it was delicious. Salmon was crispy and perfectly cooked and the salad had the perfect amount of lemony Caesar dressing on it. I wish I tried the Parmesan truffle fries but we’ll leave them for next time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBelp5WHFRRRAB",
            "text": "Great vibes and comfy atmosphere. My friend and I sat at the bar and the sweet lady whipping up our drinks made some excellent margaritas. We ordered fries too which were really good, nice and crispy and good amount of it too. Def coming back for the drinks, maybe for brunch as well 🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINFp6SW5RRRAB",
            "text": "I came here for a quick lunch with no expectations and I was pretty happy with the overall experience. The burger was much better than I was hoping for; it was much better than a burger you typically get a bar, and the service was fantastic. My only nit pick: I wish they had more lunch menu options outside of burgers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNU0ycGp3RRAB",
            "text": "We had an amazing time dining here. The food was amazing and the drinks were delicious! I recommend the cauliflower bites and turkey burger! The chef knows what he’s doing for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWUyQ3JBRRAB",
            "text": "If you’re looking for the best-poured Guinness this side of the Atlantic, look no further than Tommy behind the bar. This man isn’t just a bartender—he’s a Guinness artist. Every pint he pulls is textbook perfection: the perfect cascade, the signature creamy head, and that smooth, velvety taste that only comes from someone who truly respects the craft.\n\nTommy doesn’t just serve drinks; he delivers an experience. Whether you’re a Guinness connoisseur or a first-timer, he makes sure every pour is up to the highest standards—no rushed jobs, no shortcuts, just pure liquid gold. And if you’re lucky, he might even share a story or two while you enjoy the best pint in town.\n\nIf Guinness had a hall of fame for bartenders, Tommy would be front and center. Cheers to the man who makes every pint a masterpiece!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbUptdnJ3RRAB",
            "text": "It was the avocado toast and craft beer options that drew me in, away from the plan I had. And I'm so glad! Everything was so delicious! Staff was super nice. Highly recommend.\nMy only criticism is ... why do the bathrooms need a gender assignment when they are one-person rooms? Come on y'all, it's 2024 yo!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocTYybXBBRRAB",
            "text": "Excellent place for happy hour drinks and food! Fun vibe in the heart of Hell’s Kitchen. Despite the fact that Our server had just started that day, she provided us excellent service and a great time! (Can’t remember her name but just moved from Chattanooga to the city! ) loved my turkey burger and the salad looked amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN2NmX2VnEAE",
            "text": "One of my favorite lunch spots in the neighborhood! I go here very frequently when working from home and want a lunch break. The staff is super friendly and great. Food is amazing especially the chicken sandwich!! Definitely recommend this spot for lunch and dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NVpXekVBEAE",
            "text": "Alfie's has an awesome brunch with a great bottomless option. It's nice that it's separated so you can go for the meal or both. The service was the best part. Our waitress was amazing. We got the best recommendations from her and it just enhanced our dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocEphMXpRRRAB",
            "text": "Decided to take my boyfriend here for a birthday brunch and it was fantastic! We sat at the bar because all of the tables were booked (I recommend making a reservation because it fills up fast!) and both ordered the bottomless boozy brunch drinks for $25 and some food. He ordered the Alfies steak and eggs and I ordered the short rib hash. Both were soooo DELICIOUS. I loved the vibe of the bar and the staff were incredibly friendly and quick to serve. We had a great time and can't wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMUxmc0xBEAE",
            "text": "I had the ($22) avocado toast for brunch, and it was excellent! There was something in the dish that made it a tiny bit sweet -- at first I had thought maybe it was the pomegranate, but after tasting the pomegranate on its own, I was fairly certain it was something else. Anyway, whatever it was, it was a surprising (to me at least 😄) nice touch to the avocado toast. The ($11) bottomless mimosa was alright (maybe a little expensive? But maybe it had to be because it was bottomless 😄), but the food was most important anyway.\n\nAtmosphere was good. This was around 11am, but it was not too crowded (maybe because it was 2 days before Christmas so many people have left town), so that was nice."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbW9pOG53RRAB",
            "text": "One of the best brunches I've been to in a while. Servings are large. Food is full of flavor and they offer a wide variety of unique dishes you would not normally expect for brunch and they do it well. Prices are reasonable and brunch comes with a complimentary drink!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NUl1MWhRRRAB",
            "text": "I managed to snag some MJ the Musical tickets and Alfie’s was the stop before show time.\n\nWe literally just stumbled in as we were walking towards the theatre. I scanned the menu quickly and noticed they had happy hour and a turkey burger and that worked perfectly for me.\n\nWe entered and were seated right away. The place was actually quite bustling for a cold NYC Wednesday night in January. With the place full it can feel tight getting through and not very comfortable while seated. Nonetheless service was attentive, when possible.\n\nI ordered an Old Fashioned and that Turkey Burger that caught my eye accompanied by sweet potato fries. My drink was ok but my food was delish and perfectly hit the spot.\n\nJust A Note:\n\nIf looking for a fairly quick bite to eat before a show, Alfie’s might be worth checking"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOThITUtnEAE",
            "text": "Found this neighborhood place for my husband  to hang out while I went to get a facial.  Great beer list, and good pub grub. Bonus points for having on horse racing on tne sports channel. Thanks  for making a great afternoon  in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYak9Ma2l3RRAB",
            "text": "Bold, detailed, Ballsy,  Scrumptious, Excellent, Excellent Brunch food.Im glad that I celebrated my Birthday here with my friends!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbk8tV2l3RRAB",
            "text": "The food was good, we tried Alfies signature burger. It was tasty but nothing wow. The server was really attentive and sweet but a bit slow. Overall it was nice."
        },
        {
            "date": "2년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dS16V3FRRRAB",
            "text": "Bar para um happy hour ou noite adentro, cervejas artesanais na temperatura ideal e atendimento rápido e gentil. Tem uma porção de tartare de atum que é divina. Vale a visita, região de bares e restaurantes tradicional em NY."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdkx6SW53RRAB",
            "text": "I came here with my family for brunch. Everything was so delicious and we will come again! Even my super picky son loves the food here. I had the Elevated Egg Sammy and it was so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bTlDdnNRRRAB",
            "text": "Stopped here for brunch on a Sunday. Service is quick and friendly. Ambiance is pretty loud but okay. The food is fine, though lacking flavor and pizzazz. Chicken and Waffles were dry; croque madame was bland. Overall, wouldn’t recommend given the other options in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyc2IybTRRRRAB",
            "text": "Great food! The Jerk Chicken and Wages for brunch was especially good. Lovely fresh granola and yoghurt too - lovely fresh fruit. Staff were friendly and helpful, even though it was a fully booked Brunch. Nice ambiance sitting out the front in the sun."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdTZmbG53RRAB",
            "text": "Trendy brunch spot spot with cozy decor. Highly recommend the country ham Benedict. The cornbread waffles are absolutely amazing. Drinks are decently priced. Would definitely revisit/recommend.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bkpiUHJnRRAB",
            "text": "While walking around on our weekend trip to New York, we stumbled upon this spot. We sat outside and opted for the bottomless brunch. We ordered the beach bomb omelette which was fluffy, light and packed with sautéed veggies. It came with a side of home fries which were little different than the regular ones but in a good way. We also ended up ordering an elevated egg Sammy. Nice creamy fluffy egg. The black garlic aoli added tones of flavor. The bun was fresh and soft. And what's a burger without fries. We ordered a side or the sweet potato fries and munched on them through the brunch. The portions were perfect and would fill you up for the rest of the afternoon.\nNow the only downside to the brunch would be the 90 min timeline for bottomless, because the servers take a good 10-15 min to refill your glass. So it questions the entire purpose. Our glass was randomly taken away by another server aswell, for which they were sorry. But I guess they were just having a busy weekend.\n\nOverall, a good place for a date or a weekend outing with friends."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OTYyTXhnRRAB",
            "text": "We found this place by accident and are very happy we did. The food is exceptional and the service is superb. Marley helped us and she was fantastic.  This is absolutely a 'must go' on a repeated basis!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeTkzWG13RRAB",
            "text": "Very fun vibe, had a reservation at 9 n showed up a tad early, was told five minutes, they cleared a table n had us seated quickly. Attentive staff, I asked our server what she'd prefer out of two items I was between n she was honest, helpful, and easy going to talk with. Food came out quickly. By far, THE BEST spin dip I've ever had. William, who I'm not sure if he was Foh manager, supervisor, host or owner, was so nice, checked on us multiple times, and even brought us a round of tequila shots after we finished our food n had paid. There was even a Bernese mountain dog outside with his owner (we were at a window seat, n william took a second to go outside n say hi to the gentleman n pet his dog.) The bartender was attentive as well, just a very well, fun, easy going time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbTZDbGZnEAE",
            "text": "Came here for brunch on a Sunday - vibes are basic but there’s a good selection of bottomless options and classic brunch food. French toast was solid, especially if you have a sweet tooth! Do note they charge you a higher fee if you use a credit card."
        }
    ],
    "reviews_count": 81
}