{
    "name": "Il Melograno",
    "place_id": "ChIJ2WjAjlBYwokR-EJZW5EpOfg",
    "grid": "MN4",
    "address": "501 W 51st St, New York, NY 10019, USA",
    "rating": 4.6,
    "user_ratings_total": 668,
    "phone_number": "(212) 757-9290",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WmFEa3lURU14WkRkSFMwUjZOMjVzTkMxc2IyYxAB",
            "text": "Grande"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWE5EWm5kRUZTU0dScVRuQjRRM0ZKUVVaSVduYxAB",
            "text": "We happened by and were not disappointed - at all!\nThe Burratta was so fresh. I had the Veal Ravioli and wanted more. My husband got the striped sea bass and said it was the freshest fish he'd ever had."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTE1uUnZMVTQxWHkxdk1uUnJNVFpzZUdGcUxXYxAB",
            "text": "Good afternoon, I am this review in hopes that it will trigger the restaurant to do a through dive into their practices. I ordered delivery from the seamless app from here on Friday evening to my job. I took the food home to eat and when I opened it, there were two small creatures on the arugula. Thank God I didn’t take a bite. Raw foods like arugula have to be throughly washed and inspected. I could have easily eaten that without looking. Had I not taken it home, I would have walked over to the restaurant but it was too late. $40 down the drain but also disgusting. Please wash and inspect the food carefully. I know this can be an isolated incident but it’s not a small matter. I took a video but I will not post it because I’m not looking to ruin a business, just spread awareness."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1JURkRVemcxUVZWMk1YQlhkRE5wU1hwRVNHYxAB",
            "text": "Perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSd1pXNUNXRWt6YVZsUlRXdFdUMnh2UzBZNVZrRRAB",
            "text": "Super good food and really good wine selection to choose from\nThis is a gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SmVXWTFSVTEzWW1wWWFrUTRkSFV3VEY4dGIwRRAB",
            "text": "The food was amazing ! The staff was really friendly ! The atmosphere was a 10/10 if you want a romantic dinner!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaVVIcHRXVFZLYTBaa2EwTmpPRWc0VjE5d2RHYxAB",
            "text": "Great food, but the service could be improved especially from the manager and the host."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTFVYbHhlVVpQYzFWS1pFOVdNMEYzWkZkTFYyYxAB",
            "text": "Authentic food. No sauce fest here. Small menu means more attention. The maccu siciliano was like my mother makes back in the homeland. Bruschetta piled with tomato not overly garlic. I left stuffed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmExb3pURlEyZFdSNU1qWkVTRFUyTkVGS1drRRAB",
            "text": "Love the risotto. The tiramisu is also amazing. Will definitely come back to try out all the desserts;)"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM1QxOHpkbkp4Ym5GTlUxQnFlbVJsVTAxUU1uYxAB",
            "text": "bella sorpresa questo piccolo ristorante in zona hell's kitchen. Il proprietario e lo chef italiani di seconda generazione sanno come cucinare italiano. ottima la pasta. buoni gli spaghetti, le fettuccine al ragù e i ravioli. anche il pesce che abbiamo ordinato (salmone) era buono e si presentava bene. buon servizio e cordialità. il prezzo è giusto.\nnon c'erano molte persone alle 8.30 quando siamo arrivati quindi abbiamo goduto anche di tranquillità. attenzione agli orari però perché la ciò a potrebbe chiudere dopo le 21."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVQwVktSRXhFVGpGU1FXTkpjMmhwVlZoTFJsRRAB",
            "text": "Everything was delicious. Not too busy for an early Friday dinner. Highly recommend the artichoke cake and the daily salad. Desserts (cestino, tiramisu) were well plated and very good. Try to get a seat by the window to enjoy the ambience of a quieter part of Hell's Kitchen. Would definitely come here again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1JIcHJVVXAzTFc5SExUZzFkVGxmU25JeU9XYxAB",
            "text": "Server was helpful in recommending our meals. Prices were reasonable. Small little restaurant sitting so you might want to get there early. Also before 6:00 they offer a 10% discount on your total bill. What's not to like."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNemFIaDVOR3BWWTBkR1MyUTBVbFphY0dRMGRGRRAB",
            "text": "Just amazing. Best Italian in a long time."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeVVFZDBSM2h5ZUVJeVFXUk1RMnQzYTBGelVWRRAB",
            "text": "Ristorante molto carino con una bella atmosfera, personale gentilissimo, ottima cucina italiana. Tutto molto buono"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFJGSlROVjlmU1UxcmVGVmpOVlZsVERZMk1FRRAB",
            "text": "So good!  Any of the homemade pastas look great. We had our machete. My pork chop was a little overcooked, but tasted great.  Nice staff, reasonably priced wine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVUxVmxZMk01UlhaUGRGWmpjRzVuWjJsVVdFRRAB",
            "text": "A truly authentic Italian NYC dining experience as the owner frequented our table to check on us and regale us with stories of his family and the rich tradition of the dishes we so thoroughly enjoyed.\nWe started with a traditional bruschetta - fresh chopped tomatoes in divine EVOO. topped with arugula on crispy bread. The Sicilian insalata was a perfect blend of Fennel, orange, arugula, olives, oregano, red pepper flakes, EVOO. The flavors blending together to make this better than any dinner salad. The penne with pomodoro sauce was a delicious choice for our entree. A flavorful tomato sauce served with al dente pasta and fresh basil.\nFor wine we chose a Pinot Grigio and a Chianti. Both excellent choices to accent our food. We ended with tiramisu -Dark espresso, mascarpone, whipped cream and lady fingers, sambuca and limoncello.\nThe ambience is set for romance with its intimate space and simple Italian inspired decor. A small restaurant with a big heart."
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUU1IUklSVzE2ZDFsSmNHSkhiRTl5VTNZMVFYYxAB",
            "text": "Sehr gute italienische Küche! Schönes und sauberes Restaurant. Sehr netter Service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc01GbHRNMjVXY1U0dGVXdDVRV2RxZEVkVk4yYxAB",
            "text": "My nonna couldn't have done it better!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNYTJrWlNoXzhqSlFREAE",
            "text": "Super! Very good food, beautiful ambiance, warm welcome, authentic European style atmosphere and presentation. Including a bit of a lip when asking for some extra bread after 9pm! Apparently, not allowed 😂. Otherwise, 💯. Enjoyed this Italian bistro after the James S hospitality industry wine event very much! Bravo 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM2JuLWlyaXFMOWRBEAE",
            "text": "I had such a delightful dinner here. Every dish we ordered was delicious, and the ingredients were fresh. I’ve eaten at so many restaurants in New York, but this little spot in Hell’s Kitchen really surprised me—it’s become one of my favorites in the city."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdWloS3lkNmRhdDlnRRAB",
            "text": "We've been a few times now and I always walk away well-fed and happy. This time they went above and beyond. Food was absolutely excellent, the drinks were impeccable (the basil margarita especially), and the service is top-notch. Easily one of my favorite places to go before a show."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kd1ZHVktiVkZuYUc1VVRtWXhiVE41UkVNMlFWRRAB",
            "text": "Food was good but portions small.   Very tight space. Helpful with scooter"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdnowT19YMVBqT3NBRRAB",
            "text": "The food was absolutely delicious! Our waiter was very attentive and the restaurant itself had just the right ambience and vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObXg4b2pKbnZmbmRnEAE",
            "text": "The service, atmosphere and food were perfect!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJaWR5dEhvcF9fb29BRRAB",
            "text": "Comida italiana bien preparada  y con porciones normales, no muy abundante.  El lugar está un poco alejado del movimiento turístico lo que facilita llegar en automóvil y aparcar casi en la misma puerta"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdTg4NmVvZ003ekZBEAE",
            "text": "Good was really good, high five to the chef!! Cute little place for authentic Italian food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYUtwZld6aHVlVHF3RRAB",
            "text": "Tucked away in the charming town of Innsbruck, this gem of an Italian restaurant absolutely blew us away. From the moment we walked in, the service was warm and welcoming, and every dish that hit our table tasted like it came straight from a kitchen in Sicily.\n\nThe pasta was fresh, the sauces were rich and balanced, and the flavors? Bellissimo. It honestly might be the best Italian meal I’ve had outside of Italy — and I’ve tried more than a few.\n\nIf you’re anywhere near Innsbruck, Austria, do yourself a favor and make a reservation. This place is unforgettable."
        },
        {
            "date": "5달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM09zNF9oMHBmS09REAE",
            "text": "Intiem zaakje waar reserveren geboden is. Er komt geweldig eten uit de keuken: de gegrilde inktvis was magisch van smaak en ook de ravioli van kalfsvlees met salie was perfect. Heerlijke wijn erbij. Topzaak!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYVYwcG5uelA2MGh3RRAB",
            "text": "Every dish and drink I’ve had has been absolutely delicious. The service is always fantastic and the atmosphere is very pleasant. My favorite dish has to be the eggplant parmigiana and my favorite drink is the Hugo spritz. I’ve eaten here many times and will continue to do so, never disappoints."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvemZqWEN3EAE",
            "text": "Merely two blocks away from the overcrowded Broadway, we were very happy with our dining experience. All food was so well and freshly prepared and tasty to the max! Great little restaurant and worth a visit for sure!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJamJUR25nRRAB",
            "text": "We ordered the pasta al pomodoro and the tagliatelle al ragù, absolutely delicious!\nReal Italian food with fresh ingredients, authentic flavors, and a warm, welcoming atmosphere. The service was excellent.\nWe'll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cnZuWHJRRRAB",
            "text": "Man this dinner was absolutely fantastic. Would HIGHLY recommend! Amazing food and service and the ambience was exactly what we were looking for. Can’t wait to come back to this lovely place 💜"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OUl2YlRnEAE",
            "text": "Fabulous food and service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWUyaTNnRRAB",
            "text": "Il Melograno offers some of the best Italian food in NYC! The ambiance is cozy and chic, perfect for a date night with its quiet and intimate atmosphere.\n\nWe started with the Carpaccio di Angus, which was fresh and delicious, topped with arugula, asparagus, and Parmigiano. For the main course, I had the Filetto di Salmone—perfectly cooked salmon with a rich butter-lemon sauce, cauliflower puree, and grilled asparagus. My boyfriend had the Pappardelle al Ragu di Salsiccia, and he was thoroughly impressed with the pasta.\n\nWe finished with a creamy dessert that was the perfect way to end the meal. The portions were generous, and the prices were more than reasonable for the quality of the food. Service was top-notch—attentive and friendly. Highly recommend, and we’ll definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRekwtWkxREAE",
            "text": "Food is average. Overcooked pasta, I wish they would make it al dente. Octopus was rubbery and pork chop was dry. Generally most dishes were under-seasoned. Wine selection is good with decent prices for the US. Service and atmosphere were good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnLThESERnEAE",
            "text": "I recently celebrated my 40th birthday at Il Melograno, and I must say, it was nothing short of spectacular! From the moment we started planning the event to the evening itself, the proprietors, Lino and Gregory, went above and beyond to ensure everything was perfect.\n\nThe ambiance of Il Melograno is both cozy and chic, providing the ideal backdrop for a memorable evening with friends. We opted for a pre-fixe menu, which was expertly curated to cater to a variety of dietary preferences, including vegetarian and pescatarian options. Each dish, from the shared appetizers to the delectable desserts, was beautifully presented and delicious.\n\nWhat truly set this experience apart was the exceptional service. Lino and Gregory’s attention to detail, accommodating nature, and warm hospitality made us feel truly special. They even surprised me with a stunning bouquet – a gesture that touched my heart deeply.\n\nFor anyone looking for a venue that offers not only exquisite Italian cuisine but also personalized and caring service, Il Melograno is the place to go. I am already looking forward to my next visit!\n\nThank you, Lino and Gregory, for making my 40th birthday an evening to remember. I cannot recommend Il Melograno highly enough!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndTh2Y1BnEAE",
            "text": "This place is perfect. Excellent staff and food. Great before a show"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMi1mM2ZBEAE",
            "text": "Had a fantastic dinner here before seeing a Broadway show. Everything was wonderful from the food to the service to the cozy atmosphere, would highly recommend it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdjlHR093EAE",
            "text": "Excellent food and service in quaint setting. Staff were all amazing and food oh so yummy. Orecchiette dish, burrata were amazing."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMXV1Qk13EAE",
            "text": "A true gem!\nDelicious fresh, clean food and authentic to southern Italy cuisine.\nThe service is s excellent and the owners satisfy any request that's asked.\nA real find!"
        },
        {
            "date": "9달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdlotR2pnRRAB",
            "text": "Une expérience parfaite du début à la fin ! Le restaurant Melograno a largement été à la hauteur de nos espérances. L’accueil chaleureux, les plats savoureux et l’ambiance conviviale ont rendu notre soirée mémorable. Tout était absolument délicieux, avec une attention particulière portée aux détails. Un endroit que je recommande vivement et où nous reviendrons sans hésiter !\nMerci encore ❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmXzhhQndBRRAB",
            "text": "We had an excellent meal with wonderful service and great wine. The food is truly amazing . Even the espresso and cannolo were delicious. I’m Sicilian 🇮🇹 so I know.\nThank you all including Jose , Philip and Leo. Grazie Mille"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2FmLTdnRRAB",
            "text": "Absolutely delicious food, every dish was incredible. Well-balanced unique flavors, beautiful presentation, good portion sizes. Many gluten free (celiac friendly!) options for appetizers, entrees, and even desserts. Make sure to talk to your waiter, besides pasta nothing is marked as gluten free on the menu but there are tons of options. Our waiter was super friendly and knowledgeable and the atmosphere was great. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cUlhX3lRRRAB",
            "text": "Il Melagrano is a short walk from our apartment. We recently made a reservation for dinner and have returned 5 times since.  We love this restaurant. The food, the service and atmosphere are all top notch. My husband and I highly recommend the salmon, swordfish, stripped bass (a special), the pork chop, the chicken Milanese, the veal ravioli - in short everything we ordered was prepared with great care for flavor and balance.  The salads, soups and appetizers are all varied enough with daily specials to choose from to make repeat visits a must.  The service is friendly and meals delivered hot from the kitchen.  We’ve noticed that several early guests chose this restaurant before going to the theatre which is a few blocks east.\n\nWe only wish we’d found il melagrano sooner.\n\nDoug and Dan   NYC"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcXFmRVZREAE",
            "text": "I used to eat here and order delivery from here all the time when I lived a block away. Such good food at reasonable prices. The rosemary potatoes were the best!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcWJxUFFBEAE",
            "text": "A great meal on a rainy Friday night! Came to dinner with my wife and son, and had a great experience all around. Great pasta, great sauce, the room had such a wonderful vibe! It was full, but everything was humming along like clockwork, one of the best NYC nights we have enjoyed in ages, thank you! Definitely coming again next time we are in the neighborhood!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOHQzbHZ3RRAB",
            "text": "Oh my god!! Amazing pastas!!!"
        },
        {
            "date": "11달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdTdUYWd3RRAB",
            "text": "Un ristorante italiano gestito con il cuore, da una famiglia moderna e calorosa. Lino e Gregory e tutta la brigata ti fanno sentire a casa: la loro pasta alla Norma mi ha portato in Sicilia. Il prezzo è giusto considerando la zona e la vicinanza con i teatri."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcjZlRnpRRRAB",
            "text": "Se cerchi un pò di italia a ny qui la troverai"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLVB5dUVBEAE",
            "text": "From the moment we stepped into Il Melograno, it was clear this wasn't just going to be a meal, it was going to be an experience. Despite being 30 minutes late to our reservation (thanks, NYC traffic!), the staff welcomed us with warm smiles and immediately put us at ease. Knowing we were trying to catch a Broadway show, they whisked us to our table and made sure our food orders were expedited.\n\nNow, let's talk about the food. The salmon was cooked to perfection - flaky and moist with a crispy skin. And the pappardelle pasta? Oh my goodness. It was a creamy, flavorful dream come true. Every bite was a delight.\n\nBut it was the little touches that truly made the night special. It was my fiancé's birthday, and the staff surprised us with a candle-lit panna cotta. They even made sure we were out the door in time for the show! Thank you to the wonderful staff for a wonderful night. We'll definitely be back."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneHRfLXB3RRAB",
            "text": "Delicious Italian restaurant\n\nFood was very good. I had three kinds of pasta and octopus. Good matching with their Italian wine. Kinds server and peacefulnatphosphere.\n\n헬스키친 라인에서 맛있는 이탈리안 음식을 즐길 수 있는 곳. 가격도 착하고 와인도 충분히 구비해 놓고 있다. 와인을 추천해 달라고 하면 친절하게 잘 설명해줌. 개인적으로는 라구 파스타가 가장 맛있었음."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNU83RVpnEAE",
            "text": "Went here with a friend who was visiting.\n\nThe quiet atmosphere was great. We split a bottle of Chianti. My friend had the Veal Ravioli, and I had the Chicken Milanese (recommended by our server). Both were great dishes. I always forget that Chicken Milanese did not come with a sauce (my own fault bc i need a little moisture with this dish) but I added a bit of the ravioli sauce and it was great!! I can't remember the name of the dessert (I should post reviews sooner) but it was fabulous, too!\n\nThe staff were awesome, and we absolutely loved this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMHVLUGJREAE",
            "text": "Wow. I stumbled upon this restaurant because of their positive reviews and it was so good!!!! We loved every dish. The dessert was really good as well. I can’t wait to come back here again. Great atmosphere. Nice place for a date night."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENllpNWtRRRAB",
            "text": "I wrote this review in Italian and Spanish because the vibe was very off at this restaurant. The food is excellent but again the vibe was off. This location is more for couples only and their regulars. Not tourists. As visitors we spent $50 USD per person.\n\nLa cena è stata eccellente, la location fenomenale, ma il servizio e l'atmosfera erano un po' fuori luogo. Questo posto è più adatto alle coppie e ai clienti abituali punto. Non è molto adatto ai turisti o alle famiglie con bambini piccoli. Sono andato con i miei ragazzi adolescenti e l'atmosfera non era buona. Tuttavia, ho visto altri clienti ricevere un ottimo servizio clienti, quindi immagino dipenda tutto dai camerieri.\n\nLa comida estuvo excelente, la ubicación fenomenal, pero el servicio y la atmósfera estuvieron algo desacertados. Este lugar es más para parejas y clientes habituales, punto. No es muy adecuado para turistas o familias con niños pequeños. Fui con mis adolescentes y la atmósfera no fue buena. Sin embargo, vi a otros clientes recibir un excelente servicio, así que supongo que todo depende de los camareros."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaW91cUJREAE",
            "text": "We had such an amazing experience last night! We showed up to our reservation very early because we were visiting from out of town and didn’t time it exactly right, but the host and staff were happy to seat us early. Our waiter was awesome…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOWZEeXBBRRAB",
            "text": "Excellent Italian food! Everything was so fresh & delicious. I highly recommend the eggplant appetizer and the bolognese. Our waiter was so nice and made excellent wine and food recommendations. Prices are very reasonable for the large portions they offer. This is one of the best Italian restaurants I've been to in the city, highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dFB6SlRREAE",
            "text": "Comme ci, comme ca.\n\nThe Maccu Siciliano was perfection. But the Pappardelle Al Ragout Di Salsiccia was way too salty, and the Ravioli Di Vitello Al Burro E Salvia tasted off, like it hadn't been seasoned properly.\n\nService was inconsistent but mostly friendly when it did appear. Meanwhile, the decor was cozy, candlelight, date night vibes.\n\nNYC is saturated with Italian restaurants. I wouldn't go out of my way to come back here, but you could also do worse on a weeknight."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoa1AzckxnEAE",
            "text": "We dined here with a group of 6.  It’s quite private in such a small restaurant tho we are quite loud.  I enjoyed all the appetizers & desserts.  My orecchiette pasta dish is a bit creamy.   It might be just me, my taste. Restaurant staff made good efforts to take care of us.   I would come back here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbDVMdzlnRRAB",
            "text": "Diamond in the neighborhood.  From being accommodated in 10 minutes during a rainy dinner rush, to quick check when asked, excellent and personable service.  Great wine selection (I’ve had stuff here I’ve never tasted before, from strong spirited wine to smooth and easy nonsweet fruity whites).\nFood is excellent, home style “grandmas recipe” not at all generic Italian I was worried it might be. From the homemade secret spice sun dried tomato complimentary bread spread, to the 4 hour cooked pork ragu, and consistently perfect pasta, it genuinely tastes like authentic Sicilian cuisine.\nAmbience is perfect too. Real plants, great decorations, jazz music, wood tables, outdoor seating…again, a diamond in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaDlMY0FnEAE",
            "text": "I recently had the pleasure of dining at Il Melograno, and it was an extraordinary experience. The food was pure and divine, a true testament to authentic Sicilian cuisine. The pasta was cooked to perfection, embodying the ideal balance of texture and flavor. Each dish was meticulously prepared and tasted as if it had been crafted with genuine love and care. The ambiance of the restaurant complemented the food beautifully, creating an unforgettable dining experience. I highly recommend Il Melograno to anyone looking to indulge in exquisite, authentic Sicilian fare."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNta0xIaXpnRRAB",
            "text": "This is some of the best ravioli I have ever had the pleasure of eating anywhere in the world. I ate outside but it was a heated patio and very warm. I got the veal filled ravioli in a brown butter and sage sauce and wow it was spectacular. It was pillowy soft in a delicious buttery sauce. Every bite was delicious heaven and it was made fresh and perfect. The wine they gave me with it was also excellent. This seems to be a family owned and run establishment (I overheard the waiter telling some patrons about how the tagliatelle recipe was one passed down from his grandmother, and that his family owns the place - I love this!)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNElpRFhBEAE",
            "text": "The food was really good, a lot of vegetarian options. Very fresh ingredients. Definitely would recommend. The Trenette Al Pesto was very tasty . The Vanilla Panna Cotta was amazing"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNHUyTExREAE",
            "text": "Update: Enjoyed our first sit down meal here since before the pandemic. Really enjoyed one of the evening special's, jumbo shrimp over risotto---anyone who has tried cooking risotto and failed will appreciate a good plate of it---and this one was great, rich, creamy and the shrimp tasted fresh. We continue to call this our favorite Italian restaurant in Hells Kitchen.\n\nMy family has been eating here since it opened in 2007 and it is our favorite Italian restaurant, despite the many choices available in Hell's Kitchen--at least before the pandemic. We have only recently been ordering takeout a couple nights a week and we have been glad to see Il Melograno has survived thus far. In fact, I was amazed at their expanded footprint outside recently when I was picking up an order. The tight confines, err intimate space, inside has long been my main complaint about the restaurant. We have tried most everything on the menu over the years, and a couple of our favorites are the mussels and the tagliatelle with sweet Italian sausage."
        },
        {
            "date": "수정일: 4년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNFl5RUh3EAE",
            "text": "全てが美味しく、スタッフはとても親切で気遣いが素晴らしかったです。値段も良心的だと感じます。イタリアのビールは$7です。\nパスタが本当に美味しかった。また行きたいです。"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOWFtNFBnEAE",
            "text": "What a great find! We were craving comforting Italian and with so many options didn't know where to land, but Il Melograno was perfect.\n\nIt's cozy (only seats about 20 inside) but separated between tables, so we felt safe.\n\nThe service was fantastic: accommodating a late addition to our party AND helping us navigate or create vegan fare.\n\nAnd the pasta was just excellent. We loved the veal ravioli in sage butter the best, but the pesto and veggie was great too. The carpaccio was a generous portion, served exactly right with just oil, cheese, and arugula.\n\nThe sun dried tomato olive oil with bread service was the secret cherry on top. A surprising delight in Hell's Kitchen, right by where we were staying ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2E2aTlRRRAB",
            "text": "Dinner was excellent.  Hands down the best homemade Italian food you can get.   Eating here feels like eating in the countryside of Italy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdXBUdmtBRRAB",
            "text": "Food was okay but service could have been warmer. The spaghetti was well cooked and delicious. The swordfish was dry and overshadowed by the sauce. Better options available."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeV9XcTRBRRAB",
            "text": "Cibo di ottima qualita', pietanze ben servite e cucinate. Locale pulito, ordinato ed accogliente. Personale cortese e gentile. Buonissimi i cannoli siciliani."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLLWJxME1nEAE",
            "text": "Everything here was just okay.\nService, food and price. Our server wasn't interested in our table at all.\nBusboys were amazing above and beyond 🌟🙏🏼…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeFl1S0J3EAE",
            "text": "We had an awesome meal at Il Melograno. The pasta and sauces were extremely fresh and delicious. The wait staff was also excellent. The fish was fresh and cooked to perfection. Pretty darn good Italian, I'll definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbV9PdkJREAE",
            "text": "Loved the Trenette Al Pasto. Very creamy and very filling. The cocktails are also delicious and strong. Shared the Parmigiana Siciliana which was also fantastic."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMTVmaG9BRRAB",
            "text": "Entrare e cenare al Melograno ti regala il piacere del BUON cibo e di parlare con persone genuine, alla mano!! Leo è un vero gentleman e lo staff in cucina fantastico! Grazie per questa deliziosa serata insieme!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNXJPUkp3EAE",
            "text": "Il Melograno was an amazing experience. My SO and I were looking for an Italian restaurant for our early Valentines dinner and this place caught our attention. For one, we noticed that the dishes on the menu didn’t seem to break the bank but the food itself all looked fantastic! We ordered the homemade gnocchi, Orecchiette Alle Cozze, and Paccheri Al Bronzo. The mussels were baked to perfection and all the pasta were Al dente! Not to mention the ambience was quaint and warm for the winter season, so we felt comfortable in our small two person table. We would without a doubt love to come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbHBDdUJREAE",
            "text": "We had an amazing Valentine’s Day dinner! The service was 10/10 — thank you, Leo, for taking such good care of us! We sat in their enclosed patio area with our small dog and they were so accommodating. The food is delicious as well! Generous portions and everything tasted so fresh and the pasta was piping hot when it came out (and cooked perfectly al dente). We had two salads to start and then the pappardelle and spaghetti as our mains. Can’t say enough good things about this place! We look forward to returning soon."
        },
        {
            "date": "3년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bm9lamlnRRAB",
            "text": "La burrata en entrée était appétissante… mais c’était plutôt de la mozzarella… et chose rare dans les restaurants newyorkais, on nous a servi du pain à tartiner avec un peu d’huile d’olive. Délicate attention.\nEnsuite les pâtes au pesto baignaient dans leur jus et j’ai trouvé que cela diluait un peu le gout. Quant aux pâtes au ragout maison (que j’avais choisi car sensées contenir du fenouil)… ben là aussi… un peu déçu car cela manquait de caractère.\nPour résumer… je n’ai pas été ébloui."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdXBMTW93RRAB",
            "text": "Such a nice family restaurant. The food was delicious, ambiance beautiful and festive for the holidays. Prices are great for the food they offer. The waiters were very accommodating and friendly as well. Will be coming back."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMk5Hb1NBEAE",
            "text": "Amazing Sicilian restaurant - reserving a table is a good idea, the place is always full without being crowded. The people are friendly and competent, the prices very much okay for the amazing quality offered. Everyone in our party was happy with their dishes all 3 times we went. We'll certainly return."
        }
    ],
    "reviews_count": 77
}