{
    "name": "Kashkaval Garden",
    "place_id": "ChIJ0xEQtFlYwokRTi07N6-ojBU",
    "grid": "MN4",
    "address": "852 9th Ave, New York, NY 10019, USA",
    "rating": 4.5,
    "user_ratings_total": 1402,
    "phone_number": "(212) 245-1758",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd1dsRnpUMlJaVUZOUmFFOW5ZMkpVYVhNNVpsRRAB",
            "text": "Such a lovely experience having dinner here. The back room was so cozy but overall the entire place is very nice and cozy. Food was delicious and the mocktails were tasty. They also have a prixe fix that looked great but didn’t have the stomach space for it. Service was awesome and everyone working there is extremely nice and on top of it. We will definitely be coming back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRmIxY3hhR1IwVUVnelpERTVNakpIV1ZSTVRXYxAB",
            "text": "⭐ 1/5 — Disappointing Experience Overall\n\nUnfortunately, my visit to Kashkaval Garden was quite underwhelming. From the moment we arrived, the host didn’t seem welcoming, which set the tone for the evening.\n\nThe Fondue for One ($24) was disappointing — it came with just some bread pieces and a small pot of cheese (maybe 4 oz at best). Definitely not filling or worth the price.\n\nThe Mezze Platter could have been nice since the dips were flavorful, but the pita was dry and not warmed, which made the whole dish fall flat.\n\nThe biggest letdown was the Lamb Kebab — fatty, overcooked, and so dry it was barely edible.\n\nWith so many dining options in the neighborhood, this experience was a complete miss.\n\nSuggestions for improvement:\n•\tA warmer, more welcoming host would make a big difference.\n•\tServe the pita warm and soft to complement the dips.\n•\tRework the kebab recipe — better quality meat and proper cooking would go a long way.\n•\tRethink the “Fondue for One” — it leaves guests hungry; maybe offer sides or larger portions.\n\nOverall, a thumbs down from me. I truly hope they make some changes, because the concept has potential, but the execution fell short."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dk9WaHZUVjg0WkVJeVlVcHhjbnBZYTNsbmVtYxAB",
            "text": "Lugar acogedor, con música ambiental relajada que te permite platicar tomando vino y comiendo tapas. Hay espacio para grupos pequeños."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSlNVY3Rja1J1U0c5b1kxUXdPRmhSYUhrd2NrRRAB",
            "text": "The staff was incredibly accommodating!! This place impresses with its look and cleanliness. This place knows how to make delicious food. The employees provide excellent service. This restaurant maintains high quality."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlpVRlNRbTV0VlVZM1VubDNjVmhGYlVRMVdFRRAB",
            "text": "Cozy and cute. Has a good vibe. Wood all around. Food is okay, service is okay. Skewers are okay. Small tables. Large groups will have to  adjust"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFVreEVhM1J6WlhKME0ycFdRVFZ3VnpCT1FVRRAB",
            "text": "Super cute vibe in there. Service was great. Fondue was great. Appetizers were great. Dessert was okay. Splurge on chocolate fondue because I am sure it is great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlNIWmxOMEZRVGxWTVRUVTNSamhGUTI1WE1sRRAB",
            "text": "The vegeterian sandwich was a total fail. The bread was extra toasted so it scratched my gums. It also tasted weird. Definitely dont order that.\nMy boyfriend got the cheeseburger which actually was a play on the cheeseburger. He said it was good.\nThe feta spinach roles were good though."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMU83djVRRRAB",
            "text": "Quiet Sunday brunch with friends and family and this place was not that busy, exactly what we wanted.\n\nWhile their cocktail and beer list was impressive, the draught beer failed to impress with a rather flat finish. Service felt slower, but that gave us the extra time to socialize!\n\nTheir soup of the day was perfect for our little one, and the tapas & meze were perfect for our table. Nothing that stood out as such, but overall pretty good taste profile.\n\nWe ordered a few things to share, including Heirloom Tomato Salad ($16), Organic Kale ($16) with King Oyster Mushroom ($10) which was pretty bland. The Shakshuka ($18) looked pretty good though and was polished by our table. The Two Skewers Plate ($24) were ordered were Chicken and Falafel - my hunt for the perfect Falafel still continues (with Naya Express as the unbeaten champion when it comes to Falafel)\n\nFantastic experience overall, and will visit again possibly for brunch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVRGaDZNbk5rYkd0UFNYcFFablJpVUZCQ1pIYxAB",
            "text": "A hidden gem just southwest of Central Park!  This cozy spot offers a warm, intimate vibe with limited seating in the back and a small bar up front. It feels more like a local market at first, with shelves of packaged goods near the entrance, but don’t let that fool you...the wine, cheese, and tapas are the real draw.\n\nWe shared a bottle of wine, a few dips (baba ganoush, tzatziki, guacamole), and small plates like curry cauliflower, eggplant tapenade, and baked elephant beans.  All flavorful and great for sharing.  The cheese sampler was tasty but on the smaller side. Perfect for a light, relaxed meal with friends.\n\nFriendly service, cozy atmosphere, and a great place to unwind with wine and bites. Would definitely return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2R6aEZlbnBPYWw5WGRHeG1XRnAzTFdSQ00zYxAB",
            "text": "The waiter we had was incredibly nice! The fondue was awesome. Looking forward to going back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T00wVmtSMUEyYTJkSU9USnhaMlJPYzE5aloyYxAB",
            "text": "We happened upon this little gem our last visit to NYC. Very cool atmosphere with an open air front. We were able to get seats at the bar as all the tables were full. It was happy hour and we started with the Four Mezze platter. We chose: babaganoush, Tzaziki, hummus and Turkish Bean Salad which came with 4 warm pitas. This turned out to be our meal as we were pleasantly full and indulged in the chocolate torte for dessert. We would love to go back next time we visit NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxck1XeFFiRUoyYXpsdGRYRkthVEkxUWtSaVVHYxAB",
            "text": "a favorite in the neighborhood, wonderful food, friendly, great space"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcGFYSlZURkpOU2tNNExWbGFjR3BKUlZjeWVsRRAB",
            "text": "All these years later (I was a regular at the back of the cheese shop, may she rest in peace) and I still find a way to come by every time I'm in NYC. The Kashkaval fondue + a split of Lambrusco is my favorite solo meal, or if I'm with others, a bunch of things to share.\n\nDavid is a delight, the music is always a vibe and the lunch deal is a steal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaU9VdzNVV05mUVc1bGRrZFBXSEZtYmxaWFEzYxAB",
            "text": "Excellent spot for a date night! The people who work there are fast and friendly, and the food options are great for sharing and are very tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORFVVSTRRUzFDV0hZMFoyUklTMUUwWjBKaFIzYxAB",
            "text": "Lovely restaurant and incredible staff! I hosted a dinner party of about 20 people and Kashkaval Garden was incredibly attentive and communicative with us. Jeremy, Hayden and Jefferson took such good care of us, and really made all the guests feel right at home. The food was delicious (and plentiful!) and the ambiance was cozy and intimate. 10/10 - will absolutely host here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT1YzbE9lbWxtV0RKbVQzZEhOMGgyY1V0d1MwRRAB",
            "text": "Pretty g but they close early"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Q2VqZGhPSFpyYlc5cllWZERRbTR0Y25oVWRuYxAB",
            "text": "The food is excellent, the ambience is lovely and each waiter I’ve interacted with is extremely kind"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NVlsUkplbEJRU2twVk5FNUZXRlIzYms5TGFYYxAB",
            "text": "Amazing food with 11/10 service. The baklava was the perfect closure to our meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bGRtczJOa05QTUVadVFsaEJaa1pRYm14Tk9YYxAB",
            "text": "My car seems to automatically turn into this parking lot. Employees are both fast and courteous. The menu balances fresh options with excellent taste. The service is considerate and the mood is relaxed. Our decision to try this place was right."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlQwVlpaa3gwYVdWV1dERnVkREZMY2tkNFZWRRAB",
            "text": "The Lavendar Lemonade was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVdqVTBYM0JYWWtOQllWVkJSMG8yVW1wVVMyYxAB",
            "text": "Fondue was delicious.\nBread wasn't enough, so we asked for some more, the second portion was stale.\nPlace is nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dWQxcFlhSGRFWmtwU1YyazNSWFp2U1VSaWNuYxAB",
            "text": "Harassment from the waiters."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMk5EUnJjMmhmT1V4M1FrRkZPV0YyWm1zemIzYxAB",
            "text": "Had an amazing time at kashkaval! My bartender B suggested the $7 glass of white wine and the toasted halloumi was delicious. Will definitely be going back soon! A special shout out to B , she was an incredible bartender…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQ2FsRnVUalV0VkhGYVJYSlVjVTgzZVZwQlIxRRAB",
            "text": "We had such a great time! The vibe is super cozy like a hidden gem where you forget you’re even in the middle of busy NYC, and the service, absolutely top-notch. Everyone was so friendly, helpful, and accommodating. Big thank you for making it such a lovely experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVk4zVTVORGd6Y210RFVrSlBVREkzYnpkQmNYYxAB",
            "text": "Food is ok. Mushroom skewer was a bit undercooked - some mushrooms were still crunchy. Mezze was ok- a little bland. Didn’t feel like great value- $50 pp plus tip, one drink each."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eWR6a3pZbmhRWkdGdFpIZElXVko2TlRkNE5rRRAB",
            "text": "Order the octopus sckewer omg the best in the earth"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vd2FEQkNVamRSVFZwRVRtWkpVbTFEZURSeGVFRRAB",
            "text": "The chicken and mushroom kebabs were ok but the dips were great! Fresh baked pita was very nice. Decent service and pleasant atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVVtUlFVblF0VVRKV1VtcEJhMmRQZW5RMmQxRRAB",
            "text": "Amazing experience for dinner tonight...Thanks to David, our server/guide! Try the prix fixe menu ...fondue or skewers, you can't go wrong ...baklava and/or dark chocolate fondue dip for dessert 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFJYWnhWbkZ6WWtsTGFucHFYMUY2VGxoV2VuYxAB",
            "text": "Kebabs were ok nothing special. Feel like caponata should come with bulgur instead of  having to pick one or the other. Walnut pepper spread was ok. Baba excellent. Pita bread was ok. Overall, overpriced for what you get. But nice atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTlZuWTBWR2xwUlVWblgySlhNMk5NTFVNMWFuYxAB",
            "text": "Such friendly service and great meze. Can’t to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tka1pHcDZNbWxEZVRCa2NUQnJkMkZ0Y2t0d1kzYxAB",
            "text": "Went there for a big celebration with twenty people. The prefix meal was delicious, everyone kept discussing how good it was even days later. The staff were incredible - Jeremy and Dave went out of their way to make the night special. Highly recommend to anyone who is looking for good food and a good atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNVVVMXVlbmhCYVdkWWVscDViVmhITFc5NmFIYxAB",
            "text": "Kashkaval is hands-down one of my favorite restaurants in Manhattan. I'm there at least once a month, and for good reason! It's a bit of a secret spot – unassuming from the outside, but absolutely enchanting once you step inside.\n\nFirst and foremost, the interior is simply gorgeous. It's authentic, cozy, and beautifully decorated with obvious care and attention to detail. I always request a table in the garden room, if available, as it adds to the magical ambiance.\n\nI've tried almost everything on the menu, and it's all fantastic. But I implore you to try the Lamb skewers and the Pita Bread with various dips – they're incredible. And the Stuffed Grape Leaves? To die for.\n\nI love their happy hour options and they also have some of the best fondue prices in NYC I've seen. I've ordered the just cheese and the truffle fondue, and both were unbelievably delicious.\n\nI absolutely adore their Chocolate Fondue dessert. My only suggestion would be to add maybe like even a small portion of fresh strawberries with it. That would be the perfect finishing touch!\n\nOverall, Kashkaval is a truly special place. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdFEyazRTRTh6ZEdGZldrMUNjM1ZDYzNsWFUyYxAB",
            "text": "Excellent food and service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR0xUaGxVSHB1TUhVME5YcGpNbEIwVUVaRmVWRRAB",
            "text": "The decoration is nice and warm."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocUxYTXliVmsyUldZelVWbGpkbXRTTTFabk1YYxAB",
            "text": "Really enjoyed our dinner here! The Prix Fixe Special for 2 is a great value and gives you a taste of everything. Loved the chocolate fondue for dessert."
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdGEyZHdNV2d3Vm1oeFVEVXhjRmxYVm1wSlozYxAB",
            "text": "Fui com meu namorado e nós simplesmente adoramos!!! Se estiver procurando um lugar mais tranquilo nessa loucura de Nova York esse é o lugar perfeito!\nIluminação baixa, ambiente intimista, atendimento espetacular!\nSem falar no fondue de queijo (comemos o clássico) e estava muuuito bom! A consistência dele não é muito densa, eu particularmente adorei!\nVem acompanhado de pãezinhos, e dá pra comer tranquilamente em duas pessoas!\nPedimos também de sobremesa o fondue de chocolate que também é muito bom! Vem cookie, mashmallow, e o chocolate não é doce, rendendo mais para o meio amargo.\n\nGostamos de tudo!!!!!! Recomendo demais!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcldVTklOV0ZTVlZCVVMwMU9UWFJzVG5oNFRVRRAB",
            "text": "The food here is so good. We had the meal deal for 2 thing and it was extremely worth it.\nSo food was a 10/10\n\nTHEN my sister had a medical emergency at the restaurant and everyone working there was extremely kind, professional, and understanding about it.\nSo service ALSO 10/10\n\n- Huge thank you to everyone working the night of 6/14/2025. We ended up going to the ER and confirmed that she’s okay. We appreciate you all!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRWFXazBZM0o1WlV0WGVGUlFiRmxWVFVsQ1NGRRAB",
            "text": "Had a great time here.  Food was insanely fresh, great atmosphere and customer service with a killer cocktail menu.  The Paper Plane was quite unique and delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU1E2SXZCMDR2TTNRRRAB",
            "text": "Incredible food and atmosphere, with a calm but elegant vibe. This place looks small and tucked away on the outside, but was very beautiful and cozy in the garden room in the back. My dad and I ate the plate of four tapas, and especially loved the beet skordalia. Four tapas along with the pea salad with an octopus skewer was plenty for the two of us. Fantastic service from Sean too!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ3FxZmlpcW9QRWFnEAE",
            "text": "Great fondue and some amazing Mediterranean food.  I had soup, fondue, and their olive tapenade.  Really good!  Was too tired and hungry to take photos, but the fondue comes out in little pots with a heat lamp so it doesn't get cold as you eat!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWFd4WjdrOGItWDhBRRAB",
            "text": "Fabulous!"
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV0VrYWVxX2JXYTFBRRAB",
            "text": "Ristorante mediterraneo con piatti sia di carne che vegetariani.\nMolto buoni gli spiedini serviti con abbondante contorno, molto buona la caponata.\nBasta il piatto da due spiedini come piatto unico.\nBuoni quelli di pollo.\nNon male il vino, ottimo come qualità del cibo nel complesso e rapporto qualità prezzo.\nPersonale gentile e disponibile!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdlo3S2lKenJyVTZnRRAB",
            "text": "Loved this place. Was looking for a casual place on a Sunday afternoon for drinks, maybe food, and the energy was so welcoming. The staff was so friendly and attentive. Nate at the bar made delicious drinks. Sean and Jeremy checked in on us constantly. Loved the happy hour deals. Absolutely coming back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWF9sdkRjMHBQS2ZREAE",
            "text": "This place is absolutely amazing. The manager invited us in while we were lost in NYC and gave us the best experience. Nate was fantastic behind the bar and Sean was so sweet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ1BnZWp3bGR6bkZnEAE",
            "text": "This is a fun and lively place, great to share plates with a group of friends or family. The staff is very friendly. Food is better than I expected ! Would recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbnoyUDdGMFlPQUNnEAE",
            "text": "Everything was great - will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUEtnNGF3X3NyRExREAE",
            "text": "A romantic little place.\nWhere everyone smiles.\nAnd the food transpots you to exotic places."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRDAxWS1sNEpISVpBEAE",
            "text": "Love this place. Go-to for grilled octopus or whenever we’re seeing a show in the area. Always a pleasant experience, charming atmosphere, and the best service. Huge portions too, haven’t been able to leave without taking home leftovers yet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSFM5WlNEcHVPd3pBRRAB",
            "text": "Amazing salad, great service (actually give great recs) and diverse seating depending on party size/vibes. 100% would return!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVzh1ci1CLVpuRXpnRRAB",
            "text": "Great food and service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdU9lbmJREAE",
            "text": "Samuel was our waiter.  He is excellent and entertaining.  I had the Fondue and the Autumn Harvest Salad.  Fondue was very good but the salad was amazing.  I larger variety of meats to go with vegetables and fruit would be amazing.  This is a place I recommend checking out.  Prices are reasonable."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIZ01lTHR3RRAB",
            "text": "Overall, my experience at this restaurant was decent. The tapas sampler platter was okay, but I would probably opt for something else next time. The atmosphere was nice and cozy, but I was a bit disappointed that we couldn't get a window seat even though the restaurant was close to closing and not very busy.\n\nI understand the need to accommodate potential rush after we sat down, but as a former server myself, I would have tried to make the customer happy if possible. Despite this small hiccup, I still had a great experience and would consider returning in the future to try out some other menu items."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeWZ2N09nEAE",
            "text": "Kashkaval Garden is a gem that transports you straight to a warm, comforting kitchen filled with the flavors of home. The food here reminds me of my grandma’s cooking—simple yet deeply flavorful, crafted with love and care. Their dishes like the savory roasted eggplant, stuffed peppers, and hearty lamb kebabs took me back to Bulgaria, evoking memories of family meals and traditional recipes passed down through generations. The kashkaval cheese, perfectly melted into dishes, was a nostalgic highlight. Each bite carried the essence of Bulgarian flavors, making me long for the cozy kitchen where my grandma used to cook. The ambiance, intimate and welcoming, complemented the experience perfectly, making Kashkaval Garden a heartwarming reminder of home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNELWQ3Y0dnEAE",
            "text": "Food absolutely delicious! Healthy and super tasty. Variety of spreads, some recipes I been brought home.\nAlso I like that you can add to your salad any protein - meat, fish, octopus.\nSo I had I believe the best octopus option in the city - salad with grilled octopus, extremely tasty and satisfying.\nCozy atmosphere for family dinner, friendly service\nHighly recommended, better to do reservations"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGNhZ2xnRRAB",
            "text": "Upon walking in, the appearance did not impress, but I stayed because the menu was appealing. The restaurant has a more appealing garden in the back. Of the three maze that I tried, humus; babaganoush; and the walnut pepper spread; I liked the babaganoush best. It was one of the best versions I have ever had. The pita bread the maze came with was delicious, served warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxODRXLWlRRRAB",
            "text": "We had a truly amazing experience here last night from every single bite of food we ate to cocktails and wine (yes, we indulged). Service was spectacular and we had the best seat in the house. We may go back again tonight! Do not miss the grape leaf wrapped salmon. Trust me! Cheese fondue was superb w veggies/fruit. Lamb kabob delicious w the yogurt sauce. Even the sides were extraordinary. Everything was spectacular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtejZhLVdBEAE",
            "text": "Amazing Middle Eastern food. Everything on the menu is excellent. A feast of flavors. Attentive staff and great service overall. Good portions and prices. Nice dining space in the back but it’s not really an outdoors space as advertised when trying to reserve a table."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdi12RWlRRRAB",
            "text": "My second time here and I really enjoyed it just like the first time I came here. Food was really good. My favorite is the octopus because it cooked to perfection. Staff was great. Came here for my birthday and we were satisfied with everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWJtUUdBEAE",
            "text": "Went to Kashkaval Garden April 27, 2024 and had a good time and enjoyed the food and atmosphere.  Overall, would rate it and the experience (4.5 out of 5).\n—————-\nCozy restaurant with a good relaxed vibe.  Ordered some tapas & meze (pick 4) got Hummus, Tzatziki, olive tapenade, and Harissa. A chicken skewer and classic fondue.\nPick 4 notes: served with warm pitas that were fresh and tasty.  Nice presentation, great for sharing.  1) Hummus was (4.8 out of 5) good, fresh, tasty, 2) Olive tapenade deep relish serving in the photo stole the show and we thought it was outstanding (5 out of 5)  3) Tzatziki (4.8 out of 5) nice consistency and tasty cucumbers were diced into small cubes which I liked and provided some extra texture and crunch 4) Harissa (2 out of 5) menu said home made and at least for my taste it was disappointing. It was served in a ramekin and was watery more like a soup, lacked taste, and had no spice or kick. If you enjoy thick, tasty, spicy Harissa steer clear of this.\nClassic Fondue was excellent (4.8 out of 5) served in cast iron - tasty and fun to share.\nSkewer (4 out of 5) chicken was seasoned well with a good savory spice combination. Ours skewer was a bit over cooked and slightly dry - but enjoyable. Rice was done well and while the vegetables were excellent.\nShared a bottle of wine over the meal and had a very good time.\nServer was very attentive and very helpful. Really enjoyed this restaurant overall and look forward to visiting it again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdGE3VTVnRRAB",
            "text": "Great Mediterranean food. The samples platter was very good and so did the kofte skewers with the bulgur side. The atmosphere is great. The only reason this place gets 4 and not 5 starts is that we had to wait more than 35 minutes to get…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaDhicUZREAE",
            "text": "Was hankering for Mediterranean food and saw this place was well rated. I can definitely see why. I ordered tapas with my choice of baba ganoush, walnut and pepper spread, beet skordalia, and stuffed grape leaves. Also order the 2 skewers special with kofta and chicken. Everything tasted spot-on authentic!. I don't have much credibility with authenticity. But really seemed authentic! lol. Everything tasted so so good. I ordered way too much food, but I got a good sampling of what they offer and the quality they're serving. The service was fast and really really friendly. Atmosphere was tight, but hip and cool inside. There was no problem getting a table for one around 8:00 p.m. on a Wednesday. Highly recommend!. Willl most certainly return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydl9MSjBBRRAB",
            "text": "Had my birthday party here. Absolutely loved this place! We were a big party on Saturday night so we preordered, the manager was so helpful, answered all kinds of questions and helped us prepare. Staffs were great! Everyone was so nice and attentive. Tasty foods! I tried kofte and octopus, both so juicy and tender! Also love the vibe there. This is definitely the place for a memorable night. 💖"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKalkyVUpREAE",
            "text": "If you're in the area, YOU SHOULD DINE HERE!\n\nI love writing great reviews, and this is a fun one.😁👍\n\n1 - The staff was excellent with compensating our party of 4 + 2 kids.\n\n2 - The food was outstanding!\n\n2a - If you're a fan of octopus, get the skewer.  I love octopus and almost order it wherever it's served, and this place, hands down, blows all the other places away with texture and taste!  The marinade was so unique, I'm begging for the secret! We also had Lamb Kofta, and those were so meaty and flavorful. layers of flavor that wouldn't stop. More, please!\n\n2b - The flatbread was almost like a healthy and tasty dessert.  I would suggest ordering extra to bring back to your room/rental for a midnight snack or breakfast. (We did!)\n\n2c - The tapas and dips were incredible. We had the hummus, which was amazing.  My favorites were the spinach and olive tapenade versions, but they were all super tasty lick the plate good.\n\n2d - The small cups in my pictures are for the fondue to dip.  In my honest opinion,  fondue is not my favorite thing, however, this was awesome! There are several flavors of dips, and all are fun to try.   If you get the fondue, be sure to ask for the dipping side.  You'll wonder why other places that serve fondue don't offer the dipping option. true story.\n\n2e - Those stuffed peppers (peppadews) were another game changer.  I beg for the recipe... please! The creaminess of the cheese offset the bite of the tangy spice that just made for amazing delicious treats.\n\n3 - In summary, we ordered a lot of food, and I can't remember everything, however, everything was well worth the price and experience.\n\nI promise, Kashkaval Garden, the next time this southern GA boy (and gal) returns to NYC, WE WILL BE BACK TO KG!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudkpHd0FnEAE",
            "text": "Good food, nice service. We stopped in for a late lunch and enjoyed a quiet visit. It was a nice break during our stay at a nearby hotel. Authentic menu options."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlblAzc2lRRRAB",
            "text": "Very tasty Mediterranean style food. The KG sampler is my fave snack. Great atmosphere. Very warm and inviting. The back room is gardenesque and I love hanging out back there and getting work done whilst dining.\nPatrick at the bar is very nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOC1Hdmd3RRAB",
            "text": "The fondue at this place is incredible! We got the Gruyère truffle fondue and loved it. The fondue comes with bread pieces for dipping. I’d recommend getting sausage or potatoes to also dip in the cheese for some variety. The Kofte (lamb) and chicken skewers were good too, especially if you like Lamb. The chocolate fondue for dessert was a sweet ending to the meal. Outside of the fondue, the Mediterranean dishes were okay, nothing incredible. Come for the fondue, friendly service, cozy/warm atmosphere, and you won’t be disappointed!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMU9LU3pRRRAB",
            "text": "Fun place to get fondue. We got classic and truffle - both good. We got veg & fruit to go with it (it comes with bread). It was plenty. Looked like lots of other good options on the menu so we hope to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdUw2YWpBRRAB",
            "text": "Every bite was tasteful and deliciously served, but falafels which taste meat (Did they call it fake meat?)\nI am a vegetarian for a reason, so I couldn’t tolerate the taste of meat.\nThe chocolate fondue as a desert, was absolutely delicious.\nIce cream-peach, was ok, not really recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbnItMGJ3EAE",
            "text": "Got the platter, hummus, labne, baba ganoush and dolma (stuffed grape leaves). Comes with 4 pitas. All 4 tasted average I would say.\nFor the main got the chicken and salmon skewers with a mix of mushroom bulgur and seasonal caponato as sides. The sides and chicken tasted okay, the salmon skewers was really nice.\nOverall a decent place but nothing out of the box, have had better for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeHVqSVlnEAE",
            "text": "Cute spot with nice fondue and Mediterranean dip options. As a vegetarian there were many items for selection. Food was served quick and the fondue was fun. We had the classic which was good - a bit sour/bitter and got roasted potatoes for…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMkwyM3NnRRAB",
            "text": "Great food and a romantic candle lit atmosphere! We shared the large tapas sampler - which is a great choice for dinner for two - babaganoush, labne, hummus, grape leaves, were some of the items we had. The labne was especially good! Pita bread was warm and fresh. Our server was excellent. They also had a small indoor bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaU82dkl3EAE",
            "text": "Intimate spot with solid service which we got to try out while on a Hell's Kitchen food walking tour. Only tried small plates, but they were tasty and my beer ice cold. Nice stop on the tour for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ04tQzBBRRAB",
            "text": "The beets were amazing. So too were the octopus skewers and the salmon wrapped in grape leaves. I didn't care much for the spinach and feta as it was too salty but the other dishes made up for it. The service was a bit slow but server was friendly and helpful. And the food was so tasty!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdjZIYmtRRRAB",
            "text": "Loved the Mediterranean cuisine at Kashkaval Garden! The food is consistently delicious, and the atmosphere is warm and inviting. The cheese fondue is a must-try. Perfect spot for a cozy dinner!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNnZQOWdnRRAB",
            "text": "Amazing!! Food was delicious and did not disappoint. We went on Sunday dinner time and were able to get a table right away. They have happy hour until 7pm ($10 cocktails, $6 beers and $8 glass of wine). We ordered halloumi for the appetizer. It came in a cute skillet. The cheese was fresh and squeeky and nicely salted. For the meal, we ordered the classic fondue and the truffle fondue. We didn’t order anything extra for dipping. Each one came with a basket of bread which filled us up and was more than enough food. The combination of the two different fondues was perfect for sharing. The classic is very cheese and has a great flavor that’s not too overpowering. The truffle was very flavorful. On its own it might get a little bit too much but combining with the classic and switching between the two was perfect. Definitely coming back next time I’m in NYC!"
        }
    ],
    "reviews_count": 75
}