{
    "name": "Row House",
    "place_id": "ChIJCWY85Rb2wokRWwG7PhPCE8U",
    "grid": "MN11",
    "address": "2128 Frederick Douglass Blvd, New York, NY 10026, USA",
    "rating": 4.2,
    "user_ratings_total": 1616,
    "phone_number": "(212) 256-0019",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbWNGRlBhbkJLVEhGSk4zbHpSMlpGUnpSM09IYxAB",
            "text": "Having them nearby is a real advantage. Simple ingredients prepared well earn my respect. The team's assistance was always timely. I tasted unknown ingredients of exceptional quality. The restaurant surprised me thoroughly."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNUxWTXhTMnhNU1U5S2VUaDBVRlZKTVRSamNHYxAB",
            "text": "Service was good. Prices are fine. Atmosphere is cool. The music was too loud when they put it on and hindered conversation, but it wasn't thumping, ear splitting loud.\n\nFOOD: Nah. Ordered the spicy chicken and waffles. Chicken was both dry and greasy. Tough combo. It also had no flavor and it wasn't spicy. Waffles had a good texture, but no flavor. If food is your focus, may be better to search for an alternative."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNE9UWm5ORFpSUVMxUFVtUllZbk5vVmtsMVpGRRAB",
            "text": "Price reasonable , good DJ"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVWEwYzRXbFpZZEU5T1dXSlZRV3RUVFVGeU5YYxAB",
            "text": "The rain and cold weather didn’t stop us. The mac and cheese here is the absolute truth and can definitely be shared or be consumed by one person 🤣. Very kid friendly and the wait staff is awesome, super kind and patient. I highly recommend coming here. Get the wings! The sauce is amazing."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRE1EQmlla0oxWldWRk0wVm5aMUk0TFU1cFJWRRAB",
            "text": "I must say this is a definite Vibe, some older than younger but once your enjoying yourself you find yourself laughing and joking and singing with the table across from you or at the Bar. I was there for a birthday brunch and it was very good,the staff is amazing and very humble and helpful, drinks are pretty good as well. The brunch was great we was in the middle and everyone who came in was so nice and smiled and said hello and welcome. The best part I must say was the DJ he killed it, remembering all the old school songs he played and loved the energy everyone tapped in. But....I did notice that the Bar get very crowded and Flirty, so if you at the bar with your partner just know someone is gonna nice compliment them and maybe even you. And it's friendly but there is Hovering around other than that it's harmless nothing wrong with saying something nice to another person just limit it. My overall experience is I will definitely come back and chill and enjoy more of the menu. My family had a blast. The bathrooms are towards the back and there are about 4 bathrooms. Great spot to hang out and chill and enjoy the vibe."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MExVYzRiV1ZPYmtKck9YaEpSa3RQVkZab2NFRRAB",
            "text": "Nice old school crowd with good music & dancing. Just a bit crowded, but tolerable for a lil bit. Drinks were ok. Didn't get to try the food, but looked good being served to others. I would definitely try."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd0xVVk9iazFRUmsxVE9WRm1TRVJwUlhjNGRXYxAB",
            "text": "This place is popping. It was our 2nd choice for brunch on a beautiful Sunday morning. To our surprise, there was no wait time to be seated, but that was negated by the long wait to get our food. Most of what we ordered was on point, like the ribs, fried chicken and  short rib sandwich. The disappointment was in how cold some of the food was. The waffles, grits (it had a hardened layer on it so you know it took a while to come out) and the French fries were too cold to eat. And the bathroom!! Never been to a sit- down, nice restaurant with such a filthy bathroom. It was worse than what you would find at a train or bus station. I mentioned to the waiter that the bathroom was filthy and disgusting, and he thanked me for bringing it to his attention. After we ate, my niece went to the bathroom, & returned saying it looked the same!! I posted my empty glass because our waiter walked by several times and not once noticed the empty glasses. We asked for water once, and then didn’t bother. 4 of 5 glasses went empty during the meal. The sad thing is that this place has great vibes, music and energy. Owners need to come around more often and improve the standards. Us customers deserve nothing less."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMllYRlBNak5aUVRaNFVGTkpUakZtVTJ0M1MxRRAB",
            "text": "I went on a Monday to celebrate my cousin's birthday. We had a party of about 18 people. I would definitely recommend making a reservation. You should definitely be on time. We were able to bring cup cakes in to the establishment, and sing Happy Birthday. There was a DJ playing music from the 80s, 90s, and 2000's. The DJ had the crowd moving. There is also a bar if you don't want to sit and dine. I think this is a great afterwork spot with good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdmQxTkxla05YY2pnMVdFSk5PV3BWUkVZd1JWRRAB",
            "text": "Great music and food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaE1qZEVRVnB5Y1hwWFJISlNWR0p3TmxWaGVHYxAB",
            "text": "The bathrooms are always disgusting.    There is no rotating staff cleaning the bathrooms.  It’s a total turn off.    Don’t stay too long.   Dinner and leave fast.  On by"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVldqaHNZazEyYTJ4Sll6TjFSakU0YzFkU2EwRRAB",
            "text": "Great ambiance, food, service, staff and live music. A true Harlem Gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OamIwWjRVRVo2ZEVkT04yVTJRbTFsWkhKSWJHYxAB",
            "text": "Great vibes, music and food were really good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jemJqZEJaMk5qVXprNVdUaGhVbXcyYUVSR09FRRAB",
            "text": "Love this space! Old Harlem vibe...comfortable clean & unique venue.\nWaitstaff attentive - food delicious - Ribs & Fried Chicken incredibly tasty - Bold dessert menue.\nSaturday Brunch - Disc Jockey: Tea Roc."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSlNGaFlkelp5TmpkTFRIZzNWa2gwVVVWTVdtYxAB",
            "text": "It was my kind of crowd, “AARP” 😂🤣 it was great fun food good service was good met good people there , So it’s safe to say I will definitely go back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVVFteHROak01YVU4emNWVlVVbGRrTnpFdGNsRRAB",
            "text": "The food is great!  The vibe is great!  The atmosphere is great!  The live band is great!   The wait staff is great!   Will visit again over and over!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGM00wRlpSamhaVkRKclltOU5XSGw0U2xaZk5WRRAB",
            "text": "I had a wonderful time. We celebrated my cousin 60th Birthday. The music was the best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NWVuRXRVRE10V21ONWVGWkJVR2xTUzNvNFdWRRAB",
            "text": "This wasn’t my first time at Row House usually, the vibe and music are spectacular. As soon as we sat down, someone came to take our orders, but unfortunately, after 15 minutes, no one had even brought us a drink. It wasn’t very busy, so I ended up canceling the order and going to Cantina’s up the block, where I was served a drink immediately and my food came out shortly after in less time than I had waited at Row House. I just expected more, especially since my visit last year was amazing, but my last two experiences have both been disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMWMyaHBka3h4ZEdscFkzZE1RMjFOYWtoRWJuYxAB",
            "text": "Always a vibe here! Did Sunday brunch with my cousin, she did the bottomless and I just ordered a couple drinks. Our server was great, warm and friendly. Food is always so good! My cousin had the lobster mac n cheese and scallops. She loved it. I had the BBQ ribs and salad. Ribs were great, highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMU5FODVWa1V3WW1KeE5FZzRNRE5MVkhKSVJFRRAB",
            "text": "Great music very friendly vibe hard working bartenders and very honest. Grat food had the mussels and chicken wings"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeWRscGxOMmhWVDFGU1lUUXlRMFZoV2pSUU9XYxAB",
            "text": "Excellent food,  great vibe and attentive owner and hosts. The waiters and waitresses need to be more attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscFlpMVpObWwzY0RWMGNGWlNYelZuZDI1VU5tYxAB",
            "text": "Friday evening at Row House was an entire vibe, we had such a good time!! The food was excellent, even the pickiest in our group raved about the food! The DJ, Ms Saigon, was on point. She had us up dancing all night! Be careful with their 2 for 1 drinks LOL😂😂😂, deciding to take Uber to and from was the best decision! Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MFJqaDJNbmhDZWxabFp6a3hhek5mWWxSRmRWRRAB",
            "text": "An amazing 4 piece ensemble played while we ate. When they took a break the R&B music was so good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQlNUbG5TM0U1WXpKaGIzZzRWSEkyUTNKUVNFRRAB",
            "text": "Too many hoodlums frequent this place. They were all outside smoking weed, cigars and cigarettes. The music [while good] was way too loud- loud enough to cause extreme discomfort. All the waiters were beyond rude, and their attitudes were Olympic level. They took a half an hour just to take our orders (because our original waiter did not want to serve us) and another 40 minutes to bring us our food. The bartender had to come and take our orders! When I gave him my order I specifically asked for well done, no salt and no cheese, due to dietary restrictions. He was very polite and didn't seem annoyed that he could barely hear me because of the volume of the music. When the Spanish food server brought over the food, I noticed that the fries were covered in salt, so I asked him which one had no salt, he looked at me as if I insulted him and said, \"No salt?\" like it was unheard of then rolled his eyes and walked away. Upon taking a bite of my burger, I noticed that they had cooked it to medium-well instead of well-done. It was still pink inside- which I had to scoop out with a knife just to eat half of it! I had about 6 of the fries the remainder of the meal went into the garbage because I would've gotten sick if I had eaten the rest.  And don't even think about asking the DJ for a request. Lol!\nIf you are looking for a nice quiet place to have good food and polite conversation, this is NOT it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeFYyZHJUM1V3ZVRGTlkzUTNkMHBFUWtNM2FGRRAB",
            "text": "“I’m here right now and honestly, I’m really dissatisfied. The service has been terrible — the waiter barely checked on us. My food came out undercooked, and when I finally got something else, it had no flavor. For a spot that’s supposed to represent Harlem, this is disappointing. The only good things so far are the music and my drink.”"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVlUSTFiV3RoYkVkak5VOWZWMkoxYUhRMmRrRRAB",
            "text": "Food was mid, music was good, drinks were great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseFZuazFZazFFU2tsT2MwZGxNRkZhZEhkUFdrRRAB",
            "text": "I’ve been here once before, but that was a while ago. This place was jumping on a Monday jam pack. The DJ was playing all the oldies. Everybody was enjoying the music drinks and food.! I plan on coming back again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWVMzbHlTazlGUkhaVlZrdEJXbGw0VDFkWVQyYxAB",
            "text": "Good time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV1owMTBNV1ExUkRZeFNWSjFiVzVNT0U5Rk0xRRAB",
            "text": "Experienced our class reunion there this weekend.  Amazing!! Rum punch and DJ...excellent!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQlJVODFNMkYzVG5ZNFpXTnRjR1V5YzJORFZIYxAB",
            "text": "I come here several times and the foods always been great. On this particular occasion though I went on a Saturday evening for dinner with my sister my son and niece. They have a dj for brunch which I knew but the dj was still there for dinner and it was extremely loud. So much so my son was complaining about it being too loud. So we had to leave. I would say good spot for a party brunch or dinner with friends but the music gets so loud you can’t really hear each other talk"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbWJqWHRBRRAB",
            "text": "The vibe & music is awesome"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelVrcG1YMHBNZGpoc1VsbExiemxJUzBWRFNFRRAB",
            "text": "If you want to  feel like you’re in a sauna. Then this is the place to go. I spoke to the owner and he got indignant with me and said he didn’t want to argue with me when I was just asking a question about the air conditioner. I wanted to know why was it so hot in here and he used the excuse because it’s a lot of people. It was no air in the front of the place. People are walking around sweating, drinking, and spending money. I will not be coming here in the summertime at all. But it’s nice and warm in the winter."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWGVrWmtjVmxvZUV4U1YwOVViRE5DVTJkb2FWRRAB",
            "text": "Great place for drinks and fun"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6ak9UbDh3RRAB",
            "text": "Rocking Harlem Old School Style.. Love everywhere on the Corner of Fredrick Douglas Blvd and 115st. Rowhouse has Dynamite food. Diverse Djays, and cant miss old school block party Vibes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoelZGRkxOazlKVlhGUE5ISkJWM1pPYjI1Tk5uYxAB",
            "text": "Great place for dancing. Grown folk hangout."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTWJYVkJZblZ3TlhWNmRGRlZOMUp3WTB0YU1YYxAB",
            "text": "Those rum punches will have you laid out. Don't drink more then 1 and a half lol. I had to take my other half to go"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeWJtUkVZbWsyZFhNNE9IRjBOWEZ1VEVKR2NFRRAB",
            "text": "The foods and drinks we're good I love  the sport side  than the restaurant"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsek1rRlNZMkZvZUZacFNsOUVOVkZKWTE5SlFuYxAB",
            "text": "It was pretty crowded when we got here (Juneteenth) and It took a while to get to the bar.  Once there, the bartender got our drinks pretty quick.  The NBA finals game was on and there was someone having a bachelorette party as well as people dancing.  Something for everyone.   The bachelorette table had a flashing light (seizure risk) on the table so I had to leave right after my drink.  I'll be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSd1RHTkRYMWQxVURONFIybEpNMmxvUjFOMFUxRRAB",
            "text": "Went for brunch party on a Sunday packed, lit, and strong drinks a bit on the pricey side but the drinks were good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcmIySllXVFpHVEVKNloxcFRNbTU1TWpCWlpVRRAB",
            "text": "I came in to have a drink and cool off after work. As soon as I sat at the bar I realized there was no ac. It was unbearable, I could barely enjoy my drink. It got to the point that I couldn’t breathe with how hot it was and had to leave. So unfortunate that they have their employees working under these conditions on one of the hottest days !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcGFqQXhRVVkyUVZCUE9YZE9XRzlyZDJwMVRIYxAB",
            "text": "Worst place I’ve ever been in Manhattan"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eE9WaGhSRFZSU0VJelZUTlRPVk5XWW01b2VFRRAB",
            "text": "Very Lively and Sexy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Nk4wZzNOM0V4V1ZwaFZHTlNiV1EyVUhWcE0wRRAB",
            "text": "Love it. Every time I’m in Harlem I make a visit. Great vibes, reasonable prices for drinks and food."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNZlgtNUhidTlqZUNnEAE",
            "text": "Loved brunching with my daughters. Nice trendy restaurant upbeat youthful friendly hosts and wait staff.  Food didn't take long at all and all was brought out at the same time which is a plus. Attentive wait staff ensuring we was good.  It wasn't too crowded at the time but as we were leaving it was getting busy and the DJ was setting up. Sharables were delicious French toast and eggs amazing, my daughter enjoyed the steak and eggs meal and my other daughter enjoyed the wings. We were stuffed and satisfied.  Reasonable prices nice menu and drinks. Definitely visit again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV04wOVBiRlZ0WkV0MlQwNTZXR2RYWWtGMFlXYxAB",
            "text": "I went to the Row house on a Sunday. There was no waiting for a table but reservations are recommended. The atmosphere was great and the place was beautiful. The music was very nice with a jazz band playing. The service was very friendly. The shrimp and grits were good but you do need to add salt and pepper. The lobster empanadas were good. The drinks were good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNdk4zdGZZMDdXcHFBRRAB",
            "text": "We went to Row House Pre-Mother's Day Dinner. Oh, we had a great time. In the beginning, we were having seating issues. We wind up staying in our original seating. The music was good, the food good atmosphere was great because we were together just us mother's."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdnVsZWJhMEtHdUxBEAE",
            "text": "My Sister n I went for my Birthday after work on Thursday.Reservations are recommended to get a table . The food n wine was extremely good. The DJ kept the crowd dancing n partying. The customer service and the hostess were extremely professional. The lounge was very nice n there bathroom was extremely clean. I had a wonderful n exciting birthday. I  will definitely be back for Brunch on a Saturday or Sunday. Happy customer. 😊🍷🎉🎊"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX29UUS1BRRAB",
            "text": "This place was very nice. The live jazz band gave such a relaxed vibe and ambience. I had the shrimp and grits with a side of eggs. It was good but the flavor was lacking a little. Could only add some salt and pepper. I also think 3 shrimps is kind of light in portion. I had a sparkling rose which was nice fresh and bubbly. The bartender,Tiara, was everything. She was beautiful inside as she was outside. She had a great vibe and energy and seemed to connect with the patrons. Will definitely come back for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybjdqcTVRRRAB",
            "text": "Loved this place.  We ended up there after attending Uptown Bounce.  The atmosphere was chill and it's a beautiful space.  The drinks are good.  I had the Potato Bites and they were 😋.  Sometimes the wait on the drinks was a little long even though it wasn't crowded but other than that the waiter was pleasant and patient with taking all our orders.  I would love to return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOXJTTFhBEAE",
            "text": "Wife and I went to a brunch on Sunday of the holiday weekend. Atmosphere was extremely vibrant and patrons were well dressed. The hostess, Tiara, was extremely graceful and welcoming towards us. She managed to secure us a table in a timely manner that was also in a very nice location. Our waiter, Omar, was very receptive and provided some nice suggestions. The food came out really fast and at the right temperature. One item that I needed to replace was done so immediately. Overall, the plates were quite tasty and at a reasonable price point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNUk3b1RBEAE",
            "text": "From the moment we arrived, we were seated at the exact time of our reservation although it was very busy. The service was amazing and the waiters and servers were attentive and apologized for the wait. Remi took over our table and I can say we were satisfied with his service. He had two big parties and still made it his business to inquire about our needs. When ordering brunch, you get a complimentary drink. This restaurant was definitely worth the time and coins! Live musical band and the space is on the tight side but overall great experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLM1BDWE9nEAE",
            "text": "A great place to meet up with friends and have brunch. They have live music which was very nice but it was a bit too close to the tables so we almost couldn’t speak with each other without yelling.\n\nThe staff was very nice but there seemed to be too few people so we waited a long time to have our orders taken and for it to arrive.\n\nWhen our food arrived, it was pretty good and we enjoyed it. Except for one friend who ordered the fancy Mac and cheese, and expected to find lobster but there wasn’t any other than flakes.  She did dump the entire dish on a plate to confirm and yup, we all saw barely any lobster. A change from how they did it before.\n\nShe did bring it to their attention and they did try to help but all they said was that was the way the dish came. We waited to get her dish back but it took so long and she decided not have anything and we left after paying.\n\nAside from my friend’s fancy Mac and cheese, we all did enjoy our food and it was a nice time.\n\nMy food was the steak and eggs which was really good. Especially, the sweet potatoes with bell peppers. I did enjoy that dish and might return to have it again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNDl5NlZnEAE",
            "text": "The food was good, the music was great and the vibe was awesome. Had a really good time celebrating my Born Day brunch with four of my high school friends of 42 years of friendship and love. 😚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeEkzYUpnEAE",
            "text": "We came here for birthday brunch to celebrate my nieces 20th birthday. This gone here is electric.  The music, the energy, the decor, the ha Band!!  Great stop to just chill and have fun.\n\nFood is tasty- fusion between soul with a splash of healthy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdGZmd0pBEAE",
            "text": "Row house is a Black owned fun and upbeat restaurant in Harlem. We went for dinner to celebrate my best friend’s birthday and we were thoroughly surprised by the atmosphere. Our table was right across from the DJ booth so we were right in the action of everything. The music was rolling all night and the people were up dancing. The food on the other hand was nothing to call home about. I ordered the trout entree the fish lacked flavor and the capers did not save it. Also, there were a lot of bones in the fish making it hard for me to enjoy. For my sides I got four thick potato wedges and a spoonful of spinach. All were not good. Our server was ok he barely checked in on us but gave us a complimentary glass of champagne which we appreciated. The atmosphere makes me want to come back but the food does not."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OVpIbUJBEAE",
            "text": "If you want great food and a great time Row House is the place you need to be. The staff makes me feel welcome at all times. My favorite is the Truffle Grilled Cheese with Bacon and Fries. The wings are great along with everything else on the menu. I advise you stop on by and enjoy the great food and vibes you won’t be disappointed .⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOXJTLVZnEAE",
            "text": "This place has become my go to local spot. Can’t beat the happy hour prices and vibes. The white sangria is delicious. Jerk shrimp tacos are a stand out as well as the lobster Mac and cheese. Lobster empanadas were good and the crab cake was delicious. Service is usually good. Especially if you get shorty with the short hair as your waitress. She’s on it!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNXNtSnNnRRAB",
            "text": "I had the pleasure of dining at Row House in Harlem, New York. The atmosphere was cozy and inviting, and the staff was friendly and attentive. The food was delicious and the portions were generous. I had the Truffled Grilled Cheese, which was cooked to perfection and had just the right amount of spice. The sides were also delicious. The prices were reasonable, and the overall experience was great. I would definitely recommend Row House to anyone looking for a great meal and amazing music in Harlem. Everything was exceptional and a great brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbU5xLWtRRRAB",
            "text": "This place on a Saturday is amazing, the people the DJ and music, the staff and the FOOD were all on point. The wings, ribs were out of this world and deviled eggs they take seriously. Everyone there were just having a good time enjoying the drinks and food. I can’t wait to back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNDU2bV93RRAB",
            "text": "The music, food, and service are definitely up to par. They're very accommodating to out last minute party of 7 that literally just walked in. The Dj was amazing taking us through the generations of hits through all genres. You can't help to get up and dance. The food was great and had something for everyone. The service is fantastic, they take good care of you, especially if you have bottle service. This is a wonderful place to celebrate, eat, and have fun with friends and family of all ages."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbXVqMUdREAE",
            "text": "I had a wonderful time for Sunday brunch.  The mimosas were on point, with many flavors to choose from. My steak and eggs were cooked perfectly, and the live music pulled it all together. This was definitely a good time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bW91SUpnEAE",
            "text": "I went to Row House for a birthday brunch.  The food was good, the atmosphere and music were a vibe, and the service was awesome!  Our waitress Awa was amazing, patience, friendly, and kind.  Dame who assisted my party was also very nice.  I would go back to Row House for a good time and good food."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNmJlcGpnRRAB",
            "text": "Great spot for bottomless brunch. You literally get the best bang for your buck here. Unlimited pitchers to yourself for a whole hour and half. The Mimosas and Bellinis are definitely made champagne heavy, with just a hint of juice. The…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdDQySm1RRRAB",
            "text": "Today is my first time at this restaurant.  The live band set a tone of joyous relaxation. I ordered the okra, Mac and cheese, shrimp and grits, and veggie omelette.   The shrimp and grits, omelette, and service were awesome.\nSee the pictures attached.  Hope this helps"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MUwzN3VRRRAB",
            "text": "We had such a awesome time celebrating  my coworker retirement party there yesterday. However, the  female manager never asked if everything was ok. If we was alright at our table. We spent a lot of money there and professional courtesy should be at a all time level with everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bl8tNkhREAE",
            "text": "Celebrated my friends bday and had a blast!!! Music was great food was great atmosphere was right up my alley!! I'll definitely be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNTZYYTVnRRAB",
            "text": "The food was amazing and so was the vibe. Remi was our waiter and he was great and patient. Thanks Remi from your new TN friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbjhEcFBnEAE",
            "text": "Atmosphere...super fun...deejays...so dope...perfect blend of hip hop and r&b real turntable mixing...with serious music affectionados . I had a great time hanging in a party of 14 of my Sorority sisters.\n\nAs for the food...meh. really meh. In other words it wasn't terrible, but it wasn't anything at all to write home about.  I asked others about their dishes and I took a good look at their dishes.  Their comments: The fried chicken...over cooked,  the Shrimp and grits underwhelming (please remove the tail shell when serving with grits) the burger was okay...the wings looked dry, but had good flavor...the sangria was a hit.\n\nI ordered 2 dishes...the Kale and Quinoa salad and the Crab Cakes Benedict which I did not know came with potatoes (a disappointment) and a small spinach salad, lightly dressed.\n\nDish 1. Kale and Quinoa...best dish. It was light yet filling. I would have liked larger beets, but overall the flavor profile was really a nice balance of acid and sweet with a nice crunch. *read the menu*\n\nDish 2. The Crab Cakes Benedict.  The poached egg was perfectly cooked.  The Crab cake was a miss for me. I tasted mostly filling...not much Crab at all. The missing mesculin greens from that dish removed the expected brightness from eating a rich yolkey dish. The English muffin did not play a strong support role at all.\n\nWould I go back? Absolutely! Did I mention the deejays are fire? I just think when it's busy (and it really was).There just has to be greater care given to the preparation for every dish served. HARLEM is full of foodies."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LXZtUkhREAE",
            "text": "Charming cornerstone establishment:\n\nWe were in a mood for small bite to eat with drinks.\nThis establishment came on our radar since they closed later in the evening. We arrived around 8-8:30pm.\n\nThe hostess was super attentive. We were seated outside. I believe we had two servers who were extremely attentive too.\n\nThe Mac and cheese was good.\n\nTheir drinks are super strong which is great.\n\nThe bathrooms are clean and pleasant.\n\nThe ice cream wasn’t great.\n\nThis establishment gets 4 stars because of their food quality, hospitality and attentiveness from the servers. I will go back and try their other menu items."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCak8tMk5REAE",
            "text": "The definition of meh. Service was awful. I think our waitress came to our table twice? Once to take our order, once to drop off food. We had to walk around to try to find her so we could pay our tab and leave. The restaurant is extremely loud as everyone else mentioned which is fine but don’t come expecting to be able to talk. The food is fine. Easily something you could make yourself, cheaper. Definitely won’t be coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKazVXYmFnEAE",
            "text": "I wish I had the ability to give them a ZERO Where do I begin? It was HOT, HOT, HOT we are in the month of July and there was no air conditioner in the establishment. The atmosphere is cozy the service was great however there's no air conditioning. Staff claim it was on and it  makes the room comfortable but there was no comfortability in there. we were sitting inside fanning. we even asked the manager she said nothing. even the serviceer were fannng themselves.  This is a no go for me. As a Harlem Navie I love good eats  it was raining outside I thought  it will be cooler to sit inside due to the rain but they fooled me. Overall the food and drinks were amazing. I had the southern peach drink and a turkey burger. I was getting overheated  I have asthma.  I decided  to leave and take the remaining of my food to go.  I needed to go home & relax under cool air and enjoy the food. I would return if it's cooler or even if they have a fan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX2JMbEFnEAE",
            "text": "Wanted to try this restaurant because it was recommended. With the exception of the Waiter, the Host/Hostess could do with some customer service and people greeting skills. They weren't rude, they forgot to make the customer feel welcomed and appreciated upon leaving. Music selections were good, just too loud to have a conversation or communicate with the Waiter. I had the Truffle Fries and could have just been called Fries. Truffles are a specialty and this was not. Just thought I'd be honest and hope that the restaurant is successful."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeE1Qenp3RRAB",
            "text": "One of the best restaurants in the city.  Has a black owner who understands Harlem with live jazz bands  and great atmosphere from the paintings to the lighting in each section of the restaurant.  The food is excellent and the waiter's are…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzc3BUVC13RRAB",
            "text": "The steak and eggs were delicious. If you like spicy food then get the shrimp and grits. You can also get it without the sauce, which is what makes it spicy. If I would have known that prior to ordering I would have opted for the sauce on…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheUl6dWRnEAE",
            "text": "Truly a great spot!! Hits all the boxes, fantastic service, delicious and fresh food spacious ambiance and local!...We enjoyed the crab cakes and scallops so much, we ordered them twice. Portions are perfect for sharing ( even appetizers) and food is made to order!! Cant reccomend enough....come eat & enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLTdTd0d3EAE",
            "text": "My bf and I went here for Vday. Good vibes. More lowkey than expected but it was the day after a snowstorm and on a Wednesday.  He ordered the salmon with risotto.  He calls a hit. I had the Quinoa bowl with chicken which was flavorful. I heard brunch on the weekends is lit... dj, dancing.  I would come back for that experience."
        }
    ],
    "reviews_count": 75
}