{
    "name": "Alison",
    "place_id": "ChIJ05f_AZ_3wokRYDq3ytLPLew",
    "grid": "MN11",
    "address": "1651 Lexington Ave, New York, NY 10029, USA",
    "rating": 4.5,
    "user_ratings_total": 520,
    "phone_number": "(646) 876-1054",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abk0yMWpRbUpMTlRsRmIyRjBia2xEU21GWWMwRRAB",
            "text": "What an interesting place! Here, you will find really friendly service and always interesting scenery. Location is perfect and the atmosphere is old school with some modern flare. The food won’t change your life, but the staff and always on bartender will make this restaurant a trip worthwhile. Don’t hesitate to stop by!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMkxYZG1jVE5DTjNCWFowOWhWbXRvTnpGelVYYxAB",
            "text": "This place was very underwhelming. Sad poached eggs for the eggs Benedict. Eggs are not even runny… ITS BOILED! Should not even be called a eggs Benedict in the first place. Doesn’t even look appetizing overall.\nCoffee is small and not a regular mug (I get it that you’re trying to be fancy but if you’re serving coffee at the very least serve a good amount for a Cofee lover that is in need for a good coffee for the day).\nThe arugula salad was an insult and had no vibrancy. At least put some tomatoes or replace it with a potato hash to go with the eggs Benedict.\nIt barely had any dressing and I’m just eating grass.\nI love salads but this was not it for the eggs Benedict dish. I’ve seen better and this place can do better. Especially with the service that is SLOW.\nPlease do better… also not coming here again due to the huge disappointment that this place gave me.\nAlso, don’t get me started when the lady wanted to charge us extra for the bread when there was a lot of the tomato sauce into the dish that my sister and cousin ordered. Sooooo you guys expected us not to slurp up the rest of the dish and just leave it there???? But the lady went and was like, “oh the kitchen is pissing me off so I won’t charge you the bread”. WOW, thanks! (Sarcasm). If it wasn’t for the kitchen pissing you off then I wonder if you’d really charge us then for a piece of bread…\nI should’ve went to Jeffys restaurant up from the block."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQk1qTkpTV0ZOTjNnelYwcEJSbnA2TmpNeGJrRRAB",
            "text": "The best bar. Great wine, super friendly staff, great spot for a date too and happy hour. Will be back soon for more"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbVJHbDJXa3RsT1VGNFJWUnlWM1ZxVFZSRFVYYxAB",
            "text": "Sooooo fire. We got the chilaquiles and then also the shakshuka with chorizo. Incredible. The music they were playing was really fun and interesting, the service was quick and cool. The food was delicious and filling. Totally a hit"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOemFHTnRVWEpTYzFOMWQwcFZWSHByWlVwSVdXYxAB",
            "text": "Delicious dishes"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFJsVm9ZWGswYTNSVk1ESlpNaTFHVjFScExVRRAB",
            "text": "Tried to take my self out for lunch here today.\nAsked for an omelette (offered for a separate dish) instead of the fried eggs on the rancheros. No one else (literally, zero customers) was in the restaurant, but the kitchen refused. Had ordered an appetizer as well, and offered to pay extra as needed for the modification. Whatever."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablUwbDBRMmN3U1VoVVQwWjFTMWh2YzAxdVNGRRAB",
            "text": "I’m coming back! It’s such a welcoming restaurant, love the decor, very well lit. What really got me was the hospitality, how they checked up on you, gave you an estimate time of your food. And then when the food came….it was delicious and fresh ingredients.\nMy friend had the salmon over coconut rice, which I didn’t take a picture of, so flavorful. The salmon was cooked perfectly and the skin,oh my goodness I was in heaven. Definitely coming back to the Harlem location….thank you two gentlemen, that ran the restaurant on point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNE5WTnVUazlEUlhBek5YSlVjSE5sY0U4MmMwRRAB",
            "text": "Great food and friendly service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWGNFbEVjWEJtVmxCUVNFVm9TV1F4U0VsR1QwRRAB",
            "text": "Great food, great service, great vibes, really welcoming. Relaxed and memorable :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbVMxWmlNR0p5YUZBd2JWQnlPSHAyYmpoUmNHYxAB",
            "text": "Didn't expect it but really great experience. Really friendly people,  awesome happy hour,  oysters!!! Tacos,  and sliders.\n\nHad a couple tacos and sliders, the sangria was fire,  and the approximate gallon of water i drank was nice and cold and kept coming.\n\nGreat service,  awesome food , super happy i stumbled on it while upper east side exploring."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNE5uWTNlREptYzNwU1dtbGZjWEZCYnpKb1YyYxAB",
            "text": "Alison is a great neighborhood joint. The food was perfect. We recommend the lamb chops and the roasted Alaskan salmon. Our server, Kayla, and the whole front-of-the-house team were hospitable, friendly, and eager to give us a good night out. We will return again and again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVVoyOVRPSFIxY25oRGNYbElkRTB6UTJSMFMyYxAB",
            "text": "We had a wonderful brunch today at Allison. Service was exceptional. Food was delicious. we were outside and the community was fabulous. Can’t say enough about this restaurant. We’ll be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUGNFaEdlbEF5VmxSTVpFZFdXa010Y3paR1ZGRRAB",
            "text": "Alison is an absolute GEM! The ambiance, the people and music selection had me going from the start. Being a new customer there the bartender offered me a free drink and the food to follow was outstanding. My server Marc, must have had experience in the Hamptons because his service and attention to detail when it came to the menu and drinks were phenomenal and unmatched to any place in New York State that I’ve been to. He approached the table with a jovial spirit and an eagerness to impress. I will definitely be visiting again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdk0zUmtkRTFzTFZoa1dVUnNUR05FVm1GTWRYYxAB",
            "text": "I came across this place in Spanish Harlem u won’t be disappointed great eats great vibe my waiter Marc was amazing 10/10  best chicken sandwiches hands down and can’t ever go wrong with rhe fried calamari ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFdYTkpNWFl5UlRGU2FrUTVaakJSTm1aV00wRRAB",
            "text": "My lunch was delicious. I had a French omelette and drank a rose spritzer. A bit pricey but I like Everything about this restaurant. Friendly and professional staff. Good music. Not too loud. Happy hour starts early. Good variety of food. Nice size restroom and clean."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV01VSnlaa2RZTXpjd1ZFOWxXbkpMYzFoa1UwRRAB",
            "text": "Stumbled upon this hidden gem after a party at the museum nearby. This place was perfect, the food was delicious, our server Joel was amazing. Thank you for a great experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYVVrOXdZbTlXVlRSUlNsQk5hMWQyVkZaS1ZXYxAB",
            "text": "Needed to grab a bite and thought about a good place to eat at East 104 St. As I walked in Marc , server very attentive took care of me. I ordered the lunch Special Grilled Chicken sandwich with Mixed greens. Unfortunately, I couldn’t eat the salad the greens were wilted. Informed the server he took the plate to the kitchen. Server very respectful said he was sorry but it’s not his fault of course. I would suggest that the person in charge of the kitchen double checks on the products they will be using for the day. This is very disappointing when you are paying $28.00. I want to keep being a local to be a supportive neighbor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVduZFFVbXBJTW5SaU5HMTBOM1oyTkhWU05WRRAB",
            "text": "As for the kitchen, this is the main advantage! The dishes were served beautifully, everything was fresh and very tasty. I especially liked the steak - just divine! The menu is varied, everyone will find something to taste"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaE5UQkZNbWcyTm1jMFRtWklWV1JZU1VzMFVXYxAB",
            "text": "Really nice place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toblZYUlZRVU0xWkRCM1ZFWmhkWFoxWm5kMmMwRRAB",
            "text": "Really nice place , excellent food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdVEycHhRbFJYYjNSbFZuSnBOSGxNYUU1dE0zYxAB",
            "text": "Although usually hospitable, this visit was disappointing. I stood waiting for a while to be seated and was told to sit anywhere, but when I chose a table, I was told I couldn’t sit there because it was for larger parties. The only available two-person seat was occupied by other people’s bags. I moved to the bar, but the person who arrived after me was greeted and acknowledged before I was. Odd experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeVVYaFdYek50U25OUlNVbFpOWE5IT0daNExWRRAB",
            "text": "Every time I go into this restaurant I get looked at as if my money don't work, The waiters are not welcoming they look miserable to be at work.\n\nThe icing on the cake for me was that I went for dessert, paid the bill , got my change back, gave a tip... Came back 2 days after to order more food and was told that I didn't pay the bill for the dessert.\n\nThey lost me with that bs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdmEyRjVVQzFJTFRWWlYzRjNNMnRqYlZCM1JYYxAB",
            "text": "The food did not work out for me. Dessert was good. The credit card surcharge was an unpleasant surprise."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYWIySTNabUpUTW5CeVpqbHVRbll0YlZOcldrRRAB",
            "text": "I popped into Alison for a quick bite to eat and drink to cool down and hold me over until dinner. The happy hour menu provided good options and I ordered the shrimp tacos and a glass of wine, both $9 each. It was busy when I arrived around 3pm but there was available bar seating and a few empty tables so I was seated right away. I wish I caught the (2) servers names at the time, but they were both so accommodating and kind even though the restaurant was becoming busier. It can definitely get loud inside, with more groups arriving for happy hour, but after I paid the bill one of the servers returned to offer me a generous second glass of wine. I truly appreciated the gesture and hope they know how it was the kind and thoughtful service that made a nice experience at Alison!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wamRtTTVlbkZVZFZWVFRURnZVMFJZYUV4RVVuYxAB",
            "text": "Always our favorite. They accommodated our party even though it was a little larger than my original reservation. Love the atmosphere and everything on the menu is always so delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMGJHeE5TWGRKTlRacWRrOU1iM1Z3ZVVGbVRuYxAB",
            "text": "Alison is always a great spot for a delicious bite. Service is always exceptional and I have not had one dish I didn’t love."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eU9XbzBNRmt3VWxsb2MySnlkRlZ5VjIxUFNIYxAB",
            "text": "LOUD. Loud music inside. Door open for loud music from the school yard across the street.  Cacophony of mixed loud music while you eat."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WGMybFVWWEZaVTBOTVJFeFpVbWcwYzE5elJHYxAB",
            "text": "Fast, reliable, and exactly what I needed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMZVVxcjJOa09lQmF3EAE",
            "text": "Had an early dinner here. A decent happy hour. Loved the Mediterranean salad. The buffalo shrimp appetizer was ok. The happy hour shrimp tacos were so so. The Argentinian sea bass was good but odd to have buffalo sauce. Chicken kale salad was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VFNHZFNUbUpyTTBaa1pFTndVMUZ6UlhwRU9HYxAB",
            "text": "It is a good place to have some good time with friends.\n\nI was not  been impressed from the drinks. The food was good.\n\nFair priced for the quality of the food but high priced for the portions they offer in my opinion.\n\nThe environment is simple and relaxing.\n\nOur waiter was very attentive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMnY3dF9hNWFDeXlnRRAB",
            "text": "Great staff and service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOYUd1ODdwdWRTQXFRRRAB",
            "text": "Food was ok, a bit too over priced. The portions are also quite small. The service was not the best, it was slow during my time there but the staff was talking amongst themselves and I had to constantly raise my hand for service. East Harlem has better spots"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNWElqcmYxOV9fUXBBRRAB",
            "text": "Came for a quick bite and to talk with some friends.\n\nService was average it was not busy due to rain store when myself and two others went. So I say that not sure if establishment was packed how better or worst the service may be. This particular day the waitress was serving a total of two tables. Small venue but clean but bathroom smelled like a dirty mop.\n\nHost was kind to info about happy hour. So had a few wines and the beer that comes with burger on happy hour menu\n\nSo had the shrimp tacos (6), burger with fries ( fries over done , greasy, and more like left over fries), the table next to us had fresher fries.\n\nExperience was not awful.\n\nShrimp tacos were tasty. My friend mention the burger wasn’t bad either."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX0Y2TWY3c19pZ3pRRRAB",
            "text": "Simply the best gem in east Harlem! I just wish it didn’t get to popular!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM3Y4dTNabk9yajVnRRAB",
            "text": "Great place,excellent service and good food\nMy 4 time and absolutely not the last one"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTE1oX2ZjNkllS0RnEAE",
            "text": "The food was delicious and fresh. The fried calamari was perfect!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMcXI1NmVpdElQN01REAE",
            "text": "I tried to sit outside as a party of one (since someone recommended Alison to me) and was denied, stating “reservations”. 1.5 hours later, there are still a number of open tables outside. It is Mother’s Day and I’m a new mother that is away…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNUo3X3V3RRAB",
            "text": "Great food. Good vibes. Good price. I unfortunately had to wait a long time for my food to be brought out, as everyone else in our party was already served. And some plates were served cold. We were a larger group, so the kitchen seemed to struggle a bit with timing. All other smaller groups seemed to be doing just fine! They served us a free round of prosecco for my friend's birthday. Very kind!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNEl5MDFnRRAB",
            "text": "Fast and excellent food. The chicken sandwich is awesome. Very nice place close to the park and the Museum of the city of NY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvelllOGRBEAE",
            "text": "Alison in Harlem is a really quaint place with really friendly staff. The food is fresh and delicious, and there is a great selection of wine and beer. I don't frequent Harlem often, but this is my second time there, and both visits were awesome"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvZ2NXSjFnRRAB",
            "text": "The service is great and they have a lovely outdoor seating area. The menu will probably have something for everyone. Great spot to catch up with someone. I ordered salmon med-rare and got it well done once but that really didn’t impact the quality of my experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMWF2X0NREAE",
            "text": "I sat on the front outside and it was so nice watching the street as I enjoyed my lunch. The food was delicious and the service excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXMtTlNREAE",
            "text": "One of the best happy hours in NYC. Looking forward to come back. Really liked their Burgers😁"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWJiZkVBEAE",
            "text": "Cozy. Crowd is friendly. Our server CARLOS was GREAT!!!! 🥰"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaU1EVmJ3EAE",
            "text": "We had brunch here on a rainy museum day and it was really great.  Every neighborhood needs a place like Alison!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJajh2bEd3EAE",
            "text": "Came here for a special night out and was not disappointed! The cocktails were great and paired well with the meal. I would highly recommend the tuna tartare!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJek1PU1N3EAE",
            "text": "Great place to meet & eat with friends, family or that special someone."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJelBqVkJnEAE",
            "text": "I enjoy their happy hour. But my go to is the oysters with a glass of wine of Verdejo. The combination is exquisite! Make sure you come before the live music starts. It gets packed. Which is a great thing!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaUpxejBBRRAB",
            "text": "Left another restaurant for lack of service. Just rocked up Alison, fast efficient service.  See the video and pics will later...let's see how the food is. Service is amazing today 3/29/25. Stay posted..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bmF6YjZRRRAB",
            "text": "Good lunch service… really yummy manchego honey arugula salad"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwb3Y2QXF3RRAB",
            "text": "진짜 우연히 근처에 일할 데를 찾으며 방황하고 있었는제 깔끔한 외관이랑 안 분위기가 좋아서 들어가봤어요. 피시케이크 랑 그릴드 옥토푸스 완전 맛남!!! 진짜 완전 의외의 맛집임. 강추"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN0lENGV3EAE",
            "text": "I had an overall decent experience, though it wasn’t without a few surprises. The food was okay—we ordered the steak and eggs, which came with one slice of bread. The steak was well-cooked, and the eggs were done just right. However, a lot of sauce was left on the plate, and we decided to ask for more bread to scarpetta (soak up the sauce).\n\nThe waiter brought us two extra slices of sourdough, which seemed like a nice gesture. But when the bill came, we were surprised to see a $5 charge for the bread. While I understand that extra items might come with a cost, it would have been helpful if the server had informed us of this charge beforehand.\n\nThe staff were friendly and attentive, but charging $5 for two slices of bread felt excessive—especially without a heads-up. Overall, it's a place with nice staff and decent food, but I’d suggest they be more upfront about extra charges."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNEpTM193RRAB",
            "text": "I absolutely love coming to this restaurant, especially during my lunch breaks at work. It's my go-to spot with friends for indulging in oysters and the best fish tacos around. The ambiance is great, and the staff are super friendly. Definitely a must-try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaHRlek13EAE",
            "text": "What a lovely little restaurant. We spent several hours there on a rainy Saturday evening. The good was delicious. The Five onion soup was probably my favorite because it was rich without being overwhelming but the fries were delicious also. The oyster and wine deal is incredible and the oysters were so fresh and delicate. Even the cauliflower was delightful.\nThe music was perfect and just the right volume so we could chat without feeling like we were yelling.\nAlso the Negroni was delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcktMTUNREAE",
            "text": "One of my favorite restaurants in the neighborhood. It’s a bit pricey and the portions aren’t the largest but I’d still argue that you get what you pay for. Buffalo shrimp was a surprisingly delicious dish. Hibiscus beverage was also delicious. All of their desserts are wonderful as well. Servers are all very friendly and knowledgeable. Great stuff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOWJua09BEAE",
            "text": "Delightful! We came here on a whim before our trip to the Museum of the History of New York, and it was great. The manager on the floor Vladimir welcomed us warmly and our server Sayyid was fun and kind and prompt. We wanted a dozen oysters and a bottle of wine to start and it was 2:52, and he asked “are you starving? If you wait eight minutes we can do the happy hour combo and save you some money.” Totally unprompted and so kind!! We went for that, along with the mushroom croquettes and calamari to begin, then got the chicken schnitzel and Mussels PEI in white wine sauce as entrees.\n\nThe calamari was tasty and crunchy, and not overcooked, and the sauces they came with were killer. The mushroom croquettes were delightful and, again, accompanied by a delicious sauce. The oysters from Martha’s Vineyard were fresh and light, but unfortunately a few had a little shell left over that I crunched on. Totally forgivable though as it was only two.\n\nAs for entrees, the schnitzel was gorgeous: light golden brown, piping hot and ultra tender with a lovely breading and super buttery mashed potatoes. The mussels came cooked wonderfully and the sourdough was crunchy and fresh, but we needed more white wine sauce to go with and when we asked we were given it without a fuss!\n\nWe didn’t think we has room for dessert but Sayyid brought over the espresso flan and we both fell in love and found another stomach. Creamy, rich, balanced with a great  moist texture and just fantastic all around. I finished with a tasty mocha and we called it a day.\n\nWhat an absolute pleasure. I have a feeling this is a neighborhood gem, and deserves to be much busier. The atmosphere is warm and inviting, the decor simple and comfortable, and a great team to back it up. If we’re back in the area we definitely will be stopping in again!\n\n*PLEASE DISREGARD MY HORRID PICTURES I FORGOT TO TAKE THEM BEFORE WE’D EATEN SOME OF OUR FOOD*"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc2R6dkVBEAE",
            "text": "Alison’s is the perfect happy hour joint. The sangria & hibiscus mule gets your buzz going for sure. The hibiscus mule is a highlight to me. Its so refreshing. The french fries are perfection. The right amount of crisp & soft you desire in fries with just the right amount of salt. Their ketchup is actually good too! The oysters are what you’d expect for a happy hour in the area. No frills but my order was fresh. Served with cocktail and Tabasco. The wings are delicious & served with a good bleu cheese. The music is a little too loud, along with the happy hour groups. Besides that, I like this joint. Plus its in my neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeUk3ZlB3EAE",
            "text": "I was finally able to come here after they were closed for Labor day weekend the last time I tried visiting. Me and my group were sat immediately after we mentioned we had reservations.  The server came quickly and took our order, giving us suggestions of what she found good, which was helpful. The food came out at lightning speed, which was amazing, almost like they had it ready in the back. Now the food was amazing the only thing that we had a problem with was that one of the items we ordered never came out but we weren't charged for it, we just hoped the server heard what we had ordered because she nodded yes to everything we asked for. If you go to Alison do have their birrira, it was delicious! Also try to go early because even for a Thursday evening it was very packed. If you don't like waiting don't go late. Alison is a solid place to go and eat with a group if you want a nice place in the barrio to go to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkX2JuRGV3EAE",
            "text": "Underrated foood! I love that while this is an American restaurant, they are still able to add Latin flavors of East Harlem to a few of their dishes on the menu\nWe got old bay fries, the shasuka, and avocado toasts. Everything was well made and delicious! Great food and awesome vibes, couldn’t ask for better tbh! I absolutely love it here!\n\nI also had dinner here in the past and I really enjoyed the food then as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwajcyRDdRRRAB",
            "text": "Rough visit, super underwhelming/ disappointing. Oysters were clearly bad (off smell and taste). They charged us for 6 of the 12 to make amends - which is just insane. Watermelon salad was the highlight(?) Rest of the food took 50 minutes to arrive. It was mediocre at best. Avoid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aEplQUpnEAE",
            "text": "One of the cutest spots in the city! Tucked away and hidden if you blinked, Alison is full of charm and deliciousness. The exposed brick is painted throughout as an upbeat playlist was boomed out throughout our meal. I was glad it started to pour as it gave us more time to enjoy the atmosphere.\nThe food was very good, each course better than the last. I had a mediterranean and it was packed full of flavor. The affogato I had was the perfect way to end the meal I would highly recommend that.\nI’ll be telling all my friends about this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycy1LQUtnEAE",
            "text": "Such a lovely restaurant. Menu looks beautifully crafted, ambience was beautiful. We walked in on a Wednesday evening and got to enjoy some live jazz. Such a beautiful treat while dining. Will definitely be back regularly. Outdoor seating looks nice also."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtb2VMVTVBRRAB",
            "text": "I've walked by this place many times going to my apt and saw that it seemed like a wine and oyster bar which isn't 100% my thing. I recently saw an ad pop up in my Instagram stories and looked at their menu, and saw there were so many other delicious food choices. My friend was in town, so I decided it was close to both of us and I was craving brunch. I loved the ambience, had a rustic decor to it. I had and needed four cups of coffee 😆 and enjoyed some mimosas. I ordered the French omelet and asked if I can have both options in it (it was either brie cheese and chives OR bacon and onions) which came with a arugula salad. My friend got the burger, with bacon and asked for both salad and fries. Over all, we enjoyed this place and I'll be back with my bf for their dinner (lots of great options there)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubmJxWFJ3EAE",
            "text": "We loved the experience stumbled upon this cute restaurant and it hit the spot for the hangover regival! Our bartender Alexis was incredible. Made an amazing suggestion for the Chiquilles  and they were spicy, fresh, the flavor profile was immaculate with the pickled onions.\nVlad was so cute and polite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMThuNmtnRRAB",
            "text": "I love Alison – one of my gems in East Harlem. Stopped for their ‘Happy Hour’ which had a great selection of snacks, tacos and drinks. Had the Taco Pastor with marinated pork-delicious! 🤌🏼 Next time I will have the Rabbit Ragu, which is the daily special – can’t wait! Has a very attentive staff and enjoyed talking with the great new manager, Maddy. Also, loved the cozy ambience with a great art selection on the back wall. I have to come more often and would definitely recommend this place to anyone! See you there next time!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbE9xOUtREAE",
            "text": "My experience at Alison was great.\n\nTheir selection of craft beers is ok. I didn't find a beer I haven't tried on the draft list but they have interesting can choices as alternative.\n\nWe ordered their oyster rose combo as a starter. The oysters were really delicious. Definitely a good place to go for oysters.\n\nAs a main I had the salmon burger with fries. The fries were crispy and well seasoned. The salmon burger was delicious too. All over a great experience.\n\nThe service was all the time friendly and fast."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzck9MZGZBEAE",
            "text": "Walk around the neighborhood with my friend and discover this beautiful restaurant - when we stepped in, the service was very welcoming and warm. We decide to try the oysters and beer special to start and the steak/salmon sandwich’s for main.\nThe oysters were very fresh and extremely good!\nI highly recommend to get the onion soup with the sandwich! I will definitely come back again for it 😍\nOverall I give this place 5-stars. Very good vibe, very nice staff and most importantly the food was really amazing!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwZ2ZDWGpnRRAB",
            "text": "Still good even for take-out!! Perfectly cooked-to-order (medium) burgers! Appetizers pretty great too.\n\nOur food (pasta, and burger) was pretty delicious. Customer service was good too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNEsta213RRAB",
            "text": "They have the best French fries! We visited for brunch and ordered a burger, shakshouka, and chilaquiles. All dishes were delicious, though a bit on the spicy side. The shakshouka comes with a choice of chorizo or avocado."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdzVtZmxBRRAB",
            "text": "I was walking through my neighborhood after my doctors appointment and decided to eat something light. I decided to select from their lunch specials menu. The steak sandwich was good. However, that arugula salad with candied walnut and honey vinegarette was absolutely delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MmVpV0lBEAE",
            "text": "I was meeting a friend for dinner and it was pouring out. Being wet and cold instantly disappeared once I walked into this magical restaurant! The place is cozy, tables well spaced, clean and comfortable.\n\nThe wait staff was super friendly, made good suggestions and brought the food out timely. We had the crispy chickpeas with rosemary and black salt. This is listed under snacks. I suggest you order these as soon as you sit down to snack on while deciding what to order. The chickpeas were deep fried with wonderful seasoning and had a delightful crispy taste.\n\nThey have a wonderful wine list. We had the Chateau De Chantegrive Graves 2012. It is a Sauvignon Blanc & Semillon, France. It tasted like a mixture of a Sauvignon Blanc and a Chardonnay and was not too sweet. It also is a great value at $11 a glass.\n\nWe started with the Steak Tartare appetizer with fresh Chile and ponzu sauce. The chef at this place is a master at spicing, the true art of cooking. Fresh Chile and ponzu are two very flavorful ingredients where each can dominate. Just the right amount of each was added and the flavors blended perfectly with the tartare.\n\nWe then had the Wild Dover Sole with salsa Verde and the Salmon Rice Bowl with coconut rice, seared salmon, avocado, seaweed, sesame seeds and ponzu sauce. I had never had wild dover soles and wanted to try them. The dover soles were incredibly light and almost melted in our mouths.\n\nThe Salmon Rice bowl was extraordinary with oodles of flavor. The coconut rice was cooked to perfection.\n\nWe finished with a cappuccino and latte and the coffee flan. I love flan and coffee so it was heavenly for me. The flan had a strong coffee taste and was not overly sweet as some flans are.\n\nCan't wait to go back and try other dishes.\nEven though I do not live in the neighborhood it is worth the trip!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOHAzWWhRRRAB",
            "text": "Great food! Wine mussels are delicious. Spicy steak entree done just right. Friendly staff 👌🏽 they also have non-alcoholic beer on the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOEktOUVBEAE",
            "text": "My roommate and I are new to the neighborhood and we are in love with this place!! From start to finish the experience was so so lovely. We started off with the dozen oysters and rose bottle, both were phenomenal. Then we ordered the steak tartare and their infamous fries. Both were delicious and the presentation of the steak tartare was too pretty to eat. We then had to order the spicy tuna crispy rice which was too good it should be illegal. I’ve had spicy tuna crispy rice at a lot of places and this one is up there!! Then we got dessert of course and they didn’t have the pistachio cheesecake but we ordered the crème brûlée instead which was heavenly. Then to make the night and dinner an unforgettable one our waitress gave us free glasses of wine to celebrate us being new to the neighborhood!! The service was impeccable and the waitress and waiter we had was so friendly. 20/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dzdDdkl3EAE",
            "text": "Wow what a disappointment! We used to come here consistently. Always a great experience and always great service so much so that we brought others and recommended it to others. We had not been in a while given the current state of the city but decided to go back to \"one of our favorite spots\" last night. Unfortunately, as soon as we arrived it felt like we were in an alternate universe. The blond hostess took a while to approach. We did not realize that our reservation was outside so inquired about within. She said she would check but did not really. She just turned around and said no. She said outside was our only option.  Despite that it is not yet spring or summer, we hesitantly agreed. So here's the thing:  (1) If you are offering outside seating during cold weather, you should have heating lamps or not have it be an option at all. (2) Unless you are offering a discount for those eating outside, the quality of service and food should be the same. The drinks and meals took forever to come. It was like the staff themselves did not want to come outside. The meals were dropped off by a guy who seemed annoyed.  A female server only refilled the water for the table closest to the door. When she returned later to remove our plates, she also seemed annoyed and did not respond when we thanked her. She almost hit my husband in the face with a dirty dish from another table. The host came outside briefly twice and never once approached our table. She knew it was cold yet she never offered to move us to the bar or inside if a table became available instead she accommodated others  who came after with no reservations. Now the food...The burger was requested WELL DONE and it was not. One of the buns was soggy. Given the long wait and that it was cold, we did not risk returning it as we desperately wanted to leave. The free range chicken which we have ordered often always included a breast. This time it did not and seemed smaller. The drinks were watered down probably from how long they were left at the bar. I have never left no tip because I know working at a restaurant is not easy especially on a busy night but this experience was pretty tempting to change my commitment. Before we left, I went to use the restroom and yes there was space at the bar and an empty table but again, the hostess did not care enough.  This was not the Alison that we knew and loved nor were all the familiar faces there except for the waitress who took our order. I know things like this happen but it does not make the experience any less disappointing when you are used to expecting the best from a place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONHNyZS1nRRAB",
            "text": "Everything we ate was great except for one thing which is why I’m giving it 4 stars. The oysters were delicious, the shrimp ceviche with avocado was to die for with homemade tortilla chips! We also had the crispy chickpeas, super airy and well seasoned. However the arugula mánchego salad was disappointing; I love arugula and I’d eat it alone but they added so much honey that it tasted like a dessert rather than a balanced taste and it was quite sticky.\n\nMy suggestion to make this better: make a dressing with apple cider vinegar, lime, olive oil and very litter honey. That way you have a good balance of acidity and sweetness.\n\nOn the drinks side I had a Sauvignon blanc 2012 and my sister had a dry Riesling from Upstate which was very nice and crisp. I’m not a fan a of Riesling but this dry one was a winner!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyb0lpZklREAE",
            "text": "Can’t go wrong with this place.\nMenu has a variety of food for everyone. We tried the burger and oyster po’boy and were so good.\n\nVery nice interior design and great staff.\nDefinitely coming back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtb2RfVHV3RRAB",
            "text": "Exactly what I was looking for in the neighborhood — Nice beers on tap with a handsome interior and variety of dishes available. The labneh and schnitzel hit the spot as I saw the dining room fill up with regulars on a Friday afternoon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieU8zRVpREAE",
            "text": "Cute place, good food, would definitely come back! Favorite thing we had was the shrimp aguachile!"
        }
    ],
    "reviews_count": 78
}