{
    "name": "Spaha Soul",
    "place_id": "ChIJwWtsav31wokRxEWigV3aUjM",
    "grid": "MN11",
    "address": "2294 2nd Ave, New York, NY 10035, USA",
    "rating": 4.4,
    "user_ratings_total": 158,
    "phone_number": "(347) 463-7387",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd2QyTTJTbmxqVkdKS01FWjNhVFZNWW1jMVZIYxAB",
            "text": "A damn vibe!!!! Tell artist to let you try his mole! I love it here — it honestly feels like family. Artist is like my tío, feeding me and my friends, filling the space with stories, laughter, and good vibes. I’m already planning to come back later this week with more friends!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUE5GOUVMVkpITjB0NWVGWjJWbXgyUWxOcGRtYxAB",
            "text": "Dining here was more than just a meal — it was an experience that touched the heart. From the moment I walked in, I could feel the warmth and authenticity of the space. It’s intimate and inviting, filled with laughter, love, and the comforting feeling of being welcomed into someone’s home.\n\nEverything is made to order with the freshest, highest-quality ingredients, and you can taste the care and passion behind every dish. The chef is truly exceptional — not just in his culinary skill, but in the way he creates an atmosphere that feels deeply personal and genuine.\n\nThis isn’t a traditional restaurant — it’s an elevated experience where food, family, and heart all come together beautifully. You can feel the love in every bite and the joy in every moment. A truly special place that reminds you why food made with passion and purpose is unforgettable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVVXVkNhbmxDVUV0dlNHd3lhbFppWHpWT1owRRAB",
            "text": "This spot combines quality and service! The team has a level of beauty that's apparent. Their dishes stand out from countless others. This place delivers more than most. Wonderful cooking, prompt attention, and remarkably kind staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMmFVaDNaVjlFYUhCVGVuWndkVXc1YjJWQ1JFRRAB",
            "text": "Great food! Great service ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkemIwZHhZMW8zYUhCSWJFVkpSV1pKYlZaRFRFRRAB",
            "text": "The place delivers solid meals. The food is noteworthy and the service is considerate. Fresh ingredients make their dishes special. The staff's demeanor adds to the overall experience. This spot makes me happy every visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1REVkhkMVJQVm1GUFVtaHhUblpWY0haVGIyYxAB",
            "text": "Really nice intimate setting, came here with my family for juneteenth. This is how you do soul food. Fantastic! The watermelon salad, corn bread and fried chicken really stood out. The owner is an amazing person that really cares about the ingredients  and cultural significance"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdjhUemlBRRAB",
            "text": "Me and my girlfriend came all the way here, only for them to be closed. It's 10:30pm and it says they close at 12:30am. Falsely advertising"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaWV2dGZ3EAE",
            "text": "Amazing soul food. You can tell everything was cooked with love and the chef is a splendid person."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbVAtdHpRRRAB",
            "text": "Every time I get the chance to eat at Spaha Soul, it's one of the best meals of my life. Our last visit was right before Christmas last year and it was just as good as it's always been (better, even, as we got a taste of live music AND the BBQ sauce that I'd yet to try!). The food's incredible, the atmosphere is killer, and Artist delivers one of the most personable dining experiences around. Can't wait for future visits!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM3NQd0RBEAE",
            "text": "Delicious food and beautiful decor. I loved everything about this place. He(The Chef)was such a gentleman & professional. He really cares and takes it to heart. We tipped big and we plan on dining here again maybe even bringing more people with us.\nThank You and we will be back\nDon't hesitate to contact this place and business and cough up your money. You will not regret it. Don't meet me there beat me there"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdmNEZ3RnRRAB",
            "text": "Had his catering at a party. The food and proprietor steered great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOFotUzlBRRAB",
            "text": "Artist’s SpaHa Soul is not to be missed. Between the atmosphere he creates with music, lighting, guests, to the delicious dishes, it’s a 10/10 every time.\nWe had a private party catered by Artist in our home- he and his team went above and beyond our expectations of hosting an entire PIG ROAST on a hot NYC summer night! He was able to provide the flowers, table settings, etc within a moments notice!!! Every one of our guests went back for 2nd and 3rd plates full of the soul food. Leftovers were neatly packed and  we then finished the night with a surprise musical guest.\nWe cannot thank him enough for making our birthday celebration one for the books !  🎉✨🙏🏼"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNzZmZ2ZBEAE",
            "text": "We have celebrated a couple of milestones here, and every single time we go, Chef Artist is the most gracious, consummate host, making us feel at home and one of the family on each and every visit.\nTo say that the food was \"delicious as usual\", is an immense understatement! We thoroughly enjoyed our time and would definitely recommend it.\nAn unforgettable night you will be glad you experienced... CALL HIM AND BOOK IT NOW!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdHVqb1pBEAE",
            "text": "my biggest regret is not being able to eat more. such a gem of a place & chef 🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bGZ5QXhnRRAB",
            "text": "Let me start by saying this is an experience.  Don't book a reservation if you want to eat & run. This is like going over to a family members house, who can really throw down!! If you are a REAL Soul Food Foodie, then this is the right place to be. Chef Artis is so attentive, friendly, kind, personable, & a Damn Good Chef!! We were in town to celebrate our 10th anniversary & I booked my reservation 2 months in advance. We ordered \"Family Style\" which included 2 proteins, all sides & DELICIOUS cornbread. Our meal consisted of these beautifully smothered pork chops with shrimp in a flavorful roux, chicken that had been marinaded in herbs, dredge in seasoned flour & pan fried in a cast-iron skillet. The sides were a deliciously seasoned rice, Cheese & Mac, flavorful collard greens & a whipped sweet potato that will make you wanna SLAP somebody!!! The cornbread was perfection, even though I had to resist eating too much so I could leave room for ALL the other goodies!!! It was quiet, intimate,  good music, Chef Artis checked on us multiple times & chatted with us once he had completed his masterpiece & served it to us to devour! This is how food is supposed to be eaten, slowly & with joy. Excellent experience & best meal we had during our travels. Thank you Chef Artis!👏🏽👏🏽👏🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicjY2cldnEAE",
            "text": "Great food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiektyYk1nEAE",
            "text": "Amazing soul food and vegetarian options. He is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNGJuLVd3EAE",
            "text": "I had such an amazing time here. My husband David made reservations via text and we used the chef course options that had various course meals that were out of this world. They do have BYOB option, and you need to call/text ahead for reservations. I highly recommend and had such an amazing experience and really good food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb2NtZVB3EAE",
            "text": "Chef Artist is a warm and inviting person whose personality you can taste in every bite of his food. It’s rich and loving and just a bit complicated. I’d highly recommend Spaha Soul to anyone looking for a special evening with knock you out delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNFlMRXBBRRAB",
            "text": "We did a 20 person buyout here for a friends reunion here and it was *chefs kiss* so fun and amazing! Accommodating chef, ByoB, other world fried chicken, etc etc! Highly recommended! Do not, and I mean it, do not skip the cornbread."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdnZlT0N3EAE",
            "text": "Very cozy setting in Harlem. The Owner is very welcoming and the food was delicious. The fried chicken and fried fish was great, the mac n cheese was excellent as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdnRlSDlnRRAB",
            "text": "A very accommodating experience, the owner makes you feel like you’re in his dining room. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMFlQRVp3EAE",
            "text": "The pork chops with skrimps were amazingggggg!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUck9PTkZnEAE",
            "text": "I took my mom here for Mother's Day with my family. Chef Artist was exceptional.  My family had a wonderful experience.The food was flavorful and delightful. Thank you Chef Artist for such a wonderful experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEb2NEM2N3EAE",
            "text": "Space is small, so a reservation is definitely needed. All run by chef and owner, Artist. That day we had the place almost all to ourselves and he made our experience one of a kind with his hospitality and attention. Eating delicious food while the guest musician played made for good vibes. We made quick friends with our dining neighbor and the whole restaurant just talked about life. Would definitely return again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MHJyOWNnEAE",
            "text": "Artist (the chef) created a meal for us which was simultaneously unique and comforting.  We enjoyed every bite of it and refused to leave anything on the plate.  We also had the joy of getting to know Artist throughout the meal, and he made us feel at home.\nSharing the evening with this wonderful person while also being spoiled by his culinary talent made for an experience we cannot forget.  Could not ask for a better meal.  Thank you, Artist!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNklXcmhBRRAB",
            "text": "Mind blowing food and the homiest service anyone could ask for. Will absolutely be coming back. Respect from Canada 🍁"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONV9ta1l3EAE",
            "text": "just bring the food in a timely fashion"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc09fUEN3EAE",
            "text": "The food was excellent and it was a great vibe. Will definitely go back....."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaczRLV0xnEAE",
            "text": "Amazing chef and restaurant makes you feel ya home! Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabzlxUGpRRRAB",
            "text": "Amazing food, music and atmosphere. Make sure to make reservations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNE1DUmF3EAE",
            "text": "Everything I ever get here is of the highest quality. The collards are extra delicious and the atmosphere is really comfortable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MzdPbU9REAE",
            "text": "The owner is a lier and a stealer he will keep your deposit for your birthday without providing the diner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnR2Z1NREAE",
            "text": "The head chef is the owner at spaha soul and his love for food is unmatched ! When you come in you feel like family the way Artist treats everyone and welcomes you in his restaurant it was a amazing experience when we came in there was live music ! Its BYOB so we went crazy! My experience here was 10\\10! The food is all fresh and cooked after we order our food took a while but thats to be expected becuase the food is so fresh ! I would recommend this place to ANYONE who is looking for a lovely date night or just some amazing soul food ! Before i forget its also reservations only !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4anA3RTBBRRAB",
            "text": "Great food, great atmosphere, great host!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc3FQQkRnEAE",
            "text": "Having grown up on Soul food I'm a hard critic but Chef Artist is just that..an Artist. The food and service made me feel at home, I just needed my lazy boy and to kick my shoes off. The buttermilk fried chicken is top notch and the mac n cheese is almost as good as mine 😉.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeExXQ2pBRRAB",
            "text": "This is such a special experience! The owner is very particular about each detail that fills the space. From the fresh flower cuttings on the table, the meticulous plating (as best showcased on the crab cakes), the personally curated artwork, and the music that permeates the cozy space. The operation seems to have three people at most: the head chef/owner, a sous chef of sorts, and a live musician. The owner and head chef, Artist, is incredibly kind, welcoming, warm, fun, and just a consummate host. You will feel welcomed here.\n\nBe patient as you wait for your perfect bites of soul food. We started off with the scrimps, which were served in a lightly spiced roux and deliciously little sliced peppers and onions— accompanied with a delicious side of buttery cornbread. We moved on to a righteous soul food cypher: rosemary fried chicken, baked mac and cheese, collard greens, and sweet potatoes. Every bit was good. We finished up with the crab cakes, which the musician from Maryland testified were the best. We agree! Fluffy, perfectly seasoned, and delicious.\n\nAs for the music, the guitarist, Andrew, asked us some questions about what we like to hear, and upon finding out we liked a certain jazz guitarist, proceeded to play a whole album. Unreal!\n\nThis is a very special place. Bring your lover, your best friends, your dear family, and whomever else deserves a special night made just right. We passed by this place in January 2020, and decided we’d go in the Spring— what a wash that was! So we were really glad that SpaHa Soul survived the pandemic restaurant industry downturn. We can’t wait til we come back again, this time with some friends!\n\nAttached are some pictures of the food and space. Unfortunately we didn’t even think to take pictures of the chicken and co— we just jumped in to see what was good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbktiV1JREAE",
            "text": "Great vibes at this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NWNxd2RBEAE",
            "text": "Dining at Spaha is not a typical restaurant, Artist (the owner) only allows advance reservations and takes 1-2 tables per seating. But that's what makes it so special. Not only is the food incredible, but Artist creates one of the best (and most reasonably priced) private dining experiences in NYC. He'll tell you stories of his career, give you the history behind each dish, and often bring out complimentary food/drinks depending on what he's got in the back.\n\nSome tips:\n--plan for 3-4 hours, if you're rushing out it's not the full experience\n--bring alcohol, it's byob (with corking fee) though sometimes you'll get complimentary drinks\n--tell Artist your orders the day before so he can buy the ingredients\n--get the ribs and cornbread, both are some of the best I've ever had"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1enFMaXdnRRAB",
            "text": "Food was good...room for improvement overall ...needs more man/woman power"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydTlEdDl3RRAB",
            "text": "My first time today  And I will forever chase this first time experience.  I loved the food and the owner is a class act .   The restaurant was clean, the owner constantly in a good way checking that our needs we're attended to in an…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeFlPOXRnRRAB",
            "text": "Wonderful dining experience and excellently prepared and delicious food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeWVtQXd3RRAB",
            "text": "The food and atmosphere was awesome. The meal was delicious and my friend has such a great time she did don't even realize she was drinking the sauce from her Skrimps meal after all the food on the plate was gone 😂 Will definitely return…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteDZ1WG1BRRAB",
            "text": "Loved my time there. Definitely going back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhb0lLOC13RRAB",
            "text": "So so good and the chef is the kindest person ever. The service is very unique. I highly recommend coming here!! BYOB and don’t forget to call for reservations!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNk9PYUR3EAE",
            "text": "Lovely small restaurant that makes you feel like you are in someone's living room. The owner/chef, Artist,  was gracious and presented a delicious variety of dishes which he prepares himself for all his guests. I had fried chicken, mac 'n cheese and collard greens and the best cornbread I have had in ages. You can tell it was prepared with skill and love. True Soul Food. With music in the background and lively conversation it was a real experience that I am so happy to have had. I want to return for the Pork chops. It is BYOB establishment, so bring your favorite beverage.  Make a reservation and pay Spaha Soul a visit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cUpQTmpBRRAB",
            "text": "The food is amazing here, everything on their menu taste amazing! And they have an excellent menu selection here too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpX095bUJnEAE",
            "text": "Feels like a home away from home. 🏡…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDN09POS1RRRAB",
            "text": "Completely excited to find a southern food spot that is so welcoming and the food is delicious! The owner was soooooo understanding of my allergies and made the food with understanding. He was honest on him trying to keep his business open…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bC1hQ2FnEAE",
            "text": "Good food, good atmosphere."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNM01hT2F3EAE",
            "text": "One of the nicest experiences I've ever had at a restaurant. It was so beautiful inside. From the music, the decor and the personal service. The food is made on the spot and you need a reservation but trust me, it's so worth it"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc19EX1lREAE",
            "text": "Was very interested following the NYT review. This restaurant apparently takes reservations only, but I managed to get in without one.\n\nFor a 15-25 seat restaurant, they only had 2 staff. The service was friendly, but it ends there. The food service was slow, and for such a restaurant, the execution was not great. It felt like the chef was very distracted, as he was managing the front and the back of the house. The other server was also frequently going out to buy stuff for the kitchen.\n\nFor drinks, they have a BYOB concept. That really means go get your drinks from the deli next door because we ain't serving any.\n\nThe food was also not great. Had fried chicken with Mac and cheese. The chicken came well brined and was juicy, but the chicken was very soft on the crust. You could taste the flavor in the batter, but the execution was not there. Not impressed especially when I'm going to consume that many calories."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNFp1WHhBRRAB",
            "text": "My boyfriend and I LOVE this restaurant and always felt so welcome walking in! I have some diet restrictions and the owner/chef was so understanding and made us an amazing meals. Definitely one of a kind place with terrific food. Recommend…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMzRtR1N3EAE",
            "text": "My family and I ate here on Thanksgiving.. and we loved it! It's cozy and welcoming. The food was excellent. Even my great nephew (age 6 ) was commenting on how great the food was. He was dancing while he ate, that says it all.\nThe food was made with love.\nWe loved everything about this place.\nAnd the decor was cute too.\n\nF.Y.I\nIt's B.Y.O.B .. which is perfect ... you can bring your own choice of beverage and not have to pay those ridiculously over priced alcoholic beverages like at other locations.\n\nThank you Artist for accommodating us"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcnZtRWd3RRAB",
            "text": "This was one of the greatest restaurant experiences I have ever had.  Artist and Kevin made us feel at home from the minute we walked in the door.  The setting is very relaxed and intimate- you feel welcome at home.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveGNqYXBBRRAB",
            "text": "The spaha rice, curried yams, macaroni and cheese and roasted pork chops was so delicious. Seasoned to perfection. Food made fresh while we waited. Live music was also great and musician took requests. Loved the ambiance and the owner/chef…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbzlYekdREAE",
            "text": "I love this place! The food is delicious but the chef makes you feel special. It’s an amazing experience that everyone should have. My fave is the Mac and cheese and pork chops...like my mom used to make but with a heavenly twist."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneG9qUzRBRRAB",
            "text": "I went there last night to celebrate with my lil cousin. The took so long with the food. They said it close at 11pm but brought the food out extremely late close to 11pm. They kept saying we close at 11pm but no food. When they brought the food out, it looked good til I taste it. It was horrible. Never in my life have I taste rice that was completely hard. The bbq chicken wasn't even cooked all the way. I like my food well done. When I said something The cooker looked confused. I waited one hour for another plate.  The macaroni and cheese was bad. They put too much garlic in it, all I taste was garlic. They rushed when they cooked because not one thing on my plate was cooked all the way. Wonder who cooked the food because this place had it bad last night serving 25 to 30 people. They only thing I enjoyed was the salmon cakes that's why I gave one star."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRd3NmN3JRRRAB",
            "text": "If you want an intimate dining experience and delicious food made with love, SpaHa Soul is for you. I had the baked chicken with gravy, collard greens and dirty rice for my meal and had to restrain myself from licking the plate!  The…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOE15US1nRRAB",
            "text": "Event was to start at 7:45 but plates didn’t come out until after 11. The chef emphasized how “they close at 11” though. Most of the party of 30 didn’t get served their plates until around 11:30. The food looked great but it was the worst soul food experience I’ve ever had. The rice was cold wet unseasoned and crunchy and the chicken was UNDERDONE. One guest was sick after a few bites of the BBQ chicken.\n\nFew people sent their plates back and MAJORITY people didn’t even touch their food.\n\nSalmon cakes were the only good thing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeTU2X0J3EAE",
            "text": "Having dinner at SpaHa Soul is like coming home to a meal cooked with love! The cuisine is masterfully prepared by Chef Artist Thornton who takes his time to season, bake, or fry every dish to perfection. I love his twist on the classic…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwaU9hcURBEAE",
            "text": "If you want an incredible meal with impeccable service, this is the spot. Artist is the owner/chef/server and does it all magically. Bring a bottle of wine and someone you like spending time with and be prepared for one of the best meals of your life."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaU1xNE1REAE",
            "text": "Firstly this is a lovely addition to a changing neighborhood; it's one of those places that brings back memories of \"old New York\"; a small place with charm, great food, which I would call \"elevated soul\" with the traditional dishes, fried chicken, pork chops, mac & cheese etc. and where the owner takes the time to knows your name.\n\nArtist (Chef & Owner) has specials that change often, which makes being a regular interesting as you never know what new things you might be trying to go along with your fried chicken (made to order).\n\nI highly recommend the Prix Fix as you get the opportunity to try not only the traditional dishes, but will get to try the items on special. Did I mention Brunch, on Sat & Sun which includes Red Velvet pancakes!\n\nI hope SpaHa will become that \"neighborhood place\" where you can take a date or your family; and still have a great time; especially if Artist has time to come out and say hello."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcUlXT0hnEAE",
            "text": "When we walked in, we knew we were in the presence of culinary magic.  The turkey, salmon, greens, and deserts were prepared beyond perfection, presented well, and needed no added seasoning.  The owner and chef, Artist Thornton, is to food what miracles are to living – rare and highly appreciated.   The atmosphere, understated elegance, is warm and relaxing. While it is a BYOB, Spaha Soul can have your wine and spirits delivered when you arrive, or you can always bring your own.  Moreover, the prices are budget-friendly! Spaha Soul is a culinary mind, soul, and palette experience and well worth a top entry on your A-list of places to go in the City. Around the corner from the 125th street, drop in at 2294 Second Avenue and prepare to be pampered and awed."
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBXzZpZE5nEAE",
            "text": "Great food great atmosphere amazingly nice owner. I wrote my first review October 2013 and have gone to this place more times than I can count.  I have been here at least 100 times.\n\nSpaha Soul brings a great little restaurant to Pleasant Ave and East Harlem neighborhood. Owned by Artist T, he greets you with a hearty hello as you look around at the art (that rotates) and listen to the amazing music (often live) that creates a wonderful atmosphere.\n\nThings you must know:\n1) The food is fresh-orders daily and isn't made until you order it.\n2) There is a huge variety on the menu for all food types:  'regular/traditional', vegetarian, pescatarian, vegan, paleo, etc.\n3) Sunday is brunch/limited menu only\n4) RSVPs never hurt because the restaurant is small\n5) BYOB BUT BUT if you want to drink based on what you order, there is a great place that delivers (and around the corner).  Artist hands you his phone with the number programmed in to place your personal wine order.\n6)  Delivery is not guaranteed-choose pick-up or dine in\n7) Not sure what you want to eat?  Talk it out with him!\n8)  Can you say deal?  Ask what the nightly pre fixe is.  You will get 3-4 scrumptious courses for $35; yes that is not a typo!\n9) cash only\n\nThe owner and proprietor, Artist, makes the food from the heart.  Definitely a gem for the area!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaU9EOEZBEAE",
            "text": "One of best food experiences I have had. The owner and chef is very accommodating and friendly, and home cooks per table. He also makes great conversation. BYOB also."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcVoyc0lREAE",
            "text": "We were a party of 5 who arrived without a reservation. Owner could not have been nicer in accommodating us. The guy is a prince. Food was delicious too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwX0x6bUV3EAE",
            "text": "The restaurant looked really nice; loved the decor and music. The food is nothing short of spectacular and Artist was super nice and welcoming. Loved everything and will be sure to go back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNTZMaVpBEAE",
            "text": "Visited SpaHA Soul for my birthday dinner and I have to say the cozy ambiance and delicious home cooked meal was everything I needed! THE BEST dining experience I've had in a long time! BYOB :)"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbDV1QVpnEAE",
            "text": "Great food, Artist the owner, chef, DJ, waitstaff is the nicest guy. Make sure to give him a heads up by calling in advance on weeknights. Can not rate it highly enough! So good"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNy1TWl9RRRAB",
            "text": "Great food and the chef is one of the coolest nicest guys you'll ever meet.  Small place but you should definitely try it.  You won't be disappointed."
        }
    ],
    "reviews_count": 71
}