{
    "name": "Cascalote",
    "place_id": "ChIJ7yuPRgH2wokRsNJqsaAqjU4",
    "grid": "MN11",
    "address": "2126 2nd Ave, New York, NY 10029, USA",
    "rating": 4.6,
    "user_ratings_total": 391,
    "phone_number": "(646) 351-6574",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podk16QkhlamRSZEZab1JVd3dSV2hsUW01S1NWRRAB",
            "text": "Food was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc0xYUkNhbFZOTW1ZNFVYZHZTV2M0UTB0aVNFRRAB",
            "text": "FOOD HERE IS PHENOMENAL"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1NHZGxTMUEyUTBwTFJXOU9TMEZZTFhCbFdWRRAB",
            "text": "i came to eat with my family on september 2025\nthe food was spoiled and very bad tasted.\nas well the daughter or relatives was  very rude i think the family owned. it`s a small restaurant. with very poor hygene.\nperhaps they just came here in New York.\ncity need it to do somekind of  investigation of the cleanest or hygine,from health deppartment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTlNVZDFjRkUwYTBaTlVqSlFla05EY21WeGFWRRAB",
            "text": "I love this place. It’s a small local spot. The music is a vibe. I walk here from home and it’s my go to for a drink and a bite to eat. The bartender there makes amazing drinks and they are strong. Their menu is small but what they do have tastes amazing. Definitely recommend for a quick bite and a drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MlVFNXphMjVZUmsxUVV6RjRWa0pWVFZkWlNVRRAB",
            "text": "Amazing food and drinks. And beautiful decor inside, as well as in the back patio. Have had a couple of amazing evenings at Cascalote… and am especially grateful to the host who ran two blocks to catch us up after we left to return the sweater that I had left behind at our table! :) Love this place, will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd1JXZE1jaTFMVFRoalptZFFXWGRHVFhkU1NFRRAB",
            "text": "Wonderful place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneVoxbENaa2ROYW1sek5sWjNjbGM1Uld4amRGRRAB",
            "text": "I think the only restaurants I’ve been more to than this is my own mother’s kitchen and McDonalds.  Always and consistently great and I’m saying this as someone who has tried many things on the menu. Ordered the chicken parm this last time and it tasted like someone’s Nona was in the back. My girl who makes the margaritas? You’re killing it. Best in the city and always made from natural, real ingredients. Can’t recommend enough."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WVMybENOVlpyT0RoVFQxRmhMVlphUnpreVJXYxAB",
            "text": "Delicious food, fantastic skilled staff, and a great place to hold your private event. Patsy and her team are so helpful and kind. Their backyard is a dream area - a hidden gem you want to miss:)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1NHNXJWRzVLUkhWS1MxZHFiekpEYzFaaWVuYxAB",
            "text": "The spot is fire. The food 🔥. The service 🔥. Atmosphere"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bzZTdXhBRRAB",
            "text": "Always satisfying local favorite. Small space with diverse clientele. The tiny kitchen always kicks our delicious standard and creative specials. Don't miss the aguas frescas."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeldHUndXWGhTUzJoQ2RsbFpNV2hoYkdKVk5tYxAB",
            "text": "Too expensive"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVoyVjVibWs0TUdZd01tbDNja3MyYW1VM00xRRAB",
            "text": "Always good to be here excellent service , good food and drinks.Beautiful environment always with good vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdVlvTkgwM29QQ1NBEAE",
            "text": "Omg I went here with my God daughter and had to do a virtual mtg. The people were so nice that they put down rhe music so I can be able to proceed with my mtg also in the bathroom they have females sanitary pads for the just in case. The food, service and everything in between was awesome. I definitely need to go back and yes I ate all the food... I usually dont, so that says a lot and yes I was full!!!"
        },
        {
            "date": "4달 전",
            "language": "gn",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1FXMVpRMmQxTVVwWVluQlJla0UzTVVGT04wRRAB",
            "text": "Yummy tacos and agua fresca!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNenVoNnZwd2Z6dlRBEAE",
            "text": "I ordered takeout (taco, burrito, salad, and two drinks), and I was exceptionally pleased. We just moved to the neighborhood, and the takeout was so good that I can’t wait to visit in person and make this restaurant a regular spot. My grilled shrimp salad was delicious! Full of watercress, tomato, avocado, plantain, corn, and radish. Exactly what I was craving, and the drinks are solid."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdFB6dU9BEAE",
            "text": "Everything  I ordered taste amazing, the music and the service is on point. The veggie nachos pictured was delicious ! I’ll definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMU51Z19BRRAB",
            "text": "Such an awesome place. Great food!! Everyone was so nice and made sure we all had a great time!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMUt1dmhnRRAB",
            "text": "Everything was so good and the vibes were amazing!! Def recommend to try it out!!💗💗"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMU91SnJ3RRAB",
            "text": "Great food, super fresh and a nice atmosphere. Highly recommend it if you're in the neighborhood!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNDl6SWFBEAE",
            "text": "The service in this restaurant is excellent, very attentive and friendly servers. I ordered Yuca fries and unfortunately they were undercooked and uneatable but you could tell that they use fresh Yuca, my boyfriend loved the steak and fries that he ordered and the drinks were very good but super strong.\n\nThe things that were a bit disappointing were the strong smell of Burt oil and cleaning supplies coming out of the kitchen towards the end of the night, we were there a bit past 10pm and I assume that they were closing the kitchen at that time which is understandable but it was a very unpleasant smell and also the music, it was super loud, extremely loud tbh."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaS1PMk1REAE",
            "text": "Great FOLD, energy, and the service is 5 starS! Order the Cadillac drink its my fave!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX0xEcUZBEAE",
            "text": "10/10 every time I come here I never want to leave! The food is amazing the staff is so sweet pricing is so reasonable and the vibe is just so feel good!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NEt1QlRBEAE",
            "text": "For years, this restaurant has been my go-to spot for me and my husband —not just for the incredible food, but for the way it feels like home every time we walk in. The moment you step inside, you’re met with warm smiles, a welcoming atmosphere, and a staff that treats you like family. They remember your name, your favorite dishes, and even check in on how life is going. It’s a rare kind of hospitality that makes dining here more than just a meal—it’s an experience.\n\nBeyond the impeccable service, the vibe is effortlessly cool. The music is always on point, setting the perfect mood whether you’re winding down after a long day or catching up to turn up with friends over dinner. It’s the kind of place where you can relax, enjoy great conversation, and soak in an atmosphere that feels both lively and intimate.\n\nAnd then there’s the food—consistently outstanding. Every dish is crafted with care, using fresh ingredients and bold flavors that never disappoint. Whether you’re ordering your tried-and-true favorite or venturing into a seasonal special, you can taste the passion behind every bite. The portions are generous, the presentation is spot-on, and the flavors keep you coming back.\n\nOver the years, this place has become more than just a restaurant to my husband and me—it’s a place where memories are made. Whether we’re celebrating something special, grabbing a quick bite, or just looking for a familiar place to unwind, I know I’ll find great food, great music, and even better company. If you’re looking for a spot with soul, this is it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnemVQWUZBEAE",
            "text": "This place is tiny but that is what adds to the charm and vibe to the place, solid Mexican food and if you are having dinner before 8pm they have happy hour on their 15 dollar drinks down to 9 dollars and they were delicious, i could have drank 10 of those mango margs. Great service and host they accommodated our large party and took great care of us. Would recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNXFHSmNnEAE",
            "text": "Overall rating: 4.8\n\nI wish this place was in Brooklyn! It was so far from me. I saw this place pop-up on my for you page and was very excited to try it. It looks very local and the everyone was so friendly. It is a small place and my friend and I probably only got a place because we went on a gloomy Sunday. We actually got the last table around 1pm, so I felt very lucky.\n\nWe started with the guacamole which oddly was just okay. It was missing some seasoning, but I loved my main meal. IT WAS SO GOOD. My friend got the birreria tacos and I got the Costillas Benedicto Benedict. The Slow braised shredded short ribs were phenomenal and paired with eggs, omg."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeHNHMFNBEAE",
            "text": "Amazing service , ambiance , food ! The strawberry lemon drop was perfect 😍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLUpHVXJRRRAB",
            "text": "My friend rented out the place for a Birthday brunch party and we had a place to ourselves. It was $85 a person and they did not disappoint at all. They printed out a gorgeous menu for us that was customized with the birthday girl’s  name, They helped us decorate, The host was the DJ And had that party lit the whole time. The food came out promptly on time, and the drinks were flowing. This was the best time ever and this small business deserves your support! Shout out, DJ Nasty"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfazhxNElnEAE",
            "text": "Incredible food and service. Our server was a sweetheart and got everything to us out on time with a smile!! 10/10 and recommend everyone to come. Vibes were uppp"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M0tHWXp3RRAB",
            "text": "Food was great, the service was phenomenal but the drinks!?! Yeoo the Tamarind & Butterfly Margaritas were hittttting"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOGJ6TGNREAE",
            "text": "This place deserves ALL THE STARS! The ambiance, the music, the food and THE SERVICE. WOW! This is my favorite place in the entire city. It’s family owned and these people do literally anything to make you feel welcomed. They make the best margaritas and the food is fresh and made with love. I was a regular before moving out of state and when I come back to NYC, I make sure to come back here a couple of times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa19pRFlREAE",
            "text": "Came all the way from dubai, and loved loved this place! Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueGFUbUpBEAE",
            "text": "Excelente restaurante, comida deliciosa muy variada, con opción de brunch todo el día, y con muchas opciones vegetarianas (y de todo tipo), amplia carta de cócteles y buen trato y servicio. Precio muy asequible en Manhatan. Pregunten por el patio interior, muy agradable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMWNfZmZ3EAE",
            "text": "Amazing food and staff! Been going for years and never disappoints!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaEt2aXhBRRAB",
            "text": "Order the Costillitas Benedicto and the Tampiña Mezcal and thank me later!! Love this place!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2R5bW53RRAB",
            "text": "Great service. Drinks and food are amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHMtci1BRRAB",
            "text": "Amazing food in a tiny place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyanBHckVREAE",
            "text": "Food was exceptional! They made their food with care… this is vegetarian nachos… unbelievably beautiful and delicious, AND nutritious. I’ve never seen this kind of any food…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMXN6VWlBRRAB",
            "text": "I am pregnant. I’ve asked for a food no spicy. The ladie told me that the food is not spicy. I’ve wait like 30 min to have the food on my table. And for my surprise the food was spicy. I’ve asked for another one and the ladie told me to have a plate faster than food.  So, she was like trying to decide for me was I had to eat because probably the chef doesn’t want to do another plate for me. And I said that i want another plate no spicy and she told me to wait more 30 minutes to have the plate. So I am very unsatisfied with the service. I don’t recommend this place for nobody else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2FfamJBEAE",
            "text": "Amazing on delivery.  ALWAYS order the cheese bread!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNTRiNU9nEAE",
            "text": "Amazing food, authentic Mexican cuisine! Highly recommend the coconut margaritas.  Everyone was so kind there too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMG9lekNREAE",
            "text": "I’m usually doing take out from here. The food is always great and delicious. You can’t go wrong with anything you order from here. I did eat here for Mother’s Day brunch and had a wonderful time. The backyard was set up beautifully. The staff are AMAZING, they are very attentive and quick. They were beyond great. They know how to service their customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbnRIM0RnEAE",
            "text": "The food and service was great. The space is extra small."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqN3BlV3NnRRAB",
            "text": "Cascalote Latin Bistro 2nd avenue, this is the number one stopped worker here . they can’t speak nice with someone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcElyRHFnRRAB",
            "text": "Great fish tacos, Al pastor and carne asada tacos. Friendly service and nice space."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5d18tWXBBRRAB",
            "text": "The music was diverse and always bangin, the food was so delicious (we ordered the guacamole and chuletas), and our server, Walker, was fun and made the experience fantastic. Definitely coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcWJtVnVBRRAB",
            "text": "First time and the food, atmosphere. And service is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkOWVPSVZ3EAE",
            "text": "The taste is delicious. Thank you for the dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNFBPYUhnEAE",
            "text": "I wish I could give them 6+ stars. Cascalote is so so good, it will remind you of your Mexican granny in the motherland 😋 — what can I say, 5 years of exceptional taste, quality and consistency. The day I moved to East Harlem, we fell in love. I didn’t even want to tell you, but it’s 2024 and I don’t gatekeep."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dXI2OHN3RRAB",
            "text": "Small, cozy atmosphere with yummy food and drinks. Guacamole was fresh, chips crisp. Chuleta al pastor amazing with its pineapple jam, moro and shaved brussel sprouts salad. The corn was yummy. I expected the maple maduros to be sweeter because of the maple but they were regular maduros which was still perfectly fine. Tamarind margarita and mezcal drink were perfect. I will definitely recommend and be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0OUszZ1VREAE",
            "text": "this place is amazing the food the service patsy is an amazing bartender and my waiter  Andre's was so nice and attentive can't wait to come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMHV1S0pBEAE",
            "text": "I stumbled upon a fantastic Mexican restaurant that I have quickly fallen in love with! I thoroughly enjoyed the food and have even visited this place multiple times.\n\nOne of the standout features of the restaurant  is the drinks, even though I don't drink.  Drinks lookS great as they passed by my table, and that's definitely a sign that the bar staff knows what they're doing! The restaurant has happy hour on Fridays from 1 to 8 PM, which is a great time to try out some of those delicious-looking drinks.\n\nIt's also worth noting that the customer service I received was excellent. The young lady who greeted me when I first arrived gave me some great suggestions for what to order, and all of her recommendations were spot on. This is a sign that the restaurant has a knowledgeable and attentive staff that really cares about the quality of the food and the experience they provide to their customers.\n\nOverall, I found a real gem of a restaurant that I definitely be visiting again in the future. I had great food, drinks, and service, and you're eager to spread the word to others about this fantastic place. If you're looking for a delicious Mexican meal with great drinks and attentive service, this restaurant seems like a must-visit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5OU9xaWlBRRAB",
            "text": "Phew this place was amazing. From the ambience to the food, this place is just a fantastic experience. I had doubts as I'd heard the food wasn't all that in the past, but that seemed to have changed for the better.\n\nThey set the outside dining area up perfectly, with each table next to heat lamps, in a perfectly dimmed environment for an intimate, yet lively setting matched with the music. This definitely reminded me of my own restaurant adventures in Spain.\n\nThe bread was crunchy and had great texture, with the dip accompanying it being splendid.\n\nA veggie wrap was ordered and it was the best one I've had in my life. The sauce made it all the better and the food thus far was ridiculously easy to scarf down.\n\nThe tuna sampler on bread had great flavor. Smoked uncured salmon with caviar was delicious and had great texture like some of the other dishes.\n\nRoasted pepper with sauce was unique and exploded with flavor. The sauce for the Spanish tortilla was fantastic, but I probably wouldn't order the actual dish again. Just an omelette, nothing special, but still decent.\n\nThe shrimp here is smokey and perfectly cooked.\n\nWill definitely come here again in the future."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX3ZYNTlRRRAB",
            "text": "Great spot for some Latin cuisine. Neatly run by a family, who take a lot of pride in their dishes and service. We randomly found this pace and first appearances were very comforting and it attracted us right away--it was a Sunday and we…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMS1TajlRRRAB",
            "text": "Best Latin food I’ve ever had in my life. I’m not exaggerating and this is not sponsored. I always look forward coming here. Most outstanding food, amazing drinks, great vibes and music, as great staff. PLEASE COME HERE! Worth every single penny if not more."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURna01ITlJ3EAE",
            "text": "Went here for a brunch with my girls and had a great time. All of the food was delicious although it did take a while to come out, but it everything was fresh. Highly recommend if you are in the area! I also had a piece of their flan, which I normally don't like but theirs was delicious"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcFA3N0ZnEAE",
            "text": "5 stars across the board! Drinks, food and service were all fantastic! love the people who wait and host, and the food was phenomenal! we ordered the mussels which were a special and could not get enough! for mains we had the paella and enchiladas, both were SO good. the verde salsa is spicy in such a good way, not overbearing. the paella had so many well cooked seafood pieces. it may be a bit pricy but 100% worth every penny! we’ve decided to make this our weekly happy hour spot. it’s that good!\n\nUPDATE: After this first experience 2 years ago, we have been coming back to Cascalote religiously. We have brought everyone we know, and we celebrate all kinds of milestones here, it is truly a special place for us now! The food remains top notch, the drinks continue to be fantastic (try the coconut mojitos!), and the family that own and operate are incredible people.\n\nOur fave items: Chuleta Al Pastor, any of the nachos - they are the best I've ever had, enchiladas with slasa verde, and any of the tacos but especially the fish tacos"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeUlDM1V3EAE",
            "text": "This was one of the best eating experiences I have ever had in my life atleast in New York. Everything I tasted was perfect and beyond. I’m a foodie so I don’t say this easily. The food tasted fantastic and felt soulful. The family that…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZLThfZWpBRRAB",
            "text": "There’s great food in East Harlem and I’m adding Cascolate Latin Bistro to my list of favorite spots. We poked our head in the door midday to see what was going on (the place was packed) and the waitress came out to us to see if we were hoping to get in. She was so friendly we told her we’d be back and five hours later we were!\n\nThe same waitress, Rose, was there and she and the other waitress made a dynamite team. Both very lovely and helpful and were completely dedicated to making sure the we loved it and everything else about the restaurant too.\n\nTo drink, we ordered the Michelata and it was unbelievable. Made with cucumber, Chamoy sauce (a sweet, spicy and savory sauce) and served in a glass dipped in Mexican candy, it’s like no other Michelata I’ve had before. We ordered seconds and I had to watch them make it to grasp how the ingredients came together with such perfection!!!\n\nWe ordered nachos, steak fajitas, the Brussels Sprouts with chorizo as well as the sweet corn and the corn with cheese. We totally over ordered but it was all so so good I have no regrets!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwX3NlMmt3RRAB",
            "text": "What a delcious find 😍😍😍!!! This place is so cute! It is also authentic and delectable. A husband and wife run the kitchen and if their love is what makes this food so good, I want them to show me their ways. The service and decor are great too. I mean they have an art piece of SELENA on the wall!…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMzlyWndnRRAB",
            "text": "This place is awesome! Quite the hidden gem with a beautiful story to follow. It is owned by a wife and husband who cook every plate and leave their daughters to host and serve their guest. Their cuisine is a conglomerate take on…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJa3V5eDNnRRAB",
            "text": "Came here for brunch on Sunday morning. The food and drinks were delicious! The sangria glass was filled to the top and the meal was satisfying. We each had the tres leches pancakes, and agreed that they were great! I’d recommend this place to anyone looking for a great brunch in East Harlem."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbTRUMGxRRRAB",
            "text": "This place has amazing food. It’s very small and cozy. Seats only about 20 people. Prices are reasonable though little bit higher for the hood, but worth every penny. Everything I have eaten here just taste very good. And the owners and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteEtHeVdBEAE",
            "text": "Beautiful brunch with friendly service!  We had the tres leches pancakes and chorizo, fantastic polenta and perfect sweet plantains.  Welcome to Spanish Harlem!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMGV6N0d3EAE",
            "text": "Great little hole in the wall with a quality latin inspired menu. Intimate seating and great service really makes this place feel like a boutique restaurant. Will definitely be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcXBiM0lBEAE",
            "text": "This was second time here. My first time was back in 2018 with my family. Second time was recently but it was a disappointing experience. My wife ordered the chilaquiles with shrimp which it was dangerously hot (no jokes). We had to ask for a separate bowl to cool down the temperature. The salsa was overpowering and it lacked le Mexican sabor. It was almost like a soup that was put inside of a microwave. Unimpressed."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcE5QQmNBEAE",
            "text": "This place has a grade pending...  That should have been a warning to me, but we went anyway, and I got so sick that night...  The food was good, but the prices were pretty steep and it obviously had a few violations that ended in a bad night for me."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bVkzVi13RRAB",
            "text": "We had an excellent brunch. The braised short rib chipotle poached egg withHollandaise spinach on arepa and a side of plantains.  Just incredible.  So good."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbmQyUEpBEAE",
            "text": "I loved this place! My husband had been telling me about this spot for a few months now and we finally decided to check it out tonight! Dont regret it at all! Their nachos are perfect! Tastes just like home and have a very authentic taste! Will definitely go again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybmJha1JBEAE",
            "text": "Cascalote is not only the best Mexican food in Spanish Harlem, but they make the BEST burger youll find uptown!\nThe entire menu does not miss, theres no wrong choice. The chef cooks from the heart"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnenI2cjF3RRAB",
            "text": "Great food and service! We loved everything we ordered."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeExQUkhREAE",
            "text": "I was in New York this past weekend visiting a friend who insisted we go to Cascalote for dinner. When we got to the restaurant it was full (it’s a fairly small space with about 7 tables). We asked the hostess if we could leave and come back because we were going to my friend’s place ten mins away. She said yes and agreed to call/text when a table was ready. Over 30 mins later my friends and I decided to walk back to the restaurant because we never got a call or text from the hostess. Unfortunately the restaurant was still packed with new diners. The hostess said things got crazy and she forgot to call us. It ended up being another 20+ minute wait, where we awkwardly stood by the door watching diners and willing them to finish and leave. When we were finally seated the hostess was gracious enough to give us guacamole on the house (and oh boy was it amazing), the food and drinks were well worth the wait! I’d go back definitely, but next time I’ll just wait for a table."
        }
    ],
    "reviews_count": 71
}