{
    "name": "Vinatería",
    "place_id": "ChIJJSi1DBT2wokRGHCDOA6nQ2U",
    "grid": "MN11",
    "address": "2211 Frederick Douglass Blvd, New York, NY 10026, USA",
    "rating": 4.5,
    "user_ratings_total": 959,
    "phone_number": "(212) 662-8462",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd00wdHRWVEJWV0ZkUVVtUk9NRkpSTUVSUWQwRRAB",
            "text": "This is one of the brightest gems among many in Harlem.  What a nice place for a cocktail or a quiet dinner.   We enjoyed the “Thyme of Your Life” gin cocktail.  Tasty sides and dessert to share.  We had the carrot and Brussels for side and flan and gelato for dessert.  All good.  Recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZk0yWlRRelZrUmt0d04wUXlaVzAwZVZwS2FuYxAB",
            "text": "Food was delicious! We had Brussels Sprouts and black seafood pasta. I remembered the pasta a bit too salty to my taste when visiting last time, but this time the pasta was perfect! The space inside is a bit tight."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa2JFNVJMVGt3Tm5Sak1tVTBVVGRQZGpCeWVIYxAB",
            "text": "Love this place! Food is amazing, staff warm and professional. Superb!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMWJrcFpXbGhUWVVWSFRqSkVia2x6Vkc1b2IwRRAB",
            "text": "One of my favorite restaurants in Harlem and it never disappoints. The black spaghetti with seafood is out of this world. The duck appetizer is to die for. I didn't photo the black spaghetti this time it was my to-go meal but I had the black ravioli with lobster for dinner. Not as good as the spaghetti and needed a couple more pieces but was tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRFQyMDViM2xoUTJoalFVVnBNak5hWVhjek4zYxAB",
            "text": "We were very excited to try this restaurant that a friend recommended us. It was indeed a really nice restaurant and the food was good especially the oysters and the black spaghetti with octopus. The service however was not great.\n\nOur server never came to take our order. She was asking everyone else around us if they were good except our table. Someone else brought us our drinks and the manager took our order. Never experienced anything like this. At the end finally she approached us to ask if we wanted to order dessert. I asked her can you tell me who is our server because we are so confused who is supposed to take our order and she said “anyone can take your order” with a really bad attitude.\n\nWe just decided to leave. My girlfriend felt that we were discriminated because we were the only Spanish people in the restaurant. It was very unpleasant, she should be retrained on how to deal with customers."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM2RURklXRFIwU0RSdVptbFNWbnBsWm1ab1ZuYxAB",
            "text": "Came here for lunch with friends who were visiting me uptown from DUMBO and was so impressed with the service as the friendly staff realized very quickly how tricky young children could be.\n\nThey accommodated them with an awesome pasta customized to their liking while the adults had our steak frites, huevos rancheros and lamb ragu pappardelle. Sat outside and enjoyed the nice day and weather on Frederick Douglas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVGVWWjVWV2MxUVVVdFJIUk1WM0ZZVGpaVU0yYxAB",
            "text": "A great local brunch spot offering delicious dishes with affordable prices. Brunch deal included a drink. The outdoor seating might not be best option during the summer. Indoors can be a bit loud with all the dinfer conversing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVWJHdE9WMHN4V0ZCSVVWQmtNR053WjBocmJuYxAB",
            "text": "I’ve been in the restaurant business for 46 years. This place is unparalleled. When I worked at super fancy restaurants like Balthazar and Pastis we would do exactly what the whole house , From kitchen to staff to intent with the menu we would do Everything they do,so if you are deliberating, don’t. Run. Make sure to make a reservation cause they can get really super busy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFIzTTFhbTAyWTJwZmExOTZZbk5KWm5VMU4zYxAB",
            "text": "YUM YUM YUM!\nI was on my menstrual cycle and was hesitant to go outside.\nI caved and decided to just go out, it was my boyfriend’s & I’s anniversary .\nIt was absolutely amazing .\nThe hostess saved us a nice seat in the restaurant as we were celebrating - she was very kind.\nOur waiter was helpful and knew the popular dishes.\nWe got the Black Spaghetti . GET IT ! DONT QUESTION IT !!! I’VE BEEN THINKING ABOUT IT FOR WEEKS NOW. It was so savory and buttery. It did not stain .\nWe also got a beet salad and brussle sprouts which were lovely. The beet salad had vegan cheese which was a plus since I am dairy free. We shared everything and we were so satisfied.\nWe had room for dessert and the olive oil cake was everything I desired. Not too sweet and the perfect texture.\nPlease go! Do not hesitate"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR09YQjRZa0ZUU1RVd1ZGTmphVVJNYjFwNGQwRRAB",
            "text": "De los mejores sitios de Harlem. Ambiente, comida y precio. Todo increíble. Para repetir sin duda."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmFWRlhaR1ZhU1RoS1JUWk5iMHg0WldSRFprRRAB",
            "text": "Hmmm, sad to say it’s cute but a lot of misses here. First, was told only happy hour at the bar. The table next to us had a happy hour menu for whatever that’s worth. Food is ok. Agree pasta is so so and polenta fries more like columns of polenta cake. Wine selection was nice but we were heading there to try for the first time for happy hour so that was a bit disappointing. LOUD. Small tables all touching each other so they will pack you in and you will be jostled around. I wouldn’t go back honestly and surprised by 4.5 star rating. Sorry:(\nTo add to what others said- my son hit his head on the light fixture trying to get into the seat at the first table. It was so hot and stuffy we had to move- he hit his head again on it until I held it…"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQbk8wWVhqM2YtcEJREAE",
            "text": "Something went wrong this time. Be aware of chairs in outdoor area they have sharp metal edges my partner ripped out his shorts. Oysters were very fresh and tasty. Branzino was good too. Short ribs pasta extremely overcooked. Service is bad bad bad. Annoying old man not giving any second of privacy, no water service, check is been requested and waiting time was ridiculously long. Do i want to return? No way. I’ve had enough. P.S. Even if they are responded you here on google and asking you to send them email they never get back to you over email. Hahaha what’s the point? Idk.🤷"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYlg2b3ZvcUlQUXFBRRAB",
            "text": "Haven't been here in a long while but will be back soon.  Brussel sprouts were spectacular.  Black spaghetti always a fav.  Both Cod and Salmon were wonderful.  And service, especially the manager who more than made right a minor issue.  I wish more places carried a heftier white wine with more body and less citrus, but that's just my taste"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aVBYcVJBEAE",
            "text": "Great spot Bartender Berkin is very helpful and hold good conversation"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV2ZrSzJmNy1XRGdnRRAB",
            "text": "What can i say - The food and hospitality were PERFECT! Great vibes both from staff and other costumes dining. The place decor is very appealing to the eye.  The drinks were amazing. The staff were amazing! The location is amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd09QSGZREAE",
            "text": "This used to be my favorite happy hour spot, but after today, I won’t be back. I tipped what I felt was fair, only for the waiter to return 20 minutes later and point out the suggested tip amounts, after I had already paid. It felt rude, unnecessary, and completely out of line.\n\nThe manager apologized but didn’t do much to make it right. After years of coming here, I left feeling embarrassed and disrespected. Louis was out of line, and this experience was unacceptable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3RPU3pnRRAB",
            "text": "The food was exquisite. The tastes of the dishes, and even something as simple at the charred broccolini was excellent. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eE92N1VREAE",
            "text": "It was extremely hot and stuffy inside, and the tables are 2 inches apart - so close that you could smell all the neighboring table’s dishes. It was also very loud given the close quarters and size of the place. The food was tasty but the loud atmosphere was very hectic and unpleasant. They literally have to hold the overhead ceiling lamp when seating you so you can squeeze your way into the seat without knocking it over… and without disturbing the table next to you. The veal meatballs and the octopus were quite tasty but I would go during off peak dining hours to avoid the noise and crowds."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aF9MOF9RRRAB",
            "text": "This place is incredible! The pasta dishes were amazing (try the black pasta with seafood) and the atmosphere and service were awesome."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRekotTXFRRRAB",
            "text": "Maybe the best food in Harlam !  Great pasta, super steak au poivre and delish desserts .... and the place has a vibe... Vinateria also has a super interesting wine list that highlights female producers"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnNLZEtnEAE",
            "text": "A perfect spot for a glass of wine or a nice dinner. Cozy atmosphere with a great setup both inside and outside. Friendly staff and a great location. Plus, their bread and olive oil have a lovely Mediterranean touch. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRck1telNnEAE",
            "text": "I’ve been here twice for their happy hour. Once I sat at the bar and the next time at a table with others. In both instances the staff was attentive, service was quick and precise. The food was good in both visits. I really loved the croquettes. Recommend this place for any meal or if you can take advantage of their happy hour it’s a good value."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnck55ZGNREAE",
            "text": "All I can say is that this place is legit!\n\nGreat food, great drinks, great crowd, efficient + nice service, AND reasonably priced.\n\nVery good date spot. Will def repeat!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneHREc2VBEAE",
            "text": "Black spaghetti was really good . Grilled octopus starter is a must try. Service was friendly and attentive. Nice place for a quiet date and nice ambience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaW8zOUlREAE",
            "text": "Great happy hour specials on wine and select dishes. Get the brussel sprouts . Lovely spot to stop and eat in Harlem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcmZIcUx3EAE",
            "text": "The peppercorn steak sauce was too liquid not thick enough like I expected in a French restaurant but was cooked well"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBb2MzSE13EAE",
            "text": "We had a really great evening at Vinateria. Food was solid, service was great - especially the wine recommendations, and the atmosphere was really nice - both chic and warm, and not overly fussy. I’ll definitely go again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLS0tUXZ3RRAB",
            "text": "Vinateria is the kind of place that reminds you Harlem is one of New York’s most underrated neighborhoods. It’s chic and chill and blends a modern aesthetic with a warm, welcoming vibe. There is an understated cool here that doesn’t need to scream for attention because the food and atmosphere do all the talking.\n\nLet's start with the bar. It's intimate yet lively, serving up a full dinner menu without pretense. The bartender? Unshakable. Calm under pressure, navigating the packed house with effortless control that makes you trust he knows what he's doing.\nAnd then there is the food —because that’s what you’re really here for, right? The Bacalao croquettes arrive golden and crisp, delivering that perfect contrast of crunchy exterior and soft, flavorful salt cod within. The orecchiette with sausage and broccoli rabe is textbook perfection al dente, the sausage adding richness without overpowering the rabe's bitterness. Get that dish! And then, the star of the night: the whole branzino, deboned with surgical precision, put back together, head to tail, and stuffed with spinach; it was perfectly cooked, each bite melting into a delicate balance of flaky, sweetness, a dish that reminds you why simplicity, when done right, is unbeatable.\n\nAnd let’s take a moment for the complimentary house bread with olive oil. Yes, they still do that here. When did it become a forgotten luxury to be offered good bread and oil at the start of a meal? At Vinateria, they know the little things matter, and those touches make you feel like you are in on a well-kept secret.\n\nThe prices? Fabulous. Finding outstanding food at reasonable prices feels like a minor miracle in a city where a mediocre meal can drain your wallet. Add in the fact that Vinateria is Black-owned and Michelin-recognized, and you realize this spot is not just worth a visit —it’s worth the trip uptown.\n\nOh, and a quick nod to the bathroom: clean, fresh-smelling, and a bold, shocking red that somehow fits perfectly.\nVinateria doesn’t just deliver a meal; it delivers an experience — a delicious nod to why NYC remains a mecca for food lovers, where every bite tells a story, and the vibe is just as satisfying as the plate. Go!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdF9PVEJnEAE",
            "text": "Our friends suggested this little gem of a restaurant and boy are we glad they did! The restaurant is intimate, warm and charming. The hostess was professional, friendly and welcoming.\nThe wine list is impressive. We asked for a recommendation and they offered us tastes of three different bottles. We have never experienced this type of generosity in NYC when ordering wine.\nWe ordered the octopus appetizer, which was out of this world, and the black pasta with seafood, which was the best pasta dish we have had in NYC in over a year. Our friends ordered the octopus appetizer and were equally delighted. They ordered the salmon and said it was outstanding.\nThe waitstaff was great. They are knowledgeable, accommodating and willing to respond to any question we had. Don’t hesitate to ask your waiter to tell the story about the owner, her passion for wine and dedication to bring a great restaurant to her childhood neighborhood.\nWe hate recommending this restaurant to others because we do not want the competition when we return! But in fairness everyone should know about this delightful little gem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNF8yMDVnRRAB",
            "text": "My gf from out of town, and I went here for brunch last Sunday. We hadn't seen each other in a while and had a lot to catch up on. Vinateria was the perfect place. We both ordered  the French Toast with a side of  bacon. It was delicious.  The man who waited on us was attentive but not pushy and very funny. There was music playing, but it was truly in the background and didn't get in the way of our catching up. I can't wait to go back. You should too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaHVUXzV3RRAB",
            "text": "This place makes me want to move to the neighborhood and go every week. Cozy and cute vibe. Amazing and attentive service (thank you Spencer). Interesting wine and cocktail list. And delicious food. I have a gluten allergy and my friend is also gluten free and there were so many options. They have a gluten free pasta that isn’t listed on the menu. We had the rosemary lamb ragu and the orecchiette which were both amazing. I want to come back and eat everything on the menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcW91SHlBRRAB",
            "text": "The bacalao croquettes and polenta fries were sooooo good. Will definitely be back for more.\nThis is a cute, neighbourhood spot with great service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcTZDdXB3RRAB",
            "text": "Exceptional food!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MHVDM1h3EAE",
            "text": "Let me start by saying that we have been to this restaurant quite a few times and we have loved it. I know we are in the time of holiday parties, etc., but it was just a disappointing evening.\n\nThe maple old fashioned was great on the fall specials menu.\nThe blue point oysters on the specials list were not great and I had to return them. I don’t write reviews and I seldom send food back to the kitchen.\nThe New York Strip if you’d call it that, looked boiled and was loaded with fat. There was no rendering, or care to the dish. I had to send it back in place of the branzino, which tasted fine. It just needed a bit more flavor.\nMy husband ordered the short rib mafalda, which was delicious. The octopus was good, but the portion size was quite small.\nThe manager? Host? Maitre d? Was attentive, but our drinks went without being offered another round. Overall, it was by far the worst experience we have had in this typically lovely space."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N0tlYzl3RRAB",
            "text": "Went today for brunch with friends, ordered the Eggs Benedict.\nFor those who cannot eat Cilantro!! It should be noted on the menu. I could not eat the meal, and the waiter just shrugged it off, ( not in a bad way ) even though he saw I left it on my plate and should have offered an alternative dish."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQblBQR0NBEAE",
            "text": "Food has been on point since they opened ways back, the regular dishes like the ragu and octopus continue to be killer, as does the house bread. Management and service are always on point - one of the few places around the neighborhood that has a true place in my heart. Highly recommended for events or a nice dinner alone at the bar. My wine friends also think very highly of the list, but great cocktails too."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdEtPMzh3RRAB",
            "text": "Great food.  Amazing taste and good portions.  Dessert is a little bit underwhelming but the black spaghetti is so good.  So many scallops."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdk5IczNnRRAB",
            "text": "Placed an order through delivery on Grubhub around 2:30 pm to find out at 4 pm after calling four times that they could not make my food. If my food could not be made it should have been communicated to me earlier rather then me waiting over and hour and having to reach out first to find this out. The only thing i was told is they yes it’s there fault because they haven’t updated their Grubhub. Which i understand but a simple message or call to let me know the order couldn’t be placed could have avoided this bad review and terrible experience. Then they proceeded to not cancel the order on Grubhub so that i can get a refund i had to reach out to Grubhub personally. This review isn’t to take away from the food, I’m sure it’s great but the experience with them has left a bad taste in my mouth."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubFA3R0hREAE",
            "text": "Yesterday, my husband and I visited this place. We're neighbors and live nearby. We ordered two pasta. The black spaghetti with seafood was tasty. However, the pappardelle with lamb ragout was not good . The lamb ragout was just ground meat, without spices, and it was simply sour. I hoped dessert would change things, but unfortunately, my chocolate mousse was with garlic! The chef must not have cleaned the knife properly, and it ruined my dessert. The waiter said he would remove it from the bill but forgot. Overall, it wasn't a pleasant experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3FPTTRBRRAB",
            "text": "Great lamb. My wife agrees. The tiramisu not so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYenFIdzVBRRAB",
            "text": "We always visit this place, the owner is nice, the food is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb0plRW1nRRAB",
            "text": "I’ve never had a bad meal here, the food is great. The service is great. The atmosphere could use a little bit of sprucing, it looks outdated and not so current."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdTl1dUNBEAE",
            "text": "The fries weren't good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdkt5YjVRRRAB",
            "text": "Go have a beautiful time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN2IyaURREAE",
            "text": "hours aren’t right. don’t go out of your way unless it’s after 5pm"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIN2J6TEhREAE",
            "text": "Arrived here early this Saturday morning. Was surprised and happy to see a ton of outdoor seating options. Picked a heated pod to dine in. Service was okay, the waiter came out pretty infrequently but more frequently as we came in to request things.\n\nI had the orange saffron pancakes which i thought were quite good. My girlfriend had the shrimp polenta, which was a bit under-seasoned.\n\nThings took a turn for the worst when she bit into a shrimp, chewed and immediately spit it out. It wasn’t cooked, she went inside to tell the waiter what was wrong and was told to come back in two hours when the manager was there, by an older woman dining? V strange experience.\n\nI’ve had exceptional takeout from here and was excited to dine in but unfortunately my girl now has food poisoning and I’m spending my only day off this week with her in urgent care/the bathroom 😵‍💫.\n\n(Just an update, they have since then apologized profusely and actually refunded all of the food that day)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdkpyNGh3RRAB",
            "text": "Increíble gem in harlem , thankful to have it around for meeting friends , having parties and enjoying great food in a warm environment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINklyMkV3EAE",
            "text": "We happened past this restaurant on the way to a neighboring place. The Grilled Octopus and Bacalao caught our eye, but other items on the menu were also interesting. We decided to stay and seated ourselves at a sidewalk table on this early autumn evening at 8 PM. It was comfortably warm. The restaurant was bustling, a signal that it must have a great reputation.\n\nFrom the beginning, the service was impeccable. Our San Francisco native waitress, new at this restaurant, was incredibly accomodating and attentive. We decided to enjoy two appetizers each.\n\nThe Grilled Octopus was the standout. Incredible would be an understatement. It was served on a bed of calamata olives caramelized fennel, grilled cherry tomatoes and capers. The Octopus was perfectly grilled, charred and tender, not overcooked.   I could have consumed two and been in nirvana.\n\nWe also tried the Bacalao which transported us back to Portugal. Crisp crust and soft center of cod, dressed in a sauce remoulade.\n\nThe third course was steamed mussels in a Chimichurri broth. The dish was trimmed with crisp Sopresetta and sun dried tomatoes. It was a tasty combination but the mussel meat was rather small.\n\nThe fourth dish was grilled Duck Breast cooked to medium rate and served with pickled onions and crisp pancetta. The dish was tasty but small.\n\nWe also shared a plate of grilled asparagus which were delicious. The slight char gave these al dente spears a smokey taste which was complemented by a hollandaise dressing\n\nWe shared two desserts, Tiramisu and Creme Bruleè, both trimmed with summer berries. Both desserts were sinfully good.\n\nAs one would expect, a Vinateria like this had an extensive wine list. We both chose a St Émilion by the glass. The glass was generous portion and the wine steward/manager opened a new bottle for us. It was the perfect accompaniment to our dinner. We could have paired each course with a different wine, but that would have been too much alcohol.\n\nThis restaurant was bustling even at 9PM when we finished. The outdoor seating conveyed an enjoyably upbeat neighborhood vibe that complemented our dinner.\n\nOur meal came to $110 plus tip, a good value in New York City.\n\nIf we lived in the neighborhood, this would surely be our go to place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOTZmUkV3EAE",
            "text": "Place is lovely, food is awesome, prices are affordable. I had the bacalao croquette and was one of the best croquettes i ever had. The fried polenta was delicious. Fried fish and octopus was fresh and tasty. The squid spaghetti y the chefs specialty and was one of the most delicate things I've tried. I enjoyed so much the food. Definitely will go back  again 🫶🏻🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcV8zUndBRRAB",
            "text": "Such an amazing restaurant, lovely food and very friendly people. 🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5M0xHVHN3RRAB",
            "text": "I recently dined at Vinateriá and I must say, the food and service were absolutely phenomenal. From the moment we walked in, we were greeted warmly and seated promptly. The menu offered a variety of authentic Italian dishes, and everything we tried was delicious. The pasta was perfectly cooked and the sauce was rich and flavorful. The service was attentive, friendly, and truly made our dining experience exceptional. I would definitely return to this restaurant in the future and highly recommend it to anyone looking for a fantastic Italian meal. 5/5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyX3Q3T1R3EAE",
            "text": "Came here with a group of 3 and had a reservation so it was easy to get seated immediately.\n\nGood:\n- Omg the free bread was great - focaccia bread\n- Good intimate dinner vibes\n- The food all came out so quick!\n- Polenta fries were amazin, good crispy texture\n- Mushroom appetizers were savory and sweet\n- Ragu was tasty and very well portioned\n\nBad\n- it’s on the expensive side\n\nOverall I’d come again! This place was impressive in vibes and in service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3a05hSnpnRRAB",
            "text": "They were very welcoming our server was very nice and the food decent. I went for happy hour I wasn't impressed with their happy hour menu but overall the place had a nice vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLU9xSklnEAE",
            "text": "I am beyond impressed with this restaurant. Specifically, I was super impressed with how attentive their outdoor staff were for the private dining \"pods\" as well as how good the happy hour specials were. My friend and I split some oysters, mac and cheese, brussel sprouts, these little fish ball things which were super good, and some veal meatballs. This is definitely going to become1 of my regular outings for oysters. I highly recommend this gem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdWZia1ZnEAE",
            "text": "When we arrived for our reservation time they sat us right away. When seated we were given bread for the table.\n\nAMBIENCE\nWent on a Friday at 8 left around 11 pm and the restaurant never really got full inside, but our door seating seemed at capacity.\n\nWonderful indoor and outdoor seating.  This is definitely a date night spot OR a nice place to go out and have dinner with friends. I’d recommend you be dressed nicely since that seemed to be the overall vibe.\nThere were many couples throughout the night.\n\nFOOD/PROS\nEverything we ordered was delicious! The food ordered included:\nlamb lasagna\nlamb chops\nroasted half chicken with mashed potatoes and spinach\nBronzino stuffed w/ spinach\n\nDrinks were good too!\n\nCONS\nOnly complaint was slow service. Drinks took forever to come even ordered and there only seemed to be one waiter for the inside and outside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aTVuZTBBRRAB",
            "text": "Came here for happy hour and we don’t regret it. The food was excellent and the staff was great.\n\nFor drinks we had el matador, which was amazing. The Thyme one was okay.\n\nThe COD croquettes were exquisite, Brussel sprouts 10/10, the polenta fries were different but delicious. We could have done it without the veal meatballs - they were not our favorites. And we also got the chicken, but took it to go. It was plenty for 2."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aUptQ1BnEAE",
            "text": "This location is in my neighborhood, and I never entered. We decided to go in and chose to sit in their outside seating.  We ordered calamari and could not taste the calamari because you only tasted the dirty oil. I began to get nervous the entrée would be the same. Fortunately, it was not. The lamb chops were thick and juicy. The sea scallops with brussel spouts yummy. The dessert was to the next level. The service was good and quick. The food is the seller here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab3V1ZDBBRRAB",
            "text": "We had a 6pm reservation for 11 of us and I arrived about 30 minutes ahead thinking that the parking would be difficult. I was pleasantly surprised how easy it was to find parking.  We were seated right away by a very helpful gentleman who took a wonderful picture of us outside the restaurant. The service was outstanding and the food was very tasty.  Great job."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeXVmVzJRRRAB",
            "text": "I wanted to really like this place. We ordered 3 appetizers and they were just okay. All had the same dipping sauce (that was disappointing) and were bland. Our main dishes looked better than they tasted. But what really has made it so that…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5d2RQVEF3EAE",
            "text": "It was too dark I could barely see my food. I got the spinach lasagna, it was unlike any lasagna I’ve had. It was mainly just melted cheese, the lamb had little flavor and the noodles were few. Honestly no one at our table was impressed by the food, taste nor quality. Great bread."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCenZUajJnRRAB",
            "text": "I went here for my birthday, a friend recommended it as an option. I had always seen the restaurant, but for some reason I had never been there yet. I loved the atmosphere, the decor (even from the outside), I always admired the quaintness of the place. For starters, we had the steamed mussels and calamari, I ordered the Black Spaghetti as my main, (it was amazing!), and I had the tiramisu and creme brulé for dessert .. because it was my bday and I deserved both haha! I also had the \"Catching Feelings\" cocktail... Everything was great. I can't wait to go back! The service was great, we got there a little late but the staff were very accommodating and made it memorable and a pleasant experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObjVIOFF3EAE",
            "text": "Date Night, Anna was my host. She was very sweet and attentive.\n\nAtmosphere: Calm, slightly romantic. It definitely gets crowded and busy. Slightly tight to move around.\n\nFood: Veal meatballs were amazing. Smooth , light, the sauce was amazing.\n\nPolenta fries were slightly salty\n\nBacalao Croquettes were amazing !! Very light, crispy moist in texture.\n\nDrinks: Matador - I ordered 2 and baby I almost made a baby lol."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcHRMVm9nRRAB",
            "text": "My absolute favorite restaurant! The lamb chops melt in your mouth like butter and the calamari is DIVINE! The cheese plate appetizer has the best stilton on the planet!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNzRhY09nEAE",
            "text": "Was able to make a same-day reservation for a table during happy hour. We enjoyed the bacalao croquettes and veal meatballs (which were discounted for happy hour) as well as several cocktails off the extensive list. The menu featured a nice assortment of both classics and house recipes, and I especially enjoyed my Sazerac. The wine list features some nice selections by the glass, all of which are very price-accessible. It was very loud and seemed a little chaotic inside, despite there being several empty tables. The service was decent, though it did take awhile to get our drink orders as the bar area was very busy and only two bartenders were present for the time we were there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX1p6clNBEAE",
            "text": "Came here on a Saturday evening.  We sat outside since it was so warm out.  Outstanding hospitality!!!\nTom was extremely helpful as our server was so busy for a private event inside.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMklHLXJRRRAB",
            "text": "Three of us had dinner at Vinateria on Sun, Nov 12/23 - reservation was for 4, but we had a last-minute cancellation. While the restaurant was busy, it wasn't noisy so we could actually have a conversation! Service was attentive; portions were generous; and food/beverages (Formaggi, Black spaghetti, Spinach lasagna, Burrata e prosciutto, Farro salad & Creme brulee; Cava, Pinot noir & Botanical cider. Crusty, moist bread that we received shortly after being seated was also wonderful) were delicious. Pictures here don't do the food justice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbjRmQ1BBEAE",
            "text": "We found this restaurant online based on the ratings we got on google maps.\nWe order  fries and Calamari for appetizer and Chicken and a pasta for main dish.\nThe appetizers were good and it tasted fantastic. However, we did not like our main dish. The dish did mot have any salt and the taste was a little bit weird.\nIt was our first time trying this kind of food. Also their menu was either french\n, spanish or Italian which was not helpful\nWe had to search everything"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbTZtZ25BRRAB",
            "text": "The cocktails were pleasant to look at it as well as to drink. The braised short ribs were so good! They were very tender and so filling! My friend has the black spaghetti and ate it so fast. Really great place to go sit outside and enjoy the sites of Harlem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eHNuRUdBEAE",
            "text": "Great happy hour food and drink options (loved the bacalao croquettes and the polenta fries). The mafalde short rib ragú was tasty though had little pasta and a little too much meat. It can be quite a wait even with a reservation though so be prepared for that (especially for outdoor seating)."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobUxYZGN3EAE",
            "text": "Vinatería has really nice food, worth the visit! Make sure you get a reservation or go get on the list early because it can get busy on the weekends.\n\nTo be honest their food is delicious, fresh, and perfectly cooked. We tried the BACALAO CROQUETTES (COD) (x5), definetely a must they taste so fresh and the bechamel is really good, the PAN SEARED BLACK SEA BASS (over a mushroom risotto base) and the BLACK SPAGHETTI. They also have complimentary BREAD with olive oil and balsamic. I was feeling like having a red, even with seafood, and I tried the red wine Château Biac, it was a very good choice, the pours were large ;)\n\nESPAÑOL:\nVinatería tiene una comida increíble, merece la pena la visita! Asegúrate de hacer una reserva o ver con tiempo para ponerte en la lista, puede estar bastante lleno los fines de semana.\n\nSinceramente, la comida es deliciosa, fresca y perfectamente cocinada. Probamos las CROQUETAS DE BACALAO (x5), una apuesta segura, sabían muy frescas y la bechamel está muy buena, además probé el PAN SEARED BLACK SEA BASS (sobre una base de risotto de setas) y los BLACK SPAGUETTI. Sirven pan con aceite de oliva y balsámico muy rico y gratis! Me apetecía un tinto, incluso con marisco, y probé el Château Biac, una buena elección, la copa estaba bastante llena ;)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eV9xV1h3EAE",
            "text": "One of the best restaurants I’ve been to in NYC! From the cod to the burrata to the steak and monkfish, every dish was a can’t miss dish. To top it all off, the olive oil cake was to die for and the word on the street is the tiramisu was…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzLWEydUxnEAE",
            "text": "This is an amazing restaurant. Great food and better service. It’s a very intimate restaurant with the low light setting. I’ve gone here for drinks with my wife during the day and a few times at night for dinner with the fam. My kids love the food. Food is always tasty and fresh. One of Harlem’s best restaurants hands down."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheVpDWk53EAE",
            "text": "My friends and I had an overall lovely dining experience here! The Happy Hour cocktails were delicious (our favorite was the plum fizz) and we were also impressed by the appetizers (especially the bacalao croquettes). In terms of the entrees, the rosemary lamb ragout tasted phenomenal, and so did the pork belly wrapped scallops and brussel sprouts. You could tell that they put a lot of thought into the menu offerings.\n\nThe only disappointment was the salmon dish with carrots and farro. The salmon had a lovely crust on it, but the dish itself tasted very bland and definitely lacked salt and some other spices — I had to ask the waiter to bring salt to our table, which I almost never need to do. I think the cook just missed the mark on that particular dish that day. Regardless, everything else was so delicious that I plan to return here again in the future."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvLXNxTUh3EAE",
            "text": "A Michelin recommended restaurant with a diverse brunch and a traditional dinner menu. Vineteria serves seemingly gourmet dishes for affordable prices. I highly recommend the ink pasta with octopus—it’s fantastic! Much like neighboring…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNzRiUUh3EAE",
            "text": "Salmon was delicious. Had to swap the accompaniment for dietary reasons. Loved my cocktail. Service was good, an almost perfect dining experience."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdktyT3NRRRAB",
            "text": "Overall I like this spot and would love to try it again. Service was initially very slow, meaning they didn’t even get us water. Eventually it was all pretty good, enjoyed my meal and ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MXZESzR3RRAB",
            "text": "A very consistently delicious restaurant that’s been my go-to Italian spot in the area. The staff is great, food is great, and the atmosphere is perfect for dining with a group of friends or a date!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdHNhTlJ3EAE",
            "text": "The server service is usually great, but tonight was a little slow. The food was what it always is....great! Oysters A+, and 1st time having the branzino fish and it was spectacular."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cTRDZGJnEAE",
            "text": "Delicious food. Quality specialty cocktails. Fantastic service. Wonderful and warm outdoor dining. Come here anytime and if you like happy hour you won't be disappointed. Great food and drink selection at affordable prices."
        }
    ],
    "reviews_count": 79
}