{
    "name": "El Kallejon",
    "place_id": "ChIJKUnbfQj2wokRUvzwYGqTBQI",
    "grid": "MN11",
    "address": "209 E 117th St, New York, NY 10035, USA",
    "rating": 4.6,
    "user_ratings_total": 423,
    "phone_number": "(646) 649-4795",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaldIWXliell6Y2tkSFNtaGtRMTh0WTFGcGFtYxAB",
            "text": "Best place in NY!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSmMwWmhVVTB5ZW5wUWRXdHVjVUp0TWpWck5YYxAB",
            "text": "Lively, great food, home like ambience and friendly staff make this sweet spot in the heart of East Harlem an excellent place to share with friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFNWUTJPR3RrZFVObGNsTldSMjl5WkdkUFFsRRAB",
            "text": "We had a great time here, everyone enjoyed their food. They backyard decor was so eclectic and fun. I had a vegetarian dish that was soo good, cheese and zucchini I dont remember the name. Everyone enjoyed their cocktail and their meal. We also got a dessert which was tasty too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M1YyODJhVk50ZDFWWFVEWkdiUzE2Y0RZMlgwRRAB",
            "text": "The ceviche and fresh tortillas were such a treat. The flavor profile was balanced and absolutely delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbk5HbGlVMmhtTTNoMGRGODRkMWw1V0ZwWFUxRRAB",
            "text": "El Kallejon and Chef Nestor deliver exceptional quality and taste. I highly recommend this restaurant to anyone seeking genuine Mexican cuisine made with passion and skill."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dFlYQmZZM3BIUVRsNFRGRnNaMHN3WWs1NloyYxAB",
            "text": "Excelente comida, una vision freca y innovadora de la gastronomia mexicana, cocteles deliciosos, un ambiente increíble, y el servicio 5 estrellas."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMjR5VERREAE",
            "text": "The managers got us into a dancing mood. Surprised to see huitlacoche on the menu and enjoyed it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbmFUQm9WWFJSTkZjeVdrNUdjbFJ1UmtOd1QwRRAB",
            "text": "Wonderful drinks, great wait staff, food is exquisite, and being serenaded by a beautiful girl doesn’t hurt either!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeGExQTRXVWN5ZUVORWRWaGlWamx4VFRCRE5FRRAB",
            "text": "✨ El Kallejón – East Harlem Gem ✨\n\nEl Kallejón is an absolute must in El Barrio for authentic food and artisanal drinks. Every detail is so thoughtfully curated—from the incredible menu to the welcoming atmosphere and lively vibe. We were lucky enough to enjoy a live band and be seated in their gorgeous backyard, which made the night feel extra special. The amazing owner personally attended to us, and the staff made us feel so cared for the entire evening. Every dish and drink was absolutely delicious, and the experience as a whole was unforgettable. We can’t wait to come back! 🌟"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONE56QmhSSFprWTA5algzQkpWVlJSWmxscFdYYxAB",
            "text": "Love this place. The food and ambience transported me to Mexico."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaVoxa3RkVnBFZWpFdFpIWjRNVkpPWlRSUmJuYxAB",
            "text": "One of the best Mexican places in Harlem. You feel like your are in CDM."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWE5WbHRTVUp3WnpjMFVXWnFVQzFZTjNnelJHYxAB",
            "text": "The most amazing mole! every part of this place has so many memories and stories! Thank you Nestor for sharing your story. Please support this community business."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWVJ6VjBhRXd4UVVoTFpsQTVXRlpVWlVodFpXYxAB",
            "text": "Absolutely amazing food and an incredible owner. The most delicious Mexican food I’ve eaten in the city with the kindest folks! Must go!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzbnBtZDFBRRAB",
            "text": "Every time we dine at El Kallejon we are delighted with exquisite botanas from Mexico. The cocktails are great and the desserts too. The ambience is very cozy and decorated with art and colors from different places of Mexico. You can enjoy dinner with your friends and family. My son enjoys eating shrimp tacos, chilaquiles and churros. I enjoyed as well every signature dish and every artisan craft cocktail from El Kallejon. Also, El Kallejon hosts every year a Day of the Death Event where you can celebrate this tradition with music and folk dance. El Kallejon is a piece of Mexico in East Harlem. Nestor, chef, and owner is friendly and humorous. He describes his passion for his culture, food, music and traditions. Visit el Kallejon in East Harlem."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeFpGRnpSbnBoY0ZsVGRXRmpTV3R5TUdSS01uYxAB",
            "text": "Delicious delicacies, great music, warm and friendly host. Super cozy and very beautiful art and folklore collection. I’m making this my neighborhood spot!\n\n<3"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMWRDMUphRnAzZURsNGNuVmxMVWhVYlhwSFNrRRAB",
            "text": "Avoid it! It is one of the worst places I ever been in my life ! You will not drink what you order. You will not eat what you order. And at the end you will not asking to pay what you order. Take a good amount of time to found what we must pay. Dealing with the drunk owner. I really feel bad for the 2 worker ladies who dealing with that mess."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NFdsbDFNa1ZhWlRsb1lXNVNaMEpuTFVsUFNIYxAB",
            "text": "AVOID AT ALL COSTS – TORTILLA CHIPS WITH SOMEONE ELSE’S CHEWED BONES? SERIOUSLY?!\n\nIf I could give this place zero stars, I would. But unfortunately, the system forces me to give it at least one — and even that feels like a betrayal to every clean, competent restaurant out there.\n\nWe came in expecting a casual bite, nothing fancy — just some tortilla chips and dips to start. What we got instead was an abomination: halfway through the basket, we discovered eaten bones — yes, actual chewed-on chicken or ox bones — nestled in among the chips like a disgusting little surprise. These weren’t cooking mistakes or bones that slipped in by accident. These were clearly gnawed, already sucked-dry bones that looked like they came straight from another customer’s plate.\n\nWe immediately showed the staff, expecting shock, horror — anything resembling basic human decency. Instead, we got blank stares and were told, with stunning nonchalance, that we still had to pay for the meal. No apology. No refund. No sense of shame. Just the bill, handed to us like we should be grateful we weren’t charged extra for the “protein.”\n\nThis wasn’t just gross — it was unforgivable. The health violations alone should have this place shut down. And the way the staff handled it? Even worse.\n\nBOTTOM LINE: Do not eat here unless you enjoy a side of someone else’s leftovers with your tortilla chips. Report them. Warn others. And whatever you do, don’t go near this dumpster fire of a restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU28xc25FeGViT0Z3EAE",
            "text": "This place is legitimately delicious. Will be going back to eat the other 5 things on the menu I didn’t get to try. They do it right."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV2VtWWYydHZIZG5BRRAB",
            "text": "Hidden gem!  Excellent all around. Fun for a date night or a chill evening after work.\n\nFood - delicious and creative.  Good mix of  safe bets and exotic adventures.\n\nDrinks - fantastic and creative cocktails\n\nService - slow for NYC if you are in a rush to get in and out, but perfect if you want to take the experience all in and enjoy the evening.  Think island time, but worth it for the attention to care in the food and beverages.  The owner, chef, bar tender, waiter may all be the same person at times (Nestor).  Loved it!\n\nAtmosphere - It wraps it all up beautifully. It's quaint and festive. Loots to look at on the walls.  Everything appears to be a personal work of art or decor. The small chairs and wood tables are fitting for the food, space, and overall vibe.\n\nI highly recommend it. I look forward to visiting again next time I'm in NYC."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajZXaG5BRRAB",
            "text": "Delicious food, fantastic staff and service, and super fun, original decorations. The staff were so attentive to our needs and requests. The food was super tasty, especially the smoked fish tostadas, and the coffee satisfied our coffee snob friend. The decorations are super cute and there are so many fun things to look at as you eat. A great local spot!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUlHTnNBRRAB",
            "text": "The menu was a total catfish— we ordered octopus and shrimp salad and it came with only shrimp. We also ordered guacamole with shrimp and crab but we couldn’t find the seafood. We ordered quesadilla but it was a taco with salad on top of it. Moreover, the drinks were totally watery. We were disappointed as this restaurant is highly reviewed and the owner insisted on the quality and history of the restaurant. Save your energy and go somewhere else."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X015NkRBEAE",
            "text": "This place is a complete scam. I took my family here on Saturday, and we should have walked out the moment we arrived. The owner had a terrible attitude and seemed intoxicated. When it was time to pay, they handed my sister a ripped check. After reviewing the total—since it wasn’t adding up—we discovered they had charged us for FIVE drinks we never ordered. Avoid this place at all costs! We will never be coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Zy03aU9nEAE",
            "text": "Food is always delicious and service is always attentive! They also have karaoke on Saturdays from 8-11 and on Sundays from 7-9"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOEp1MWRnEAE",
            "text": "Wow, what an amazing place! 10 out of 10. I had the omakase style dinner with friends. Not only were the food and drinks delicious, but the atmosphere was so warm and cozy. The people were very welcoming. I’ve never felt more at home in an NYC restaurant. Go here, you won’t be disappointed. A true one of a kind gem!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndHUyb1ZnEAE",
            "text": "My friend had a party there and one dish after another was amazing and authentic. When it came time to bring out the cupcakes Nestor put on an amazing show"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndG9UeEhnEAE",
            "text": "incredible spot, highly recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXY3eHN3RRAB",
            "text": "Amazing experience, 10/10. The owner is the sweetest man , served us last minute on Valentine’s Day and the food was amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNEtXdGRREAE",
            "text": "The ceviche is super flavorful, and available according to your own spice tolerance with fresh made chips that are out of this world. Great crab tostada as well with a range of rich flavors. The chef owner is very warm and shares his recommendations. Great people, and the vibes are lit during their live music performances on Wednesday nights. Cash only at the bar, but take card for table service. Strongly recommend checking it out."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmenJDVFFnEAE",
            "text": "Authentic and delicious!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeHUtd1NREAE",
            "text": "La comida increíble\nEl servicio inigualable\nY el ambiente es estar en México city , sensacional , nunca visite México pero ya se lo que sentiría allí , la decoración de los platos la música y el olor a comida de ese restaurante uuufff 1000% recomendado"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzczVLRDRnRRAB",
            "text": "Amazing customer service,"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcy16Q3R3RRAB",
            "text": "Amazing food, customer and atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLU5xSlN3EAE",
            "text": "Enjoyed the evening, but dissatisfied with the $16 chips & guac. Nothing was wrong with the flavor/seasoning, but the portion size left much to be desired (especially for the equivalent of a drink/order of tacos).\nThis could be at the mercy of inflation, which is no fault of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2IyQ01BEAE",
            "text": "A special treat, tucked away downstairs in a mid-block building. When you walk in, you're transported to a magical Mexican place of fine food and drinks.\nThis is not the standard \"generic\" Mexican menu but artistically created dishes that avoid the beans-rice-shredded lettuce cliches.\nIt is worth the uptown journey to experience the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN0x6YjlRRRAB",
            "text": "Came here for a drink & some food after work. Great atmosphere. Nestor was amazing. Thank you for everything! Good luck :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3elo2VjJnRRAB",
            "text": "Celebrated our anniversary here. Food is incredible and they had fantastic live music that night. Cozy spot with top-notch delicious fare"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM19USGJREAE",
            "text": "This place is so cute and cozy. The atmosphere is so unique and feels like you’re transported to Mexico. Perfect for a date with some drinks and dinner. We loved every thing we ordered: the tamarind mezcal cocktail, guacamole, ceviche, and pork chop. Will definitely be back! Thanks for such a great meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid29uOHN3RRAB",
            "text": "Really kind owner and wonderful fresh margaritas and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyczRUOG9BRRAB",
            "text": "The food is extremely overpriced. There's no AC. The house margarita was horrible. Tasted like water and tequila. Will not be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyazd6R09REAE",
            "text": "Drinks great, but food is Delicious! I highly recommend this place.  Decor is very unique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ0wyX2hnRRAB",
            "text": "what a gem of a restaurant! so much character and a very unique spin on delicious mexican food. Do not expect traditional chicken enchiladas or ground beef tacos. instead embrace fantastic seafood forward dishes - the fish tacos are superb"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2JidmZREAE",
            "text": "Going back soon!! This Lil place is packed with the goodness. Whose know they're  life music on Wednesday at 6pm!!! Totally Hightly recommend 👌 👍 👏 🙌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdUpydERBEAE",
            "text": "The owner is passionate and so is the flavor in the amazing dishes he creates. Will return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MHFXNkdBEAE",
            "text": "Delicious, worth the trip from a other neighborhood. Love is in the details. Take your time though, as the service is very slow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MFo2MTdRRRAB",
            "text": "You must stop in El Kallejon! This unique gem is a hidden treasure you do not want to miss out on. The hand crafted cocktails made from scratch are absolutely Devine. Aside from the inviting environment the food is authentic and absolutely delicious. Will be back, new favorite spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MFo2VFBBEAE",
            "text": "Fantastic food , great cocktails ! Delicious ceviches . Thank u for the hospitality Nestor !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6a3NmQ193RRAB",
            "text": "The food here is good but the portion sizes are tiny!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a0tqMFdREAE",
            "text": "Amazing food and ambience. Nestor is a great chef and host."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeGZqNTlBRRAB",
            "text": "A scam! They up charged like crazy and used the excuse that they’re a small business. The price on the menu was cheaper than what was charged for multiple items. You had to pay tip when your card was run even though tip wasn’t included on the bill. Nothing was easy. At all. Not worth it. Tons of other Mexican spots in Manhattan and Harlem. And I’m being very generous with this review. It’s not even the money. It’s the principle. Ruined our entire night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUblp5bEZREAE",
            "text": "Amazing tacos"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxd3BTdmtBRRAB",
            "text": "It's not often that I give a restaurant all five across the board but if anybody deserves it it's this place. This non-traditional but super authentic Mexican restaurant is probably the best Mexican food I've ever had in my life. Every single dish was delicious. The chef comes out and talks to you and is willing to make dishes to your liking. This place is so cute and fun and the atmosphere is so cozy you might never want to leave. If you go to one restaurant in 2024 this should be it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdTVtTnJBRRAB",
            "text": "The service and atmosphere were nice! However, the food was 5/10 and way overpriced in my opinion. 3 appetizer like dishes and 2 happy hour drinks $95+.\n\nWaiter/owner asked if I wanted chips and guacamole dip as I sat down, which made me think it was complementary, however it is not. Be mindful of that!\n\nOverall, the owner/waiter was awesome! The restaurant is nice inside. Very authentic! The owner really enjoys cooking and takes pride in his dishes. I trusted his recommendations, however, I wasn’t too impressed with the food!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNnR5Q2NBEAE",
            "text": "This place was amazing. They are very unique and their food is incredible. They serve small portions but it's all about the taste of the food and that's why it's so important that is small plates, so you're willing to try more dishes. Their…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkd2JUU1lnEAE",
            "text": "This is a Must Go To! We had the most sublime meal ever! From the Omakase selection we had a dish called Maria Sabina? The unctuous and umami flavors surround your senses and blow you away! Wild mushrooms, goat cheese, huitlacoche, shiitake mushrooms, and truffle oil on a flatbread.The Fantastic fish tacos were great! Little bites of crunchy yet tender fresh fish with fried beans, avocado, cabbage with a side helping of sauce whose heat sneaks up on you.As for the mains we had Huipil de Maiz -Soft corn tortilla, 4 cheeses, mild tomatillo sauce, greens, crema, with Huitlacoche Y Shiitake Mushrooms. The flavor of the corn popped, the unctuousness and umami huitlacoche and shiitake covers your mouth like a food of the Gods! The main I ordered was the protein of the day, a filet of fish smothered with a red sauce of olives, onions and magic!Accompanied by small purple potatoes, a fresh green onion and fries. This was also fantastic! If you want inventive cuisine that tantalizes your palate  prepared with the freshest ingredients,then make your reservation to El Kallejon! The Chef/owner is a genius worthy of Michelin stars! Atmosphere- friendly and no pretentiousness. We can’t wait to go back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aGFpaklREAE",
            "text": "1st of all, I recommend just walking in to view this place. They have decorations everywhere, and it works. They maximized the space to have a decent amount of seating plus tables, indoors and outdoors. Yes, they have a rear outdoor patio. The staff was very polite, greeting us as we entered and when exiting. I opted for the Salmon Ceviche on the menu as Tiradito de Salmon, which was very tasty, I definitely recommend it. Since the serving sizes were smaller fine dining portions, I ordered the hard shell fish taco, Tacos Dorados, which were decent, but the Ceviche was much better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOTRyZnVnRRAB",
            "text": "Small Cozy Mexican bar in East Harlem. This place was very pleasing the the eye when you walk inside. The owner and the bartender were very pleasant and the drinks and food were delicious. Overall a pleasant lil spot where you'll leave happy and drunk!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdWJqejZnRRAB",
            "text": "Cozy bar on a quiet street. This place was so homey and the owner was so welcoming. My friends and I decided to stop by to check out their cocktail menu and were not disappointed. We each had a few cocktails and I honestly thoroughly…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNXF1ek9nEAE",
            "text": "I traveled to Mexico a few weeks ago and can attest to the authenticity of the meals in this restaurant. The establishment is quaint and  decorated with fun Mexican artifacts. The food is phenomenal(we tried almost everything in the menu ,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbDdXb2hnRRAB",
            "text": "We had the most wonderful dinner here. We got drink specials and a whole bunch of different options off of the menu. Everything was super fresh and cooked to perfection. The salmon ceviche was the best I’ve ever had. I tried the baby shark, a first for me, and it was better than I could have ever imaged. We also tried the brains and were a little apprehensive at first but it was a phenomenal dish. You could taste the love they put into their food.\nWe had a large party and our waiter was so attentive and kind. He let us know their kitchen was small since we were such a large group but the food came in a timely manner and our drinks were never empty. They also have a beautiful back yard we wish we got to enjoy but it was raining when we went. We will definitely be back to dine outside!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbk1uOW9BRRAB",
            "text": "El Kallejon is cozy, but full of flavor and boldness. Nestor loves food, and surprised me with delicious handcrafted specialties like baby shark tostadas. He even has brains and escargot on his menu!\n\nThe food and drinks here are spectacular. I can’t wait to go back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNbDV5eFBREAE",
            "text": "This is one of the kind places in NYC. When I sit there I had a feeling if i was at the place on the beach. The owner is doing a great job with flavor profile of the mezcal. The tiny kitchen is making miracles! Guacamole is amazing. Love…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROX0pyZXJ3RRAB",
            "text": "I have a hard time rating this place because it truly was a nice dinner, great atmosphere and unique experience. However, I can't help feeling a bit blindsided and overcharged for the \"omakase.\" The assortment consisted of some variation of the items already on the menu, he simply selected them for us. Charged $480 for 5 people to share maybe 10 small plates (would be considered appetizers in any other restaurant). We tried to ask more about it and were told there would be \"lots of food, family style\" but even getting extra chips seemed to be a big ask. The drinks seem interesting on paper, but the flavors are underwhelming and judging by how I felt after 3 of them, I am highly skeptical of the alcohol content. In the end, this is a no for me. Definitely bigger bangs for your buck in this neighborhood."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnajZDeEpnEAE",
            "text": "Love this place! Food is really tasty and the restaurant is designed so thoughtfully. The colors are gorgeous and there’s art everywhere. All of the staff were very sweet and accommodating."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMDZpVXd3RRAB",
            "text": "This place is amazing! Please go! The food was so well done and it’s cozy, with good drinks. Additionally, the owners were super sweet and genuinely enjoyed sharing their passion and work. I’ll be back ASAP!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdXRmamJREAE",
            "text": "I can only speak for the cocktails that my friend and I had at the bar.  They were very delicious and meticulously crafted.  Loved the atmosphere, decor, and the overall place.  Wish the outdoor area is open, would be nice to hang out in…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOHRpeFNREAE",
            "text": "Great service, kind bartenders and waiters/waitresses. The food tastes great! I got a free taco sampler that tasted great. Host was honest about food feedback and the best drinks to get. Drinks are strong! 1 was enough for me and I ordered a 2and one and felt the first one before the 2and one arrived in front of me. Will return"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0Z2Z6bG53RRAB",
            "text": "Absolutely loved this place! The decor is awesome, really chill vibes. They were genuinely happy we where there, which was nice.. the food was awesome, authentic Mexican, the sangria was delicious and the service was great too, a classic good New York hole in the wall.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cjUtSUNREAE",
            "text": "Came here for some drinks. Loved the vibe, the customer service, the music, the decor. I will absolutely come here again with friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbDZiVjF3RRAB",
            "text": "Absolutely in love with this restaurant. Drawn in last week while exploring around Harlem — you can see their colorful exterior from 3rd Ave. Atmosphere is relaxed, familiar, and over-stuffed with the best kind of kitsch/camp decor.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeWE2TVZREAE",
            "text": "Great space with creative and tasty dishes and cocktails. Portions are a little on the small side but they make up for it in flavor. Not pictured is the guacamole that comes with crab, shrimp and pomegranate, great."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBLWRQcFZnEAE",
            "text": "Favorite spot in the neighborhood. Great cocktails, food is top notch even if it's mostly bar snacks and plates, and guacamole is to die for. To drink try classic margarita or one of the signature mezcal cocktails. To eat try Maria Sabina and Tostaditas de Huitlacoche."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNU0yamdRRRAB",
            "text": "Great cocktails.  Food and Decor with family references makes El Kallejon stand out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNWJuUlBnEAE",
            "text": "El Kallejon is delicious, unique, and authentic. You won’t find a truer New York City experience than in its realness and creativity. Everything from the shark, to the guacamole, to the ceviche takes you to Mexico in a way few others…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd3ZfQmxRRRAB",
            "text": "I love this place and the food. Only complaint is that it can be a bit pricey. That being said, the atmosphere in El Kallejon is totally worth the extra dollars. Sit out back if it's nice!"
        }
    ],
    "reviews_count": 74
}