{
    "name": "La Fonda",
    "place_id": "ChIJGZFqAQP2wokRf6_pCfLV8dM",
    "grid": "MN11",
    "address": "169 E 106th St, New York, NY 10029, USA",
    "rating": 4,
    "user_ratings_total": 1062,
    "phone_number": "(212) 410-7292",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcVVFdzNRbEJUVms1ME9VUXpYMDVKTVVweVluYxAB",
            "text": "Atmosphere wack, service horrible, Food cold, i order rice, beans both cold, the owner said because they don't want customers get burn. I never heard such a disputing excuse, the peril was warm sweet plantains cold also. I DO NOT NOT RECOMEND ANYONE HERE."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRlpYWnpVMmhwZUhoQlNETTVWVlpqV0ZablUwRRAB",
            "text": "Terrible Experience — Poor Food and Worse Service\nI brought my family to La Fonda expecting a nice meal, but we left completely disappointed. Several items on the menu were unavailable, and even though the restaurant was practically empty, our food took ages to arrive — only to be served cold.\nThe pork mofongo was a disaster: drenched in liquid and more like a soup than the traditional dish. The beans were flavorless, and the arroz con gandules had a strange, unpleasant taste. For a restaurant claiming authentic Puerto Rican food, this was far from it.\nWhen I asked to have the poorly prepared dishes removed from the bill, the staff flat-out refused. I also requested to speak with the owner, but was told he was “too busy” to come to our table — an unacceptable response to a paying customer.\nBetween the bad food, poor service, and complete lack of accountability, this was one of the worst dining experiences we’ve had. I would strongly advise others to think twice before dining here."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNVVXTklkSHBMUzJ4TU1IVmlSREZNZVd0ZlMxRRAB",
            "text": "OK food. Servers were kind, but clearly overworked, which explained the long wait for the food and the check. Bill was split in two cards but only one card was charged the full amount. Followed up with the restaurant twice via email to no avail. Dine at your own risk."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZemVYcElRVnBqYXpoSVFuZDBOVzA0WVRKV2QyYxAB",
            "text": "Very nice and authentic place. The food is delicious, the service is amazing, the music is exactly what it needs to be. I love the authentic Puerto Rican atmosphere. I wonderful place to enjoy your lunch or dinner with friends and family."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVEwSmFjMkZ4ZVhWZk5DMVNSVUZHZGxKM01FRRAB",
            "text": "Great food, wonderful service. Lovely vibes. The food was fresh and nicely prepared. Tasted amazing. Drinks were phenomenal, not sure if the hostess noticed I was on a date with my girlfriend but she made both our drinks strong but not overbearing. Would definitely recommend if you are in the area and want some great puerto rican food."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSmRrNXhkekJFWWtFMmVISTRRbVZ4U2sxU1ZHYxAB",
            "text": "We, (my niece and I) decided to try La Fonda since I've seen it advertised on TikTok. It was brunch time and there were maybe 2 or 3 other tables occupied. We were given menus and were seated.  The place has a cultural environment which is fantastic. We were given water and decided to have an appetizer.  Bacalaitos were great with the garlic sauce.  I noticed the glass was dirty, it was replaced. We received our sodas.  I was drinking mine via a straw and after a few sips, I noticed a women's dark pink lipstick mark on the glass. I didn't know how I missed that. Again, it was replaced with a new glass and soda. We ordered the pernil with rice, maduros and egg. My niece had the arroz con gandules and I had black beans and white rice. The arroz con gandules was so moochi that it was not eaten (humao or mogojao). My rice and beans were ok but the pernil was bland. There was no taste to it. After everything, my leftovers, I took home. The beans were in a container. I asked around 3x for the lid. The waiter kept avoiding us. I'm very disappointed. I really thought it was going to be a great first time experience.  Maybe this was one of those off days.  Everyone was friendly but the food means alot more. I didn't want to be mean. This is what happened at the time and I do not wish anyone to be disillusioned from my post but you need to check it out for yourself. Blessings!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWMxRnNVWGt0TWxaeGQxZEhZVXA2ZW1SV2NVRRAB",
            "text": "La Fonda is an amazing place, full stop! First of all, the food is excellent! I'm very picky about Puerto Rican food because my grandmother was an excellent cook (and in many ways, noone can reproduce what she used to do), and she taught me how to cook. So my bar for excellence in Puerto Rican gastronomy is very high. La Fonda clears that high bar easily, and then adds complete authenticity! Then their drinks are crafted with care and creativity! Finally, their owner James treats you like family, while the staff does the same! La Fonda is also a great place to have an event, or get to do the catering for your event. And when they aren't feeding people, they are providing the community with a place to gather for all sorts of community based activities! The only drawback is that I don't live closer to go more often and be more supportive!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFpUSmtSblJGUmtGWk1FZ3RXbVJWYUZodFYyYxAB",
            "text": "Ordered food online and my rice was burnt and the food was salty. Tostones were undercooked..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFMyaE5aMVpJTkVkMFgySm1iMGhoWkV4cWQxRRAB",
            "text": "Very fresh, elevated and very delicious! My new favorite spot in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWWExbzRaWEZFVVdGUmNtNXpkak5oUm05TE9GRRAB",
            "text": "Can’t really give an actual review because I wasn’t able to get in. I made a reservation for today at 7:30 with Resy, and when I arrived, they informed me that the restaurant was closed for the Bad Bunny event. I wasn’t made aware of this…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobmFrTldZM0JYT1ZnMlRIaExiMFpTZDNneVdHYxAB",
            "text": "Was a nice experience James is amazing his waitresses especially Jasmin were great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVk1FUmtPRVl6Ym5ORWNEbFJZVFYwUTJ4UUxWRRAB",
            "text": "I really wanted to like this place more than I did. Super kind staff but the food came out verrrry slowly and it was just ok."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cFluUjZURTVTWW1SMGFuWTFhbXg0WVdJd1NIYxAB",
            "text": "This place shows unmatched skill. The dishes demonstrated remarkable quality. Hospitable, kind, inviting, skilled. They use fresh ingredients. The staff is nice to everyone. When in this neighborhood, I'll come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlEwNDRXazV6UzBocmFIbHNlVkZJV0c1UVFXYxAB",
            "text": "Everyone, from the waitress to the DJ, was kind and friendly. The Bacalaitos were incredible with chunks of cod fish. I just left PR 2 weeks ago so I was feeling homesick, the food at La Fonda provided some relief. Reminders of home are good for the soul! Therefore, I will be back to relax in la hamaca after my meal just like I would in the mountains of Ciales. Thank you La Fonda!!!!!!! 🥰🇵🇷🔥"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbjRpdHR3RRAB",
            "text": "A great place for Puerto Riican food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNGRsSXpTMGRvU1hob1VtUlZTM2h5ZFcxeWFXYxAB",
            "text": "It’s changed as far as food service. It needs more variety."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUlpHSmtTRWwzUlVnMVMxUlJSazFGWDBSTk1GRRAB",
            "text": "Had a good time at La Fonda food was decent, but it did take a bit long for our dishes to arrive. Overall, it was okay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eWR6ZFFjVWRuYmxodmVIZ3dObDkwVjJZeWVYYxAB",
            "text": "Amazing spot to have a great meal with friends! Must try the Pernil, absolutely to die for. The atmosphere is great and the space is great for events!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU1QyOHdXVXMzWWxSWlpVRm5WRGhuWjJKbFZrRRAB",
            "text": "Ordered online and got scammed! Please remove the website that is in your website bio. They said to dispute it with the bank which I just did. Don't order online.\n\nEdit: I went in person to the restaurant and you guys told me to dispute it with my bank and that you haven't taken online orders for months, despite it being on your website."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRdFFURjVOMWw1YVVwMVJXVnhjamR6UTJaeVltYxAB",
            "text": "Good Puerto Rican place with some traditional fares. The chicken stew was a bit salty, but the steak and onions was really good. Had them with rice and beans and Maduros. We enjoyed our meal and the staff was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNVQxTTNXRmQ0VHpOc01tWjFSMk5VT0dsM1VWRRAB",
            "text": "Unfortunately it was pouring out and couldn’t get out of car but will be going back tomorrow—I’ve been here a few times and is absolutely fabulous 👼🏻👏😎"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNFZuQm5UV1J1YkhoSlJVSklOVGRZUkRabGMzYxAB",
            "text": "Had a wonderful time celebrating family. But while there i are the pernil and it was sooooooooo delicious 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeE1GSlFhVzEyVkU1T2JUVmtjbU5aZERsbWMyYxAB",
            "text": "Excellent service and food. I highly recommend La Puñeta. The staff is very friendly and always smiling."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1UwMU1OakJ2UTNSbmIxZ3RMVkJrVmxWb1NXYxAB",
            "text": "The food was not good.\nIt was missing that real Puerto Rican flavor...they need to hire a new chef that has more experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM2RqaG1jbTVPVFc5elN6azVTM0kxU2xOTU1VRRAB",
            "text": "Everyone is spot on that the food tastes of family, home, memories, good days. I love the artwork and the fact that the menu of the day is verbally communicated. Tells me what is made is fresh & sincere. Guests need to release expectations, support a local business, and the chef(s) will not disappoint! Thank you kindness and love on a plate. Shameless plug: I do hope the salads return to the entrees, but I'll be back regardless."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRWRFdFFVRlZpVDJ4cVFsQmhaelIzWjI5M2FXYxAB",
            "text": "Authentic Puerto Rican cuisine. Worth every penny."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204elZEaHVaa0ZPZVRBd2VVYzFhbUZEZERSb1ZIYxAB",
            "text": "Every time I grab a bite, I’m a immediately brought back to mom‘s and my abuelita’s house. The food is always on point. But be ready to wait sometimes, as it does have a vibe of ordering in Puerto Rico. If you’re in a rush, this might not be the place for you. But if you want some slow cooked food that fills your belly and makes your Corazon feel full, this is the spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeFoybGZXbUZVTWt0bGRIZFdiRVJ6TVVWUlluYxAB",
            "text": "I’ve been going to place for over 15+ years and the food is always consistently delicious. I love that there’s always Salsa or Freestyle playing softly in the background."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT1ZtMUpObkJzVlZSYVkySnZNbll0VUhCU1JYYxAB",
            "text": "My loved ones and I have dined here several times. You can tell the staff here is VERY DEDICATED AND HARDWORKING. …..HOWEVER management needs to do better. It’s clear that management/new owners are not investing in the success of the restaurant and staff. They have one person doing everything, from hosting to bartending to taking orders to food running. She does an amazing job however it causes unnecessary delays in the dining experience.\n\nMy last time here there was a manager/owner standing around asking people how the food was and just chit chatting while the one server on staff ran around doing everything. Extremely poor leadership on their part. I hope that they do better in ensuring the success of a neighborhood staple and give that wonderful woman a raise"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZk4ycDFabEJpZUY5TE9HeENVRWxoWVVwQmRsRRAB",
            "text": "I’ve been coming to La Fonda since I was a kid, and now I’m over 30 — it’s been a staple in my life for decades. The food is authentically Puerto Rican — full of flavor, soul, and authenticity. You can taste the tradition in every bite, whether it’s the pernil, arroz con gandules, or crispy tostones. It’s comfort food done right.\n\nThe vibe is laid-back and nostalgic, just the way it’s always been. This place hasn’t lost its charm.\n\nNow, for the honest part — you absolutely cannot call in an order. The phone rings, but no one ever picks up, so you have to show up in person to place your order then wait 30 minutes for food. The servers are also bartenders and cashiers so it’s also kind of hard to lock one down to take your in person order…The posted hours on the door are not always accurate, so it’s hit or miss depending on the day. Also, CHECK YOUR ORDER BEFORE LEAVING!! It can be a little frustrating, but once you’re inside and the food hits the table, it’s all love.\n\nDespite the quirks, La Fonda remains a gem — real food, real flavor, no shortcuts."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQVFZ6YmZid3YtODNBRRAB",
            "text": "Made a rez for June 3. Even got a text reminding me about my reservation. When I showed up, it was shut down by the health dept."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLUtndl83aVp6QWV3EAE",
            "text": "They are suuuuper kind and warm! Looooved the food :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVGY1ZHJ3c05uYV93RRAB",
            "text": "The best place I ever had"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMnJ3ZEc1OEpDRTJ3RRAB",
            "text": "No good muy carro diner"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJYWtoYjZqXzhlbDdBRRAB",
            "text": "The food is ok need better service  I experienced several issue in the restaurant services are very bad had to wait like 10 minutes to get water what I had order for food I didn't get I order red beans they  gave me black beans because they didn't have no more beans a little bit of rice chicken not well done after they serve my food I wait 10 more minutesfor  my drink I had to get up several times to ask for my water soda lemon service is very bad the lady's that  work there don't work they to worry about the bar and joking around always wanted to visit this restaurant with my mother but was very unsatisfied first time there and my last one to"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQVDZpZXU2MHBlWVVnEAE",
            "text": "The restaurant decor and ambience are great. But it seems like it’s just for the gram. This restaurant had two waitresses for about 10 tables. One of the waitresses was bartending and was clearly overwhelmed by having to do so much. We had to wait to receive forks and knives even after getting our food. The restaurant has potential but today was definitely not their day. Most food items were also sold out. They didn’t even have chicken breast."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcmU0TWJwcFBfWU5BEAE",
            "text": "Best PR restaurant in NY!! 🤩🤩Great customer service. The food is delicious. You have to try el Mofongo de Pernil. We had a great time there. Thank you, James, for taking the time to meet my family 🙏🫶😎"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaGF6cTJnRRAB",
            "text": "This place has a lot of potential but I have to address a few things.\n\nWhen we were seated nobody came to us for about 5-10 minutes. It’s not the best feeling being left waiting, especially when you’re with hungry kids.\n\nWhen someone did come instead of us getting menus she proceeded to tell us what she had because they “were out of a lot of things” this isn’t a food truck where you should be running out of things as the day goes. Also it was 4:45pm. When she finished we realized it was only two things missing so wouldn’t it be easier to just tell us you don’t have those two things? Some people are visual and aren’t going to remember each item verbally for them and their children.\n\nThe place is an absolute icebox. It was raining and cool outside but inside it had to be 60 degrees.\n\nit’s a PR restaurant which you’re reminded everywhere you look so play some music from the island. Nobody wants to hear 70’s disco.\n\nLastly this is a brick and mortar restaurant, there’s no reason you shouldn’t take credit card and only take cash or Zelle. The guy selling things on the corner takes credit cards. I came here with my family and was quite embarrassed about all these things but especially the credit card situation. People make plans and come with friendly and family which makes paying very awkward. This should be listed on your website."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaWJLVC1RRRAB",
            "text": "Talk about home, Felt like I was in Puerto Rico, the people, the music, the food, the restaurant itself and ofcourse the flags and pictures of nothin but Puerto Rico all around, one of the best Puerto Rican spots to go to in the city, the owner makes you feel welcome and the waiters are the nicest and very helpful, would recommend and best believe ill forever keep coming back to eat and enjoy my time here. BORICUA 🇵🇷"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcl9Ha1pBEAE",
            "text": "Just stopped by for their legendary Bacalaoitos, reminded me of being back in PR with my family! They just experienced a robbery and remained open for the holiday, that takes guts and strength! Bless their hands, their hearts and everyone that supports this neighborhood staple! Shootouts to the chef, James and his staff! We loved our meal with you today! May you always rise above! Asé"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbTVXSGt3RRAB",
            "text": "The owner is a sweetheart! This is a small business that I will definitely come back to support! Great food! Good service! Well kept establishment!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaEx6WGhnRRAB",
            "text": "This place is soooo good. Came here on a whim with my sisters they had their brunch menu out the carne guisada the chuletas and pernil were delicious. The staff was kind and courteous and the chef was friendly and funny. This is not five star fine fining but the food and service is five stars. They also give free chicken wings because they dont offer appetizers and they were soooo good. Dont miss this place its really good you wont be disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeUozSjJnRRAB",
            "text": "Had the new brunch today on 3/29/25 and it was amazing. Authentic Puerto Rican cuisine. I had the pork chops and my wife had the perni. I had the puńeta cocktail pasión simple syrup lime. A hit"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NkxhYjRnRRAB",
            "text": "Boss man is awesome 👍"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcVlXdUF3EAE",
            "text": "Amazing venue , great staff , great food this place is truly the best authentic Puerto Rican restaurant in Spanish Harlem"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBb1lIWEFREAE",
            "text": "La Fonda just isn’t the same. This was my fourth visit and there was less food available last night than my other visits. The menu just keeps getting altered. The service isn’t good. We were asked to place our orders using QR codes that didn’t work and staff left us waiting for a good amount of time even though the restaurant had very few patrons. Finally we were able to order with a waiter but had to rely on the folks at the table that had working QR menus. We each ended up just ordering one drink each and going to another restaurant to get dinner.\n\nGoogle allows you to choose recommended dishes for your review however, the majority of the listed dishes are no longer part of the menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcnBfcGl3RRAB",
            "text": "terrible service and bad food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcnZUS1N3EAE",
            "text": "This is a Puerto Rican blessing in Harlem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbHFuVjFBRRAB",
            "text": "Stopped by last night. Even though they were holding a private event they accommodated us. In my opinion the best Puerto Rican establishment in NYC. James stopped by our table and we immediately were drawn to his passion for our culture. I felt like we were on the Island. Definitely stop by and show love."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLU9MaUVnEAE",
            "text": "i loved it. the food was amazing. every thing looked delicious, and the decor made me feel like home🇵🇷 10/10 world recomend"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacE5DbHdnRRAB",
            "text": "If you want to have a great experience with amazing food, this is the place you’ll find it. Authentic puertorriqueño cuisine in the heart of East Harlem with a friendly staff. There’s a bit of a wait for food, but that’s appreciated once you take a bite. Quality takes time. Def will be back.\nUpdate: Def went back and got the bistec encebollado! It was magnifique *chefs kiss*. Marinated to perfection with maduros and a simple avocado salad enhanced with a fresh in-house dressing.  Now need to find the next dish to try.😌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc2VUS2F3EAE",
            "text": "Very nice Puerto Rican place with very friendly service. We ordered the ribs as appetiser and they were ok. Tasted a bit westernised. But we also ordered pernil and shrimp mofongo, both of which were delicious and the portion was generous, especially for the price). Service was good: very friendly and professional. Food came out quite fast and fresh. Latin music was nice in the background and the volume was just right. Give this place a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aHBXZDR3RRAB",
            "text": "Came here on a Pulsd deal. Sometimes those Pulsd and Groupon deals are kinda a swindle if you will. What you spend on the deal plus what you have to spend in store equals out to if you had just went to the restaurant somehow. It's wild.\n\nBut.\n\nThis Pulsd deal was a home run!\n\nI ordered the Pollo Guisado A Caballo (Pic with the soup bowl) and The 2 Chuletas & Rice.\n\nFood was DELICIOUS. So good that I'm like who cares about the deal. You get a lot of food and it's SOOOOO GOOD.\n\nThe Pollo Guisado had this broth that was SOO good and you can take some and pour it over your rice. That's what I did and it set everything OFF.\n\nThe 2 Chuletas and rice was flavorful as well and the rice was outstanding once I put the broth from the other dish over it!\n\nService was lacking because there were a few new ppl waiting (per the owner). He definitely tried his best to cover for all of them and he did a good job.\n\nI'd definitely come back in a heartbeat and plan on to get that food again. You should come here too! Loads of food for what you pay AND the food is SCRUMPTIOUS."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacWJhcXhnRRAB",
            "text": "The food was delicious although took way too long.  We asked to sing a Happy Birthday and it was a hot mess.  The drinks were bad yet one drink only call Puñeta was good.  We got in at 3pm and left by 7pm. Very slow services for food and drinks unless you sitting in the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcUtIUVd3EAE",
            "text": "I don’t know if it was this particular day but since it was my first time- I can only talk about my experience-with that being said here’s the positive: ITS PET FRIENDLY!! Which is Amazing and I found this to be super considerate of the owner. The vibe is a nice. It has nice music and the layout is very cozy! The appetizer was delicious I got the alcapurria. The waitress was very sweet and attentive.\nNow for the cons: so they give us menus but since we went at 2pm they only sell brunch which I didn’t know. I guess because they add and egg and that’s considerate brunch? In any case the food was bland and nothing extravagant that warranted the price. The pernil was dry and we were expecting a Puerto Rican flavor. Now we also got the chicken stew which was NOT appealing and frankly I only took a bite and left the rest. The sauce was very  watery and just blah.\nThey gave us a drink menu and all the nice drinks were not available?? I thought the drinks were very expensive.\nAnd lastly we had to get up to ask for this and that. Overall I didn’t like this restaurant and just a waste of money. I should’ve gone to the little shop in the corner and I bet the food would’ve been better and more economical. Last time coming here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX2Z1LW5RRRAB",
            "text": "We went this time specifically for the featured Black Rican Vegan menu options which didn’t disappoint at all. The vegan servings were delicious and healthy portions. My favorite were the trio of Pastelillos Flight including the Guava and Cheese, Chickpea and Potato and very seasoned yummy vegan beef. The atmosphere and decor always colorful and tasteful. What needs improvement is their service. The team felt like they were constantly in the weeds. They were all super friendly but just some basic training like assigning dishes so they go to right people and also fixing mistake orders properly. They forgot the pernil in their regular brunch menu, Eggs Benedict dish. They brought it out a few minutes as large side portion but you go to a restaurant for the experience and presentation which obviously was not executed. The other confusing issue was we had two servers that were approaching us asking the same things. Though they were both friendly and eager, the uncoordinated tag team was overkill. Overall we still had a great time but hope they take this as constructive criticism."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUenVuT0tnEAE",
            "text": "Big Shout Out To LA Fonda..\nFor taking us on such short notice.\nJust a heads up on the weekend you might want to book a reservation because the habitat is sooo good they get slammed.\nBut big shout out to my Boriqua James. The Bartender. For Handcrafting those drinks with love and inspiration.  True To Your Roots🇵🇷🎶🎶🎶.... making an inspired moment and empowering and memorable one.\nThe Food was Great....THAT JÈFE Sandwich is no Joke.......had to take the 2nd round home because I was full with great loving Food....and surrounded by beautiful cultured Art........check this place out for sure.........ATAJA....."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHRmZVJ3EAE",
            "text": "I couldn’t have asked for a better place to help celebrate my girlfriend’s birthday than an old friend from Highschool who followed his dreams and is a Restaurant owner. You sir have made a place that to quote on friend said “it tastes like I am at my grandma’s house eating dinner”. Any person worth their weight knows how much that means. The food was amazing, the atmosphere was great. The staff was wonderful. Thank you James for having us. I will come back for more when I can and would recommend this place to anyone. Those empanadas are so good. The sauce was so delicious. The Maduros are cooked to perfection. The beans I can’t even describe, I even drank it from the cup jokingly but they really are delicious. So glad we got to eat here."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNE9ERUNnEAE",
            "text": "Took my 14-year-old son and his friend while we were visiting the city. The atmosphere is really neat. I love the brick façade background. They have a lovely bar when you walk in the place and two areas for dining. The walls are covered with artwork from local artisans and are pretty unique. We ordered the empanadas as an appetizer. Absolutely amazing for dinner. We ordered Pernil with rice was very good.. would definitely recommend you stop your financial dinner if you’re visiting the city great example of Latin food in Spanish Harlem.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MUt6Nmt3RRAB",
            "text": "If you like traditional Puerto Rican 🇵🇷 food, this is the spot. I started off with the Shrimp Mofongo....wow...flavor on point and nice portion...ended with the flan.... nice and sweet.... $4 beers! Tasty food and awesome people. Make sure you say hi to Nancy... provecho!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENk1hT1BREAE",
            "text": "Originally, we were in the area for another restaurant, but that restaurant closed early because they were running out of food. So, we did a search and came across this place. It had great reviews, so we figured we'd try it.\n\nWe waited about 10 minutes to be seated. We were seated right underneath a speaker, and it was so loud that we could barely hear each other speak. It took about 30 minutes for our order to be taken, and another 40 minutes after that for our food to come out. We ordered the pigeon peas with rice/roast pork, and the shrimp mofongo. The food LOOKED great on the plate, but the rice and pernil was on the verge of being too salty, and the mofongo was extremely bland. I also ordered a seltzer (requested it two times, once when we initially ordered, and asked for it again when they served the food) and it was finally brought WITH the check...\n\nOverall, the food wasn't worth the wait and the service is seriously lacking. I wouldn't go back here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsOU5PUkFnEAE",
            "text": "As a Puerto Rican from the Bronx, I went with high expectations after hearing about this place from a friend.\nI like the atmosphere, and the wait time wasn't bad for me. The manager was a great host too.\nHowever, the food was entirely bland.\nI had a shrimp Mofongo that was more like mangu. It lacked the classic texture not to mention the garlic sauce didn't taste like garlic or seasoned for that matter. If they used butter, it was unsalted.\nNot to mention half the menu wasn't available to order."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobTQ3WGVnEAE",
            "text": "Tried this place at random. Food was very good. I had the seafood mofongo. The sauce was delicious. Could have used a few more pieces of shrimp but it was very good and filling. Had the corn fritters as an appetizer and really enjoyed those too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNWNqanRRRRAB",
            "text": "When I first got there, I was welcomed. You don't see this very often in other Spanish places. I was looking at the menu and thinking what to get, the bartender gave me a glass of ice water. Very friendly gentleman and very polite. He helped me with the order and it was prepared. And I must say it was the best puerto rican food ever. Delicious, cooked and very exquisite. Moist mofongo was the best ever. And the most delicious crab cakes ever. I will definitely come back to get dinner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtejVDdzhnRRAB",
            "text": "Unfortunately, we did not have a good experience. The wait for a table, considering we didn’t have a reservation, was great at about 25 minutes. Everything else was the problem. After being seated we waited nearly an hour to be served our…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxbU9qSVdREAE",
            "text": "La Fonda was a place where the food was good. The drinks were great and the service was phenomenal. My gut literally led me there since o was so hungry, And i was glad it did. The brunch menu was superb. I could not decide what to get since i wanted a bit of everything.  But i went with the mofongo. I've eaten this dish everywhere and i have to say La Fonda's Mofongo met the standard. The service (as i stated) was phenomenal. Waiter checked on my girls and my every need. The Bartender came to get critiques on the cocktail; which was a decent old fashioned. Our rainy day was met by an oasis of savory in a dish and bliss in a glass (La Fonda ya'll should patent that). I'm not done i will return. Complements to the cheffs and the bartender."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaanFtS1N3EAE",
            "text": "Beautiful place. But, the food was just ok. Not bad but not on my best food list. People was nice but service took a long time. We were sitting indoors and i came out of there with at least nine mosquitoes bites."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOGJ5Q19nRRAB",
            "text": "Appearances deem this as the local barrio spot to get some rico Puerto Rican food! The line was out the door and they take reservations! The music in this place was great. I was dancing in my seat the whole time :)\nUpon entering, we were not greeted (4 in the party at the time). A party came in after us and the host/server welcomed them in. He asked if they had a reservation, I cut in and told them we have one. (Thinking maybe he just didn't realize we were there first.) But he honestly ignored me and continued talking to the party that just walked in, instead of saying he would be right with us. Honestly, that should've been the ticket to have us walk out. Alas, we did make reservations and my party came from all different places. Our reservation was for 4:30p. Our order was placed at 4:34p. I did not sign our check until 6:38p...\nThe whole experience was the worst I've had.\n\nThe host was unfortunately our server as well...\nOur plastic utensils were on the table but it took them about 7-10 minutes to give us the plastic cups with ice. 15 minutes to give us the water vessels so we would pour our water.\nWe didn't get our menu until the water was served. A majority of the menu was sold out from the day prior. After we ordered our food, 5 minutes later my 5th member shows up. It took him about 10 minutes for the server to come by and take his order too. While the server did not come by on his own, one of the bus boys had served the 5th member the ice cup and the busboy flagged the server down.\nFor whatever reason, someone gave us 5 solo red cups? We didn't order drinks to share. Lol.\nWe did do our small talk to take up time! But 85% of what was talked about was the horrible restaurant.\nOur server never came by once. Not to give us an update on our order, ask how the alcoholic drinks were, not to try and upsell drinks. Nothing. We needed to ask him about our order, twice. He only came by to serve us food and we needed to flag him down to get our check. 3/5 of us wanted to walk out after our HOURS of not being recognized or acknowledged.\nOther tables were also getting their food served late, they cheered after they got it. But it took over an hour and a half before our food was served to us. Those people cheering came in after us and they also got their food before ours.\nAnyway, he did give us a 15% discount with approval from management, albeit some of the food being served cold food...\nWhatever sauce that was with the mofongo and shrimp was muy rico (very delicious). My party indicated their food was flavorless.\nWhere I was sitting was in the corner. My party had gotten up and as I was getting my belongings together, I felt a jerk on my leg. I turned to see some random person trying to move the table. \"I was only moving it to give you more room.\" Like, are you serious? I would never recommend going here. It would probably be best if you would go to a fake Puerto Rican place over this.\n\nPlease note, the day this experience occurred, the 2022 Puerto Rican Day parade took place.\nIf a restaurant is one of the FEW Puerto Rican based restaurants in an area, they honestly should've been more prepared!!! Shame. Especially considering the PR parade is the largest cultural parade!\nThe management/owner does not know how to run this place. Because of this, the server, and other staff, had to suffer because they were improperly trained, if at all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacmRmcmxBRRAB",
            "text": "I'm not sure what others were eating or expecting but this is true Puerto Rican Food. My heart is so happy. I fell in love with all things Puerto Rican several years ago and this meal took me right back to Puerto Rico. Please visit this place often!!! You will not be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbGJYSFFREAE",
            "text": "There was only one person working the front when we visited, but you'd never know. Super friendly and patient with us out-of-towners, took his time explaining different things on the menu.  We had the pernil mofongo, platanos and arroz con gandules. Everything was wonderful!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCekpIY3RBRRAB",
            "text": "This was my first time at La Fonda and it definitely won’t be my last. The service was amazing. The staff were very attentive and detail oriented the food and drinks we’re also really good! I live in CT and will definitely drive back to New York to eat there again! Thank you La Fonda"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa2RHU2xBRRAB",
            "text": "Bon restaurant: la nourriture était bonne et m'a semblé authentique.\nLe service a était très mauvais: le serveur a pris notre commande, puis après 30 minutes d'attente pour être servi, nous apprenons qu'il n'a pas fait passé notre commande. Nous avons dû redonner notre commande et de nouveau attendre pour être servis, alors que nous étions pressés ce jour-là.\nIl y avait très peu de monde le midi où nous sommes venus manger, c'était donc très calme."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1d29xS1Z3EAE",
            "text": "Very disappointed!! The staff were friendly, but the complete lack of service was ridiculous. Out of our party of 5, only two people enjoyed their meal. We were serve a dirty cup, we had to ask for water, and ice. The place was very hot, the music was too loud so we had to scream to conduct our conversations. Alot of the food on the menu were not available, on a already limited menu. I would not recommend and I will not be back."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NTZ5WkZ3EAE",
            "text": "I made reservations, went to restaurant and it was CLOSED. No notice. I wrote to them and they explained had Closed due to some damage and flood. They were apologetic and asked me to come back. Soo..I went on Wednesday and my boo's latino and loves Pernil, did not like it. His beans were very stale kind of bitter and tasted straight from a can. He said the Pernil was smaller and not as good he remembered and the white rice was dry . I had the Shrimp Monfongo. It was a touch salty but it was delicious❤️ I had an Old Fashion drink and the waitress suggested the Puerto Rican Beer since they don't carry Corona. She asked if he wanted to taste it, and she brought back a bottle. The waitress failed to mention it was a Light Beer! He was pretty grossed about it but she did not offer to change it and since it took a while for my drink Old Fashion, he didn't want to ask for a drink. The atmosphere was ehh, they sat us right next to a place where there was traffic cones dirty from the street and wirig as though they were stealing electricity from a building. No real ambience, it was loud with talkers from other tables, there was no music playing. My date night experience was 😢"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMF9MT1d3EAE",
            "text": "My husband and I both had the same order which was pollo guisado and white rice & beans. The pollo guisado tasted a lil too much like tomato sauce but it wasn’t bad. The rice and the beans you can tell were already prepared & maybe just thrown in the microwave it was lukewarm. Other than that we also shared sorullitos with the cheese in the center it was delish & we had the empanadas de guava y queso which was also good. Lastly we also had a passion fruit mojito which was good as well. Service was good food came out quickly & music was lively."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMk5uOTh3RRAB",
            "text": "Everything is good. Trust me. Even their cocktails that pair so well with the food. Not to mention the good vibes in there. Easily is becoming my favorite local spot! My friends travel from far to come and eat with me here"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLVBmeFlnEAE",
            "text": "My expectations were high as I saw they advertised the place as a real Puerto Rican cuisine. Upon arrival, the server was from another country and didn’t understand my questions (Puertorican Spanish).My photos are showing what I had order: Carne frita con bolitas de mofongo. Seriously? I grew up in PR and nowhere in the island you will find that as carne frita! First of all carne frita is frita, duh. Bolitas de mofongo are supposed to be on the side served with mayoketchup. This was just an appetizer and an expensive one for it not to be what is supposed to be. Maybe in some other central or south america place they call that carne frita with whatever the sauce was, it tasted terrible. Please hire a real Puertorican Chef, someone who has experienced the rich and delicious flavors from the island. Perhaps there is a mixture  of cultures within management I don’t know but it really shows. This place DOES NOT represent how we seasoned and prep our exquisite meals in PR."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOGJ2ek93EAE",
            "text": "The food was pretty bland. I have visited local Spanish restaurants that are less prestigious with better seasoning. I did enjoy the entree and customer service. The decor is reminiscent of the environment that has spawned such delicacies. I have never tried a Cacona but it was was pretty good. Ground beef, baked in sweet plantains…wow…definitely a must try."
        }
    ],
    "reviews_count": 78
}