{
    "name": "Renaissance Harlem",
    "place_id": "ChIJy8PSLHL2wokR-6RfFmGybOk",
    "grid": "MN11",
    "address": "2245 Adam Clayton Powell Jr Blvd, New York, NY 10030, USA",
    "rating": 4.3,
    "user_ratings_total": 931,
    "phone_number": "(646) 838-7604",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JemExTnFiV3RZUVUxQmVuVlNOa0ZCZFdSNlFtYxAB",
            "text": "Great food it's a wonderful location.  I have had the pleasure of dining twice at Renaissance  it 9s a hidden gem with amazing food. Well seasoned, beautiful presentation and accommodating staff. This is a spot advertised for it's  2 for $18  Martini; although well made do not let deflect from the amazing spices and savory taste. 5/5 or 10/10 ."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keFUxaEVTR1JyZVUwMVh6WTFiRmxsVkhKeGJuYxAB",
            "text": "Went for MIL's birthday.   My first time, but wife had been once before.\n\nFood was really good!  No complaints at all. Had red snapper with jollof rice and brussel sprouts, wife had flounder with jollof rice and spinach.  MIL had cod.  Everything was well prepared and flavorful.\n\nWe were there for the 2 for 1 martinis.   Definitely had alcohol in them 😆\n\nManager was very friendly and accommodating.\n\nWould definitely recommend.\nHad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRFVEVlpUbVZLTTNGYVdHeGhTekJOTjFOUFdGRRAB",
            "text": "The food made me sick for 3 days..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeFEyaG1hR0pGVVU1eFNXRTFVRWt0T0RORU1XYxAB",
            "text": "Start with the octopus and thank me later!\nThe bar serves amazingly crafted drinks!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUk5GSnBTRXRyZFZkRlYyMWplSGxMZURrdFduYxAB",
            "text": "It was an amazing experience. The customer service is top tier from the entrance. The food was very tasty and flavorful. The food was exceptional and satisfying. I enjoyed the vibe and the music selection. Very nostalgic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMk0yRlVkM05hWTBoSFR6WlRSRXBOUTAxeVdsRRAB",
            "text": "Flavorful menu, friendly staff, and great music to set the atmosphere. I highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xod1pGRjBTRVUwZFZjelp6SmFTbGt3TjBwbWNYYxAB",
            "text": "The food delivers complete contentment. Most items show culinary knowledge. I observed the personnel were mindful. You'll sense the thoughtful design. I have to go back to upgrade my review."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUWEzWkNXazFrYTBWUlVYTklhRjlZZWs1R1lYYxAB",
            "text": "Me and my sister check in this hotel on Aug 13-20. Let me say this the front desk services sucks do you know on Thursday I did once so many people standing waiting for the elevators only one was working. I went downstairs to the front desk and informed them that something is going on with elevators and her reply: No we have no report on them out of order.\n\nMy reply was you don’t see all these people waiting and only one elevators working and now I am reporting the incident that your elevators aren’t working only one. She was all nonchalant about the whole situation. She looked at me so dumbfounded the customer service at the front desk has serious issues.\n\nReally sucks when you go into your phone please do not touch the water. They charge you seven dollars plus sales and state taxes. and they act like they given it to you because they don’t put no notice on that water saying if you drink it you would be paying seven dollars and they kept charging my American Express card and they wait till you leave to charge your card. You see this hotel room is so dusty that I had to take towel and dust. It was terrible.\n\nI would never and I come to New York every three months I would never ever stay in this hotel ever again. the service is really bad. They need a year worth of training. The staff that front desk is terrible housekeeper. I feel sorry for them because they have so many rooms to clean with only one person. Housekeeping doesn’t dust only change sheets and clean. Can’t blame them when you have only one housekeeper for each floors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUE5YVm1jRkIwVWtwYWRrNDRaMFowYTJjeGJrRRAB",
            "text": "Food and rum punch were excellent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSckxXeGxjVkl0ZFUxdmNXTnpiM2QzWkhwdGIyYxAB",
            "text": "I love this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcVpuZ3pUa1Z5VVZSbVZuVjBlQzF6U21sYVFrRRAB",
            "text": "The Hangar steak was delicious and cooked perfectly. Staff was friendly. Music was a little too loud but the selection was nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treFJsVktXQzF4Ym0xeWJUQjVUVVpQWW1KM1JtYxAB",
            "text": "This place is over priced and some of the restaurant staff rude."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeWVUTnhlbkJ2VUhkaE9UTkhSMHBITVRKRGQwRRAB",
            "text": "Delicious food and fantastic drinks. And the DJ was on point with the music"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelJWVldiMEpEUTBsUllsRTVhSGxmVEVFNGMwRRAB",
            "text": "We arrived for a 2pm reservation.  We waited 15 minutes for water to be brought to the table. One needed to be sent back due to something floating in it.  We placed our orders and waited 45 minutes for drinks (alcoholic and non-alcoholic). Although the food was good, it came out sporadically,  some items did not make it and needed to be removed from the bill. Needless to say, we contested the 20% gratitude that was added to our bill. It was truly a disappointing experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weFJEbHhObXBzWDFkMVkxWnFjblJITjI1VU4wRRAB",
            "text": "We had such a great stay- definitely booking here again. The location was phenomenal there is a M60 Bus stop 5 min walk from hotel that will take you to and from Laguardia Airport. Food, grocery store very close. Room was beautiful- view as well. They gave us 50$ credit for food however you could only use it once a day so really it was 25$ a day. Food at restaurant a bit overpriced but overall was yummy. Fitness center open 24/7. Definitely recommend staying here for your trip- 45 min walk to yankee stadium but the walk isn't bad at all. Thanks again for the amazing hospitality!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TGRXeDBVbDl6T0UxaVdEWjVXRFZ2UTJaNGJtYxAB",
            "text": "The atmosphere is great, a mixture of age groups from 30 to 60. The server Valentine has a wealth of knowledge and makes your time there very interesting. I had the lobster Max and cheese and the wings. Decent food. My cousin said the drinks were so strong they had her eyes crossed. Overall good experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZmVsbDBUVjl1VTIxRlRVRkhZVVUwU1RWNmFrRRAB",
            "text": "What a pleasant surprise!!!.. ended up here by accident..wanted a quick brunch..so we walked in because the restaurant we were taken to was closed..It was empty on a Wednesday at 1030am..it had just opened..we came in a little rushed and frustrated and still we were greeted with kindness 😀..The waiter promised we wouldn't be disappointed..and BOY was HE Accurate!!!! The Food was DELICIOUS to say the least..We promise we will return! I'm a Harlem native who hasn't lived in NY for 20 years..So I didn't know this place existed!! Now I do...Best Brunch food I ever had..and If you look at my reviews you'd know I'm a foodie 😋 😜"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVYxQnVSV05SU1dGU1FYbENPVU00V2xSTmFtYxAB",
            "text": "Normally love this place but food was too salty.  Maybe different chef idk"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2NVUnlWVkp4VkUxS1FubE9la2d0VVZoTFZrRRAB",
            "text": "I would like to say that this place was a whole vibe. Everyone should experience this place. I had a wonderful time. It's a true gem in Harlem.\n\nThe ambiance was exquisite, the drinks were hitting, and the food was amazing, and the server was so friendly and helpful, His name is Luyunder. I misspelled his name, but he  made our experience so great\n\nI would return again simply because of his great customer service, and the food was so fresh.\n\nI couldn't believe i was in my old neighborhood. It felt as if we were somewhere downtown midtown.\n\nNope, we were one block from where I was born and raised in Harlem 132nd 7th Avenue.\n\nMy new spot whenever I visit Harlem I will visit again. Thanks for a great time, Renaissance Harlem. I will tell all my friends to check you guys out for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFlsWlZMVEZIT1ZnelVUTnBkbGxRTTBvNVpsRRAB",
            "text": "Delicious!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYXQzWWZWNnBYYkpREAE",
            "text": "My boy Valentine is the best host, bartender, & manager. He definitely looked out for me and my homegirls. We will definitely be back ‼️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMk1UTmZhMm8zWTBzNFZ6bEJXalZrYUhsdlMyYxAB",
            "text": "Nice place...really nice manager Valentine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ2pvTFQ3OFBLbFdBEAE",
            "text": "The food was really really good surprisingly. Everything from the appetizers to the main course was delicious and well seasoned. The octopus, calamari, and codfish cakes were yummy. The 2 for 1 martini drinks were good too, ginger flavor was the best. The fish was so delicious 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQcWEwSmU5emNIZlNBEAE",
            "text": "I stood in the hotel as well as ate at the Victoria and the bar. First, the hotel room was not ready when I arrived for check in, they did upgrade me for the inconvenience however even the upgrade was not worth what I paid. Low beds, stained floors and disheveled carpet. I had an iron board but no iron. The Victoria was beautiful and the service was great. The food was ok but not worth the price $18 for 2 flavorless fish tacos, the drinks were worth the money. The bartenders were not friendly and looked like they really didn’t want to be servicing the community. Overall I give the experience a 3.5. Front desk and waiter staff was excellent. If you’re a Black single professional woman, happy hour here is definitely for you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPREswY0Nobkpid3p3RRAB",
            "text": "Listen I thought I was going to walk into a good experience but the food made me actually sick. I got the braised short ribs and only took a couple of bites and my stomach was on tilt for the rest of the nite. The meat wasn’t tender either it tasted like it was rushed and wasn’t even seasoned. I’m sad to say I spent my money on this experience. Will never eat here again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKUGtqTXJOa2FYWXhBRRAB",
            "text": "I wouldn’t go back very unorganized. The food had an unrealistic order."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcjlpR013EAE",
            "text": "Dinner was Delicious ❤️\nEveryone is very Nice 🙂\nValentine is the Best 👍🏾💛"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOakptcFA5bUtpanl3RRAB",
            "text": "I want to start by saying the food was not horrible but it was not worth a 2 hour wait for it AT THE TABLE. We were seated within 30-40 minutes outdoor of the restaurant and waited 2 hours just to receive chicken and waffles! The service could’ve been a lot better. While waiting I noticed a lot of people walking out saying the food was nasty, people complaining about needing things removed off their bill and by time I was nearly finished eating I realized they weren’t wrong! My chicken had green stuff in it but maybe not nearly as much as the other person since I didn’t notice until way after. We ordered bottomless mimosas and let’s just say it’s better to just order single drinks. Within that 2 hour wait they came to refill ONCE although I kept calling for them to come. By time my food came I just wanted to rush my drinks when they came by so I didn’t need to wait another 20-30 minutes for them to come by asking if I wanted my glass to be refilled (HELLO ITS BOTTOMLESS MIMOSAS) that’s the point in ordering that. I also noticed they had about 3 different menus offering the exact same things for different prices! They had a Mother’s Day brunch menu stating $70 pp while another menu with the same things was $50 pp and another menu showing sat-sun they had $25 brunch! Those are all huge differences if you ask me. Overall, it just wasn’t worth it. And I’d go somewhere else for anything before I return back to this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQdUd2ZVR4cDhTUlJnEAE",
            "text": "We waited an hour just for water. And when we finally got the unlimited mimosas they were lukewarm. Then my cod fritter was cold in the middle, like freezer cold. It was disgusting. We walked out starving. Happy Mother's Day to us...😒"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcUU4UEQ3dThHMzlnRRAB",
            "text": "Love it! Food never disappoints!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKSHM1UDNhbzdPXzJ3RRAB",
            "text": "I knew about this place for 4 years, never tried it. Decided to try it today and asked for a burger, which 27 dollars is a bit outrageous. The taste of the burger was off, I asked for medium and got super rare, basically raw. I'm absolutely not satisfied for the price I paid, I knew I should have not come here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLXZxckc5OUpDSEhREAE",
            "text": "We had a good time at Renaissance Harlem. The drinks were strong, app'tzers were large portion and the roasted chicken, plantains and jollof rice was amazing. Our waiter was friendly and kept checking on us.\n\nWill be back to try other menu options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNekRxYlBCM2JyRW1RRRAB",
            "text": "The food service was ok . There is one particular server Alicia  she is the best . She went above and beyond to satisfy us"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbnVfQVBBEAE",
            "text": "La nourriture était très bonne et le personnel très sympa. On a juste été un peu surprises car   nous avons eu l'impression qu'on a poussé à sortir assez rapidement du restaurant alors que nous avions à peine terminé de manger le plat. Nous aurions souhaité des desserts mais on nous a amené la note avant. D'autres personnes ont tout de suite pris notre place après nous. Pour résumer, la nourriture est bonne, le lieu agréable et le personnel sympa, mais le service est un peu trop rapide pour ceux qui souhaitent prendre leur temps et manger un dessert."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTV6dUpREAE",
            "text": "What a great find. It's not your typical African restaurant, though the people who work there are African. It's got an incredible range of food from chicken and waffles to Moule Curry Coconut (that I had). Every one of the four of us loved the food. The Curry was perfectly spiced, and the menu choices outstanding.\n\nThe staff is outstanding... and the manager... from Nigeria and his name is Valentine... was so incredible, that I'd go back just to see him again. Good selection of French wines... and the only defect is no African beer choices. (Tusker, please!) Maybe the tariff was too high.\n\nIf you're sensitive to noise, it's better to sit outside. There's a nice enclosed outside area. Inside can get a little loud, and sometimes there is live music. Except for that, you'll love this place. We'll be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcTZPbXZRRRAB",
            "text": "Last night, I dined at Renaissance Harlem\nand it was a delightful experience. The ambiance was warm and inviting, perfect for a cozy evening. The service was attentive without being intrusive, making the entire evening enjoyable. Overall, I highly recommend  Renaissance Harlem  for anyone looking for a memorable dining experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWNtbE5REAE",
            "text": "The food at Renaissance Harlem is definitely delicious. I had the chicken and waffles, and it was so good — definitely hit the spot. I went on Easter Sunday, so it was pretty busy, but the wait wasn’t too bad.\n\nThe DJ had the vibes on point — the energy was lively, but not too much, just the right vibe.\n\nNow, the only downside was the service. Drinks took forever to come out. I was already halfway through my meal before I got my drink, which was a little annoying. Our server also seemed to not be able to keep up. So for service, I’m giving them a 2/5.\n\nI’ll definitely be back. If I’m craving something good in Harlem and it’s not a super busy day, Renaissance Harlem is the spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWVieHF3RRAB",
            "text": "The most understated amazing food experience you'll ever have.. For me?! The Brazino! Aka.. The Godfather! Look for Valentine... He'll bring you magical Libations in a glass! Ase-O!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc3N1WVRnEAE",
            "text": "I love it. I want to go back, but…But Renaissance Harlem is hardly perfect. Let me say first of all that it was lunch on Easter Sunday; therefore, it is possible that the place was a bit of a madhouse. I had a 1:00PM reservation and our party of four was seated at 1:45. Not good. The music was good but way too loud for lunch. We could barely hear each other talking. The manu was terribly confusing with a bottomless brunch that was hard to understand what items were included in the prix fixe. The drinks came out staggered with one person waiting for fifteen minutes before he got his mimosa while the others got their drinks. Finally: the food. How on earth I ended up ordering a “special” seafood dish for brunch/lunch that was $43? Why was there a $2 overcharge for the shrimp and grits order of one of my friends? Very confusing and not straightforward. I look forward to giving it another shot on a “normal” day to see whether the confusion was an accident or the norm."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbU5uRE5nEAE",
            "text": "Truly stunning hotel, let down by awful staff!\n\nI arrived at the hotel around 1:30(PM) as Booking.com said Checkin was 3(PM), I am then told Checkin isn't until 5(PM).\n\nThey managed to check me in around 2:45 - which was great and very appreciated. Getting to this point was tough as the staff were rude and annoyed.\n\nUpon checking out, I was billed another Incidental fee - which came out of my bank at checkout. A further $250 for a one night stay. I questioned the staff and they said it wasn't showing up on their system and said it was a mystery even tho I was showing them my banking app. No clue on if I will get the 500 back & truly terrible staff.\n\nGreat hotel let down by a bad team.\n\nps. Toilets are just in the room, no real door. Beware."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdF9HWW1nRRAB",
            "text": "I was recently there, and my first time eating at this restaurant. I must say that everything we other was delicious. I recommended. I definitely would go back.👍👍👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbDRybU5nEAE",
            "text": "toilet brush on my bed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHZEM2pnRRAB",
            "text": "We went for Brunch and the food was great. Music was even better"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbm96RjdRRRAB",
            "text": "I love renaissance Harlem!! Valentine is amazing, he had me laughing the whole time and his customer service is top tier!! The food was good and that rum punch was strong but delicious!! Yall better come here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN3RQQmVnEAE",
            "text": "Pretentious and cramped atmosphere and menu."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOWZ6aUhBEAE",
            "text": "Room wasn't as spacious as I would've liked, but the atmosphere in the social area was great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aGIzb053EAE",
            "text": "Very good food and vibes💜"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dnF6RUx3EAE",
            "text": "Went for dinner. I had the cod fritters for appetizer - they were delicious, especially with the accompanying hot sauce. My entrée was the Black Sea bass which I paired with Brussel sprouts and sweet plantains. The fish was absolutely delicious. My only critique is that the Brussels sprouts were a bit too salty.  All in all, I cleared my plate and that saying a lot as I am a picky eater. Highly recommended and I will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b29EOFR3EAE",
            "text": "You want a great dining experience? You want the best Jolof and grilled chicken in NYC? Then this is the spot. It’s the one spot in Harlem where you know you’re eating at one of the best spots in NYC. It’s a spot where senegalese chefs are doing an unbelievable spin on American cuisine in ways you could never imagine."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c0libGh3RRAB",
            "text": "I love this place"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdDdfTmFBEAE",
            "text": "음악 좋았고 맛있는데 가격은 비싼편"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbUl6VDR3RRAB",
            "text": "Went for brunch. Service was good. Food was 6/10. French toast ($19) was overdone and burnt on the outside (see pics). Why didn’t I send it back? Didn’t have enough time, already hungry. Mushroom omelette was better. Won’t be back for brunch….may give them a try with lunch/dinner. $58 overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c2VlbGFnEAE",
            "text": "I haven’t been here in years! Last time I came here was for a new year’s eve event and I forgot about this place but Im so glad I returned here for breakfast. The server says it gets busy on a Sunday for brunch around 1pm so I was glad to beat the crowd and enjoy the quiet time with my family. I made a reservation just in case anyway which was easy to do online.\n\nAll in all, The food was really good. We barely had any left over to take home. We had the cod Benedict, chicken and waffle and veggie burger. All delicious options and I knew I would come back because there were so many options on the menu to choose from.\nOne note I would make is the food was fried a little too hard so if you’re like me make sure you request a soft waffle and easy on the fried foods. Other than that it was great.\n\nThe sangria is a silent killer! It was very tasty and strong. We ordered a craft but one glass was good enough for me. So if you’re a light weight, be careful.\n\nThe service was pleasant, efficient and we were very satisfied. The decor is a little worn and some of the plants look like they need help but the food is undeniable and the prices were reasonable. I would 100% recommend this place and I can see this as a gem in Harlem. Thank you!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNUxURnJnRRAB",
            "text": "Harlem, NYC, is an experience like no other. On a Monday evening, we decided to hit up the Renaissance Restaurant after our recital, and let me tell you, finding it on Google Maps was a breeze thanks to all the glowing reviews.\n\nStepping inside, the decor hit that classic NYC vibe. The atmosphere was alive with a guitarist belting out tunes, weaving a soothing soundscape that made the whole dining experience feel relaxed and inviting.\n\nNow, let’s talk food. We kicked things off with the carrot and ginger soup, which was a standout. Seriously, I can’t recommend it enough—it’s a must-try! However, the rest of the menu fell a bit flat. We sampled the fish basket and empanadas, but honestly, they were just okay—nothing that set them apart from the countless other eateries in the city.\n\nWhat truly made our night was the service. Our waiter was a gem; super attentive and genuinely patient, checking in on us multiple times to ensure we had everything we needed.\n\nBut let’s get real for a second—the prices felt a bit steep for food that didn’t quite live up to the hype. Harlem is vibrant and full of culinary gems, and while Renaissance has its charm, it could definitely work on elevating its food game to match the atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dk9xRGpnRRAB",
            "text": "Finally got to check this place out. Went early evening on a Wednesday so it wasn't too busy. Decor is great, the outside is a bit deceiving as it looks dark but inside is totally different.\n\nService was prompt and friendly.\n\nOrdered the fish special and the fish & chips. Both were great with the fish and chips as one of the best I've ever had. Not sure what type of fish was used....but the portion size was two huge filets and they were cooked perfectly with a crisp outside and juicy inside.\n\nFrench onion soups was also delicious with the right amount of cheese on top. The Carrot goners soup also good. Both were piping hot so be careful!\n\nI'd love to go back and try other things on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aHVXOU9REAE",
            "text": "Heads up, this place is not to be confused with the hotel! Wanted to put that out there since it can be easily confused. We went for Wednesday night bottomless drinks deal. It includes two appetizers. My review of the food is based on appetizers we had, as we did not order entrees.\n\nHere's what I liked - the calamari! Might want to get extra if you have a larger party. The hot sauce for it is delicious! (Calamari is not included in the deal) I also really enjoyed the wings. The people next to us said they really liked the octopus. My drink was delicious. The Bissap Martini! My friends also agreed that it was so good! Also had the truffle macaroni and I would skip it next time. It was more similar to a boxed macaroni than the southern baked style.\n\nI liked the music and it wasn't too loud. The restroom was clean, but unfortunately there is only one of them and when you are having bottomless drinks...you get the picture. The venue is on the smaller side, either make a reservation or get there early. It started filling up after 7PM.\n\nVery, very nice staff. However, service is slow and some of our drinks were forgotten, however they made up for it through extending our bottomless a bit. I'm all about good customer service and if a restaurant works to fix things, they're all good in my book.\n\nValentine was super nice and engaging. And the restaurant had a total friendly atmosphere. People were just happy and dancing to the music on mild Harlem night. I don't get uptown often, but this was worth the trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqejZTVURnEAE",
            "text": "The food was plenty & flavorful, and the service was good. There is lots of indoor and outdoor seating available.\n\nPros: the calamari legitimately melted in our mouths so we had to have two orders. The jollof rice and sauce was out of this world.\n\nCons: the atmosphere needs some sprucing up/redecorating. The lights on the windows and the colors on the walls are a bit drab. The music was strictly off of someone’s phone and it would’ve been better to have a set playlist."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdWNfYVh3EAE",
            "text": "Very nice restaurant right in Harlem.  Great vibe and fantastic food.  We went in for a Sunday brunch.  The food did.l not disappoint.  The menu was great with decent variety.  My daughter got the waffles, my wife got the classic eggs Benedict, and I got the seafood basket.  Everyone enjoyed their food.   The coffee was quite good as well.  Pics of the food are attached"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcUtYUm93RRAB",
            "text": "Pretty good brunch deal here. The staff were definitely nice and accommodating. I did the bottomless rum punch. The rum punch was strong but smooth and flavorful delivering quite a punch. As my entree I had chicken francaise that they put their own spin on and that was literally one of the most flavorful pieces of chicken I’ve ever had. Every bite was bursting with flavor. Definitely recommend for bottomless brunch vibes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX0xULVRnEAE",
            "text": "Our initial server wasn't great she reminded me of the parody of the server at Jamaican restaurants. But towards the end of our meal a lovely young woman named Amina started helping us and she was fabulous. The drink was really good. The waffles were thick and dense which I like. The chicken wasn't good it reminded me of Tyson s frozen chicken but that's the only thing I didn't like. The dumplings were good and the African hot sauce was amazing. The seafood basket was pretty good too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpN3JmTHJBRRAB",
            "text": "We stopped by for dinner couple of weeks ago. They had outdoor seating, enclosed outdoor seating and indoor seating. We chose the enclosed outdoor seating area. Valentine (I hope I'm remembering his name correctly) was very attentive, he…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhLU9udURBEAE",
            "text": "The roasted chicken was wonderful. The Lasagne was prepared differently than what the person had imagined it. Seemed more like a vegetable soup. The chicken sandwich was not very good. The serve was good and friendly. They had a full bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM09iWmR3EAE",
            "text": "Fish and grits with tomato and coconut jam was incredible, so much flavor to the grits, and the warm jam (a thick sauce) on the crispy fish was delightful to all the senses. Portions were large. Service was fabulous, the host, waiter, and bartender all checked on me at appropriate intervals. Water was attentively refilled. I felt welcomed and valued as a customer. The atmosphere is classy enough for a special night out, yet it still felt like a place for family and friends, very comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdF9uYjJRRRAB",
            "text": "I had the hanger steak and roasted red potatoes with spinach and mashed potatoes on the side. My daughter had the delicious sandwich with asparagus. It was juicy delicious, labor, full, and amazing. The service is great.  Thank you, Renaissance Harlem for a great meal and I travel from the Bronx for this"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5di15cS1nRRAB",
            "text": "I went here with friends and my husband for my birthday for the first time. All I can say is WOW!! My food was amazing and the service was even better. It was not a lot of people in there so I don’t know if that is why we were treated like queens and kings but the service was top notch. I started off with the grilled octopus and then had the lamp chops. Yum yum yum!!!! I’ll definitely have to come back. They even played music we wanted to here. It was a very nice vibe. The inside is very cute and intimate. They also have a closed indoor eating area. Vincent was our server and may have been the owner but was amazing!!! Thank you so much for making me feel so special on my birthday!!! Please go to this little gem and get your grub on!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcUx5RWxRRRAB",
            "text": "I ordered the lobster ravioli with a side of asparagus, my friend ordered the salmon with mash potatoes and her sister got the lobster risotto with a side of spinach. For appetizers we ordered shrimp dumplings. Everything was delicious and the portion size was filling. They have a bottomless brunch for $25 per person which consist of mimosas and red or white sangria. The place is a little pricy and I'd give it a $$ out of 3. But the food and service is well worth the price."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNmJlSVBREAE",
            "text": "My sister and I were walking by and the music was so good we decided to pop in. The food was amazing and the service was outstanding! Valentine tended to us and was a delight! I had the braised short beef ribs and my sister had the snapper; Both were delicious! The ribs were so tender and melted in my mouth. We will definitely be returning and I would recommend this place without a doubt!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaF8tVk5nEAE",
            "text": "This place was phenomenal!!! Service was wonderful and the food was even better! Me and my friends were visiting the city and we wanted a late night bite and this place is perfect & had good music!\n\nValentine was awesome and super sweet to me and my group! We will definitely be coming back :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoajdmZ0dnEAE",
            "text": "My wife reviewed this restaurant and suggested we try it out on our trip to city. Our daughter lives here now, so we're here often and are getting to know our way around (1st grand baby stuff) 👶 ❤️ Well when we walked in the Playlist was classic R & B from the 70 & 80\"s  and I mean the stuff that'll take this date to another level after dinner!! Please don't be to holy for that one!!! Yall know what I mean!!! We started our meal with a french onion soup for me ...delish... and she had a carrot ginger bisqueee type of soup.....wowww...And to top it off.....a Mushroom risotto for her and a ... get this....LOBSTER BLT with truffle fries for me boy oh boy!!!! It was the perfect spot a glass of white sweet really had her indulging in my company and I gentlemanly handle a very good  HOUSE IPA 👍 👌  And as you can see by this review I had it all going my way through the rest of the 🌙 🌃!!!  🏆WINNER!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaODY2ck1BEAE",
            "text": "Surpassed expectations. We tried the famous waffle with chicken, with syrup, and I must say that against my expectations, it was GREAT. Carrot soup is also amazing. Excellent service, great music and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb04ySk5BEAE",
            "text": "The music was decent and the atmosphere. The service is slow; however, the manager helps with the serving and makes sure everyone is satisfied. Happy hour prices need to be clear on the menu.\nAppetizer: chicken wings and chicken dumplings\nThey were delicious and the chicken wings were nice and crispy\nChicken dumplings were also delicious omg actually my favorite. I will go back to get chicken dumplings again.\nI had a side of Jollof rice which was a little spicy but good.\nDrinks:\nSangrias omg it’s different and strong but I loved it !!!! The margaritas were refreshing.\n\nI still recommend trying this restaurant just make sure you have patience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUX3NyQXh3RRAB",
            "text": "I was disappointed in how long we had to wait for our food which was over an hour. I said I'm allergic to tomatoes and they cooked the shrimp in tomatoe sauce. It was supposed to be grilled. The grits were hard. $65 gratituies was insane and was not worth it. The DJ was dope!! Atmosphere is nice! Avocado toast with salad was slamming!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcEszNE53EAE",
            "text": "It was my birthday and I was looking for a special place to celebrate in Harlem as we were going to the Apollo for amateur night.  I am born and live in Jersey and consider myself to have been raised in New York because the time spent in all four boroughs from my college days to now. After reviewing the restaurants in the area, and making a reservation at a very popular soul food restaurant, I cancelled it several days later after coming across the Renaissance and making reservations.  It is a very intimate island like ambiance and they consider their cuisine to be French American with an infusion of African flavor.  Our waiter who also doubled as the host was very personable, engaging and extremely helpful with the menu.  We ordered the lobster macaroni and cheese as an appetizer and it was simply to die for!!  For entrees, my wife ordered the leg of lamb and had the red snapper.  The lamb was served with couscous and my snapper was served with a special African rice that was amazing and perfectly cooked leafy spinach.  When I tell you that everything was seasoned and cooked to perfection trust me! For those of you who love hot sauce our host introduced me to their homemade hot sauce!  We know hot sauce is hot, however this sauce had flavorful taste that did not disappoint. As you will see in the pictures this how we eat to live! Overall, I give this restaurant 5 stars and it was a perfect choice for my special day."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M05ldG1nRRAB",
            "text": "Food and drinks were amazing, but the service definitely needs improvement. We had a reservation and no one asked us about it. There was a loud and lively bridal wedding party inside and we kinda felt like the forgotten stepchildren in the outdoor dining space lol. For the reason, we kept getting the wrong food to our table and it was kind of sad and depressing in that dark corner. Also, the seating outside was very uncomfortable, as I got a charley horse from sitting so low in that hard a$$ chair lol. Prices are $$$, so the service and atmosphere need to match the impeccable food. Also portions could be more for that high price point. Decent spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwanFtWl9nRRAB",
            "text": "The food was incredible! We had Shrimp and Grits, Jollof Rice, and Octopus and it was amazing. The shrimp and grits was in a creamy tomato sauce and…omg. We can’t wait to go back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcThEcXZBRRAB",
            "text": "I went here for the first time to eat lunch and to support B.O.B. The food was okay. I had the chicken shawarma meal. I also had the jollof rice. It was a bit spicy but still edible and tasty. (But I do enjoy the Nigerian JR more ☺️). The service was great. But the decor of the place is a bit frayed and the wood floors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeW8zYmV3EAE",
            "text": "We were there Christmas Day for brunch. We found comfort at Renaissance in food and spirit. Everyone was accommodating and the food was amazing. We had the grilled octopus to start which was served with potatoes, Brussel sprouts, and spinach. I had the salmon for the main course and it was cooked and seasoned to perfection.  A great find. They had a dj there so it was a little loud for my tastes but the music was good. I'll definitely be back."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbTR6RkhREAE",
            "text": "Definate upgrade from the previous restaurant that was here. The codfish fritters was pretty good. I especially enjoyed The Loster Hash. Friendly staff, comfortable environment, and great food will result in a successful business. Great job all around!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1ejhMM3VBRRAB",
            "text": "Visited last Saturday to hang out with cousins. Had a good night. Nice vibe, nice atmosphere Mr. Valentine I believe is the manager he also waited on us. Nice guy. Food was really tasty. Definitely plan on coming back another time."
        }
    ],
    "reviews_count": 79
}