{
    "name": "Bistro Casa Azul",
    "place_id": "ChIJ9QMGGLP1wokRWTLdV87xzp8",
    "grid": "MN11",
    "address": "343 Pleasant Ave, New York, NY 10035, USA",
    "rating": 4.7,
    "user_ratings_total": 162,
    "phone_number": "(917) 805-0803",
    "reviews": [
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScllsQXRNekEwWmxkbFdsTkNabEY0YUVwMVFXYxAB",
            "text": "Amazing authentic food. The black beans are the best I’ve had outside of Mexico. Fantastic margaritas made with real ingredients instead neon mix like almost everywhere else. The owners are lovely. This place is a gem."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFlrdFVNbDlSVTFKaWFFdFFTSEpIU0RGVVNIYxAB",
            "text": "Very pleasant atmosphere. Courteous staff and great food!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWlFYcFdhRWxqUm1aNFNHdEdVbnBRTlY5WlJVRRAB",
            "text": "Great food, music and service. We had a wonderful time, for brunch"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmFYWllaRXc0ZVZrMFFWWktYM0JVVUhJNFoxRRAB",
            "text": "Absolutely lovely little family style resto. Tacos are amazing. Would always support good people and authentic food."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdks3czdBRRAB",
            "text": "Never disappoints. The food has always been top quality and cocktails have a hearty pour.\n\nIt’s refreshing to have real margaritas and not wine based ones you find in the area.\n\nTheir blood orange and watermelon are yummy.\n\nThe patio is charming, and the inside as well.\n\nMaria and Lou are gracious hosts and always make everyone feel welcome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbXdsSkdmellqZHVnRRAB",
            "text": "My go to spot to get together with neighborhood friends to enjoy a delicious meal and amazing margaritas. The owners Maria and Lou are always welcoming!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUVVtTjBkVzB4VXpWb1JrRkxObVp5UTBVNVZuYxAB",
            "text": "Love this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdUIwc3JGNWM3bUNBEAE",
            "text": "Incredible neighborhood gem"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPQ2lxOXkyZ0lIeUhBEAE",
            "text": "Over all the place was a great spot to\nEnjoy with fiends ! Great jazz music , a mix of Mexican and Spain cousin , but lately food quality when from 10 to 3 , wine quality still great quality, not a family restaurant. It’s more like couple , And adults get together place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMlBYTXJRRRAB",
            "text": "Lou and Maria have made this my favorite restaurant to stop by in New York and the primary reason that I’ve stayed in East Harlem. The food is excellent, the regulars are wonderful, and the atmosphere is perfect."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNktpY3V3RRAB",
            "text": "Went on a whim and so glad we did. Food and drinks were tasty and fresh. They were so friendly and accommodating to our 18 month old. Including playing a song with her name in it! We highly recommend and plan to come back with others to share this delightful place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnclAzb0dREAE",
            "text": "Amazing Service!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGZ2ZDJBRRAB",
            "text": "Great place need some old school Italians from neighborhood to give it a try"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaXI3ZmdRRRAB",
            "text": "This place is  1000% amazing. Everything about it says come inside. From the art, to the smell of the food down the street. It does not disappoint. Go inside and enjoy the food , staff, and atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHZEVElREAE",
            "text": "What a fantastic restaurant! Food and service are incredible. The atmosphere is impeccable; cozy & quiet. The tacos were AMAZING."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzlyRGZ3EAE",
            "text": "Delicious!! Yum! Get everything, even though I haven’t tried it all, I bet it’s all great!  I had grilled shrimp (gamba alajillo) and the special and the ceviche and the margaritas were sublime!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeHBuQkpBEAE",
            "text": "Great Margaritas and brunch !! Please get the Poblano Paisano stuffed pepper ... Also if you ask nicely you may be able to choose between Santana and Led Zeppelin tunes...\nSaturday is Paella night, call ahead to reserve.\nA classic food item is the Poblano with meatballs. You can't go wrong with anything on the menu. Cash only.\nAsk Lou to make his Margaritas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId29HcHpnRRAB",
            "text": "Celebrated my dad’s birthday here and we had such a good time! The food was amazing and the service so friendly. Can’t wait to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMU5TTzFRRRAB",
            "text": "Completely satisfied can’t complain will be back !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcExHa1NBEAE",
            "text": "Great place to eat great food great environment highly recommend to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeE1XVmd3RRAB",
            "text": "Excellent customer service 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeEtHNEJnEAE",
            "text": "The perfect spot for a great meal and a glass of wine! I've enjoyed watching World Cup games, getting to know the vibrant East Harlem community, and, most importantly, savoring Maria's incredible dishes, topped with her signature spicy sauce. ❤️ And while you're there, don't miss out on Lou's freshly juiced, mouthwatering tequila margaritas!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bTYteXRBRRAB",
            "text": "Bristo Casa Azul is a must try if you are in East Harlem, Manhattan, or anywhere in the 5 boroughs make the trip!! They are our go to after big races and never disappoint!  The owners are the nicest people and value our community and the food is amazing! The guacamole and fresh chips are a must and the TACOOOOHHS are the best! My favorite, ALL of them! Everything is made fresh and is absolutely delicious! It’s so good even our toddler approves! So make the trip to East Harlem and bring your appetite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOE56a0V3EAE",
            "text": "Walked all the way over here for them to be closed despite the restaurant time saying 12-10pm, very disappointed. Do not recommend, it’s currently 12:24pm smh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNjlpcVlBEAE",
            "text": "This is the best Mexican food I have had in a very long time … the best anywhere north of Texas for sure.\n\nThe menu is diverse (with items you cannot find elsewhere like a Mexican take on ceviche).  They also have a children’s menu and were so willing to accommodate our family’s requests.  While all the food was amazing I want to highlight the salsa (they need to jar and sell it -it is the best) and the fresh homemade tortillas (both corn and flour).  Everything is great but if you’re not sure what to order you can’t go wrong with the tacos - for the tortillas alone are incredible.\n\nThe service was also incredible- the owner (maybe or manager?) was so welcoming and warm with us it took an amazing meal and made it even better.\n\nThe restaurant itself has really cool ambiance with varied seating and spaces.  It’s large and comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOTY3RE93EAE",
            "text": "Incredible restaurant! The food is amazing, the service is impeccable and the place is cozy and quiet. I have nothing negative to say about the place. Lou is a sweetheart and we ate the best taco's we've ever had (and we've spent considerable time in mexico) I wish I could give more stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdDlpMmJ3EAE",
            "text": "WOW - my partner and I ate here today and I can’t stop thinking about this meal. We were in East Harlem doing some furniture shopping when we got hungry. We’re not super familiar with the neighborhood so we almost took the train elsewhere and I am SO glad that we didn’t. That was truly the best margarita I have ever had and I’ve had plenty, and it was the best guac I’ve ever eaten before as well. The fish tacos were SO good. Service was awesome, I’m sorry for not getting your names but just know that you made our day!! I can’t wait to come back and bring friends, such an awesome and perfectly decorated space and you can just tell the food is made with love."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MTRUdU5BEAE",
            "text": "My favorite spot in East Harlem/El Barrio. María makes DELICIOUS food- from her guacamole to her tacos to amazing brunch options. And Lou always has the perfect drink to accompany whatever you order. The environment feels like home from the first time you walk in, a true community/ local spot that you keep wanting to come back to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6LV9mc2RREAE",
            "text": "Delicious Mexican Latin food with fantastic service . When I went we ate outside on a sunny day was a great time. Definitely a great date spot or special day spot!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX2J2MFBREAE",
            "text": "We have been loyal customers for a few years now. Maria and Lou are wonderful hosts and the food does not disappoint. There are many delicious entrées to choose from but their specials are always on point.\nLou makes the best margaritas. The restaurant’s decor, accentuating Frieda Kahlo is really lovely, warm and inviting. We both had our 60th birthday parties there and Lou and Maria did accommodate us and make us feel like Family.  It is a lovely neighborhood spot to meet locals and interact with East Harlem residents."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dV8zdzNnRRAB",
            "text": "Love Bistro Casa Azul!!!  Best food around!!  I wish I lived closer but always amazing when I can take the trip from LI.  😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OGR5NHN3RRAB",
            "text": "Excellent food, excellent people, and a great vibe. With all the options of quick Mexican food in the area, this place goes the opposite direction and slows things down for a wonderful and authentic Mexican fine dining experience. The owners are really down to earth and personable, and are truly passionate about what goes into the menu. This is my first choice of restaurant in the area for a night out or for a happy hour drink, and I'm happy to say that I've been going for years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c3VxTnBBRRAB",
            "text": "Terrible service. Would not recommend at all. Incompetent staff that drank on the job instead of waiting on customers\n\nGroup of 5 sat outside. We ordered a round of margaritas and they were good. It was about 6:20pm on a Saturday, and we asked if we could order food. They said the kitchen was not open but would open around 6pm - we said it was 6:20pm and they said it would \"actually\" open at 6:45pm. We decided to wait because the drinks were good so we figured the food would be as well.\n\nWe asked after 1 round of drinks if the kitchen was open, he said just for chips, salsa, and guac. We ordered some of that and ate it happily. After sitting there for over an hour with no word from the waiter that the kitchen was open for dinner (the waiter was sitting on the table outside next to ours drinking a cocktail, not bothering to come and refill our chips), we decided to grab tacos from a nearby restaurant and bring it to our outside table.\n\nOnly after we ordered tacos from another takeout spot did the waiter finally come and tell us the dinner menu was open - note that it was past 7:30pm on a Saturday and we had asked twice already if we could order dinner.\n\nHe said we aren't allowed to have outside food and made it very awkward, stating that it is hard to run a small business and that is why we weren't allowed to bring outside food in. I responded that we had been ordering multiple rounds of drinks for over an hour supporting their business, only getting other food because the dinner menu was not being served.\n\nThe waiter was incredibly rude, saying that we were messy and making him clean up after food that was not their restaurant's food and he even resorted to asking me questions like \"what I did for work\" i.e insulting my character and implying that I have no idea what it would be like to struggle or run a small business. I wish I had responded \"you let us sit here for over an hour with no dinner service, and if you had let us stay here and eat our takeout we would have ordered many more rounds\".\n\nWould not recommend this restaurant to anyone. Terrible service, rude staff, and a haughty taughty vibe even though it was completely empty besides us.\n\nP.S. two other weird things:\n- We asked for a chip refill and with our salsa and he said \"well, you're going to have to pay for it you know\" in a condescending tone (we would have been happy to pay and we assumed we would have to, but the tone was unnecessary)\n- The bathroom had a sliding door and after I went the waiter asked me to please close the bathroom door after going to the restroom because it would disrupt the vibe of the restaurant (there was no one inside, literally 0 customers besides us)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMXVDanlBRRAB",
            "text": "Great place! Good food, good drinks, great people. Love the atmosphere and the owners are amazing!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbDhTbUVBEAE",
            "text": "Bistro Casa Azul has welcoming staff, beautiful space and delicious food - with plenty of filling options for vegans, vegetarians and pescetarians.\n\nIt’s a great destination for everything from cocktail dates, group dinners to events / parties (through catering or by booking the restaurant).\n\nAlways a pleasure to support this small, family-owned and family-run business as they provide warm hospitality and memorable meals!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeDZUYmxnRRAB",
            "text": "Excellent service! The food was Delicious . The ambience and music was the cherry on top. Will definitely be visiting again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjVfdm5BRRAB",
            "text": "The food was amazing. Very small intimate place with excellent service. Only one issue ~ hot sauce is not hot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5a3NTUHp3RRAB",
            "text": "Haven't been in a while but the memories last a lifetime😆Great people! Great service! Great food! Always feels like home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d0pTdjR3RRAB",
            "text": "The service was excellent. We sat at the bar and ordered take-out. The owner made recommendations and one of the very best margaritas I've ever had. We split the Filet Mignon Au Gratin and the Chicken Stuffed with Plantain..The food was absolutely delicious. High-quality ingredients at the hands of a chef who knows flavors and textures made each dish perfect. We also had black beans and saffron rice and sauteed vegetables. Everything was fresh, well-balanced and tasty. The atmosphere is cozy and pretty.  I can't wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMWZQR2xBRRAB",
            "text": "So I’m here to say I love to leave a review on my experience but  Bistro Casa Azul is amazing and it deserves more then just this review I here to say food 100% drinks, service, Decor, it’s all worthy and it’s welcoming things alot of places to Dine-in  lack these days I had a wonderful time I will be back !!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ejRpOGRnEAE",
            "text": "Just wanted Spanish Harlem to know if you go 1 or 2 blocks in any direction you gonna find a lil hole in the wall spot that will blow your mind. Pleasant Ave, will be one of those blocks & Cafe Bistro Azul will be the spot. This husband/wife couple ran location is definitely pointed into Mexican cuisine. But old school great grandma gave grandma gave momma recipes. Ask for Lou the owner he will stop everything to greet you with open arms and welcome you to his home. And I'm pretty sure wife Maria will come out from the back, she's the cook! Just to make sure your taste buds have been satisfied. Keep up the beyond amazing job you two. And come down, bring the doggies, they have outside area as well. And by the way I'm not a fan of reviews, and yet this is something I felt needed to be said. Enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWM0s2NmFnEAE",
            "text": "Went to this location yesterday for my company’s holiday party. When I tell you this place was a disaster from start to finish. I stayed for an hour hoping this would get better but man it never did and I decided it be best to leave then lose my mind towards the owners who provided us a terrible experience. Firstly, we had a party of 15 people and were offered two packages one being $40 which included buffet style meals the options of  food were -GuacaMonica and fresh Tortilla Chips, meatballs in Salsa Chipotles, Flautas Doradas de Pollo, Fajitas de Pollo con tortillas y Arroz Azafran. Sounds good right? At least that’s what I thought. Then the second package being $80 which allowed you to part take in the buffet style meal and also open bar for 2 hours. Still sounds good right? Well it turned out this was a disaster. Firstly this buffet style meal was a total rip off!!! These items were offered in miniature size … they weren’t even things you could make a meal out of they were appetizers. Which was never told to us. For 15 people the amount of “appetizers” was not enough. They put 2-3 bowls of meat balls now the size of the bowls were small. These bowls they put out combined  wouldn’t have even filled a small metal tray that you would use when you make food for events. So that’s to tell you how much food they actually gave for 15 ADULT People. The chicken fajitas were not served with any tortillas or rice as they advertised to us. We just got fajita meat and again similar to spicy meat balls small bowls. Not even a full small tray which was crazy! The flautas were miniature size and similar to everything else. I think what they gave wouldn’t have even been half of a small tray. And guaca and chips again small portions. 4 small bowls not even cereal size bowls of guacamole with chips. For the amount of money we spent. For what it cost them to make the food they served us and what we paid. We were definitely robbed. And on top of that we weren’t supposed to even sit down. They expected us to stand because the owner Maria when I asked her where I can sit she said that this is a mingle party you don’t sit. You grab some appetizers and walk and mingle.  Why in god name would I go somewhere to stand for two hours. And eat standing. That is sooo ghetto, when my coworker who planned the event with the owners asked Maria about the rice and tortillas, because they never served us this. Maria gave the response if that was included you would have saw it on the table. When in email and text changes this was what was said and promised to us. So they don’t even follow what they promise and then they have the audacity to give you attitude when you ask about why are things not there. Totally unprofessional, also another thing a week prior to our event they tried to raise our prices. How professional is that. That’s not how any establishment should do business. My company has been in the area almost 15 years so we are very big on eating at local establishments to support businesses in our area. But this was a terrible evening. I left paying $40 and did not have even an actual plate of food. I left hungry disappointed and upset. I will never come back to eat at this place. I would never ever recommend this place. This place should be ashamed of themselves at how they treat customers and how they behave with their nasty and snotty comments towards us. Please save yourself the headache and stomach pains."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN08zY3lnRRAB",
            "text": "DO NOT!!! GO HERE!!! I have lived and worked in the area for over 20 years and I've visited many if not all the local places and this place stands alone in how horrible an experience I had with my fellow co-workers. $800 got us a FEW, I must repeat, a FEW appetizers and 5 out of the 15 people got open bar. The bartender was rude and ill tempered from the beginning. The female waitress was even ruder than the bartender. $800 didn't include the seating at the place. The food was some of the most unflavored Mexican food I've ever had. There's tons of better food, service, and prices right on the little Mexico strip of 116th from 1st Ave to Lexington. The bad food and lack of food could have been tolerable but not them denying us seating and providing the worst service I've experienced in my adult life in a restaurant. Poor customer service is a huge no-no for me. I've walked past this place many times and at many hours and I've never seen it full or close to it. For what we were given, we were scammed out of $800. I would never go back even if the food was free, WAY too many better places right around the corner. 0 stars needs to be a thing because nothing was done right. Lastly we were made to wait in the rain for 30mins while they got ready when the place was completely empty, worst customer service known to this man."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaXA2UkNnEAE",
            "text": "Oh wow! Love this place. Gourmet healthy Mexican cooking at its finest! Chef Maria did such a great job with the our meal.  The poblano pepper is to die for, made with daily fresh vegetables, really unlike the typical poblano you will find, stuffed with cheese and fried. The chef special salad is delicately seasoned with nuances pls or and made with the freshest greens. The desert flan was expertly made. Service from the friendly staff is outstanding and the atmosphere of the restaurant is super cute and quite upscale, suitable for family gatherings and date nights. Oh and there is a beautiful backyard, allowing the restaurant to entertain large parties. Truly a gem in East Harlem."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aHVhNXpBRRAB",
            "text": "Maria es muy profesional, el lugar es realmente hermoso y las margaritas increibles !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwME1xZy1RRRAB",
            "text": "Spectacular brunch and late night hang out spot. Great cocktails and delicious food! If you’re in the area, you must check this place out! 10/10!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a2F5NmFREAE",
            "text": "Loved this place. You can tell they are very experienced and take pride in their restaurant and community. My husband and I ventured there after going to Costco nearby and so glad we went. Especially loved the fresh juices and fish tacos. ⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a09UQWVnEAE",
            "text": "This was a cute place and since it was empty, we had the server to ourselves. That being said, I'm still very confused at how this place has 4.8 stars. I don't think they get much business during the week and perhaps the reviews are got their weekend brunch. Again, when I showed up on a weeknight for dinner, it was completely empty. We ordered appetizers and it was taking a long time. While we were waiting, an employee walked in and went to the kitchen. About 20 minutes later, our food was ready. That is to say: they appear to be so slow during the week, they didn't even have the kitchen staff show up until customers put in an order.\n\nI was excited about their guamonica, but was not able to try it, as they informed me they didn't have avocados. I've never been to a Mexican restaurant in my entire lifetime as a 30+ year old Native New Yorker where they didn't stock a key ingredient.\n\nSadly, the food also did not have much flavor. I was and remain very surprised this has 4.8 stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dm9PRUNBEAE",
            "text": "This place is phenomenal! Makes you feel at home and cozy! The food is amazing and the service is splendid. I love that the owners handle things personally, makes it a real experience worth coming. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMloySm9BRRAB",
            "text": "Delicious food. Great hospitality - Lou and Maria are wonderfully warm and welcoming.  We shall return."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c05YV3VnRRAB",
            "text": "Welcoming owner and a nicely covered outdoor space provides a great atmosphere. My impromptu visit found nicely favored strong French press coffee and delicious veggie tacos. They were super accommodating and I’ll definitely look forward to coming back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NV9INzVRRRAB",
            "text": "I had the most delicious and impossibly fresh salmon special with red berries. It was beyond delicious and such a surprising combination! I wish more people knew about this hidden gem. The service was impeccable, warm, friendly, great tequila options, everything you could want. can't wait to go back. great for groups!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjc1puanJnRRAB",
            "text": "After leaving Target, I found this gem accidentally. This place is amazing! The customer service is excellent, and the food is delicious. I absolutely loved everything I ordered, including the desserts. I definitely will return here with my…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5LUw2Y2VBEAE",
            "text": "Great tacos & cocktails! I love the atmosphere which felt cozy, welcoming, and laid-back. The customer service was great as well. They are “cash only”, so please be aware of that or call ahead as it’s not listed on Google. Would 10/10 recommend this hidden gem :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cE1DZjdnRRAB",
            "text": "My husband and I have loved this place since it opened. Really fresh, high quality ingredients and authentic recipes. Delicious wines, beers and cocktails. Cozy atmosphere, with friendly owners. A hidden gem."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcE5HU3pBRRAB",
            "text": "Bistro Casa Azul is a nice neighborhood restaurant that I stumbled upon because on their Google page it says they have an hour happy which they do not have an happy hour. There were two people working and they were mildly attentive, I don't think it was intentional it was more of a lack of customer service experience.\n\nFor example, water was never giving during the entire dinning experience. After ordering margaritas it took over 15 minutes to receive them.\n\nRegarding food, order the ceviche, shrimp tacos, and chicken tacos. The ceviche was small and non-traditional being served with whole shrimp, the flavor was underwhelming. The tacos were a good portion and saved the meal. The chicken taco was one of the best tacos I've had in NYC/Texas or California.\n\nOverall the experience was okay, but the problem here are easy fixes and I would return to give the restaurant another try because the couple next to me raved about the meatballs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1X2ZfaWJnEAE",
            "text": "Our school partnered with Lou to organize a staff HH at Casa Azul. Before the event, Lou invited us to taste a few items on the menu and some cocktails. DELICIOUS! The guacamonica was one of the best guacamole we have eaten. Tacos were authentic and fresh, the table’s favorite was the chorizo. On the day of event, we were treated like family, and we felt like family. We had the whole place to ourselves - beautifully charming place btw, but we used the backyard, mostly. The back yard was clean with beautiful patio decor (my favorite decor piece was the wood antique-looking divider). There is an amazing painting back there too. The taquitos dorados were my favorite on the day of event. Lou made our drinks. I had a rum punch and was feeling nice after one. The hospitality was superb. Again, we felt like we were having a family gathering in our family member’s home. We were treated with care. Our comfort and satisfaction was their priority. Will definitely partner with Lou again in the future. Thank you! Maria, you’re awesome!\nLove, East Middle"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNVp6RFRREAE",
            "text": "This restaurant really is a gem. The quality and freshness of ingredients, careful preparation of dishes and exciting combinations of flavors makes everything I've tasted absolutely delicious. The space for dining in is comfortable and quiet and the service is excellent. I strongly recommend this restaurant."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dXZfVER3EAE",
            "text": "First time coming to this place. Doesn’t feel so much as a Mexican spot as it does an American Bistro, but I will say that the Filet Mignon was amazing and cooked perfectly to our desired temperatures. I’ll definitely be coming back here every once in a while if I’m near Harlem."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbUtiX0hnEAE",
            "text": "Most of the food is thoughtfully prepared and delicious. Try the fruit juices - the blood orange juice was clearly fresh-squeezed. I would love to rate this place five stars. Unfortunately the medium rare filet mignon I ordered was served…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZX2Q2TVpREAE",
            "text": "Came in for a cocktail at the bar with friends. Treated extremely well overall at a real neighborhood spot. The drink special we all had was delicious and strong. They also have a curated wine selection."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cF9lb1FBEAE",
            "text": "Best shrimp tacos! So fresh. Excellent service. The best local joint. Owner and wife are such nice people! Food has me hooked, but service keeps me coming back!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTaDdtdHR3RRAB",
            "text": "The food and cocktails were amazing. Service was amazing. It's a nice little hidden gem. I want to give it another try when outdoor seating isn't mandatory."
        }
    ],
    "reviews_count": 63
}