{
    "name": "Cocotazo",
    "place_id": "ChIJl-zKHgT3wokRVGa8z4mhwno",
    "grid": "MN11",
    "address": "1590 Park Ave, New York, NY 10029, USA",
    "rating": 4.7,
    "user_ratings_total": 298,
    "phone_number": "(917) 384-7671",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd1N6QllkSFJsVURoak5tUXhRa1UxVmsxWWJrRRAB",
            "text": "What a beautiful restaurant & the first few times ordering was pure perfection I had to stop ordering weeks ago we ordered chicken Pastelillos & it was overally seasoned in just pure paprika couldn't eat it , I was shocked after that we were never able to order again .Another time sweet plantains were not fully cooked .I wish them the best the flan is amazing when fresh but the amount I was paying for what I got became not worth it with the issues occurring a few times .The chef is very pleasant it may be her wife or someone else's mistakes commenting feedback because I see such a great amazing potential if these things are corrected .I will not be back but I'm sending positivity & may you continue to succeed ."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWk0yOURaRmxNZURaNGFITkxXRWgzVVdKbWMxRRAB",
            "text": "We came here because of all the great things people were saying about this place. We ordered finger good and let me tell you the Alcaparras are not good. The turnovers were horrible(chicken and beef). I dont know what seasoning they used but everyone thought it was not puerto rican flavors.  Maybe the dinner would be better."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdVlsUlFjRWxrWjIxUGVVaGlkRWR6ZDNGYVdrRRAB",
            "text": "My first impression of this place has only grown stronger. One of the staff started our meal experience with a friendly greeting and order inquiry. You can taste the freshness in every dish. The restaurant space feels sophisticated yet comfortable. I'm planning to return, maybe repeatedly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1JIQXljM2xFZGw5TU5XUndaakU0T0VzNGNGRRAB",
            "text": "Cocotazo is a true gem in East Harlem! The food here is packed with authentic Puerto Rican flavor — you can taste the love and care in every bite. The alcapurrias are out of this world, crispy and full of seasoned meat, and the arroz con gandules with pernil is a must-try. Everything tastes fresh and homemade, just like you’d get on the island.\n\nThe staff is super friendly and welcoming, and the vibe inside La Marqueta feels warm, local, and full of culture. Prices are fair, portions are generous, and the quality easily matches what you’d find at higher-end spots. It’s not a fancy sit-down restaurant, but that’s part of what makes it special — it’s real Harlem flavor with a family feel.\n\nIf you’re anywhere near Harlem, definitely stop by Cocotazo. Great food, great people, and great value. Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVgwMU9kMEZyTVdGTldXZDZaMU5ZVkU5M1VWRRAB",
            "text": "The Most Authentic Puerto Rican 🇵🇷 Restaurant In The City .."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTVV6VkVXSGhWWDNCc2JuWk1PRmRCWkZoRk0wRRAB",
            "text": "Showed up on 10/9 with 4 coworkers since we enjoyed food last time. This time place was closed and no info why. I know things can happen but it was real bust. We were not happy since there is no viable option in the same location. This time they don't get my support. Check before you go to make sure they are open."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeGFrRmFNbWMwVGt0SE9FNXJlVU14WW1ScWIzYxAB",
            "text": "The Rican sandwich is the stuff of legends...the pernil was perfectly cooked, not a dry bit in the whole thing...cheese was melty and perfect, got a great cheese pull, top 10 sandwich of my life.  and for a sweet finish, the cheese and guava pastry was phenomenal...i thought about having a second round of both, but my better angels won out...will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdlIzbDNSM05wY0RGVlNtd3RPRlJhTVVkRmJIYxAB",
            "text": "Everything was amazing, beautiful, delicious ❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVdERkdOVWRRWTBwbWQwVkJhRTV4ZGsxMmVGRRAB",
            "text": "Unfortunately on September 19, 2025 at the 115st and Park Avenue location, our experience wasn't too good! It saddens me to even say this Frances and Victoria, after you guys left, the cook provided me with raw alcapurrias de jueyes, not once but twice and the tostones, also had to be sent back. My first time, everything was delicious, except for your Tres Leche. Very disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NFdXVXRTbEJmV1RsTGNsQkNWekZtYzE5cFYxRRAB",
            "text": "My husband and I came because we had seen it on Instagram,  and the place did not disappoint.  We ordered the Guava BBQ Ribs and the famous Pernil, along side some chicken pastelillos (I call them empanadillas).  Everything, and I mean everything, was amazing.  The taste brought me back to the island and the beautiful people serving this amazing food is was like being back in PR.  If you get the chance,  take a stroll thru La Marqueta, and stop at Cocotazo.  Thank you for the good foodwe shall be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SGVtTlNNbXBPYlZGWWJ6bGhlVFppVFcxbFIwRRAB",
            "text": "Omg!! Can’t believe i live up the block and pass by this hidden gem all the time. Did come across Cocotazo awhile back on the gram. My cousin that visits me from time to time always eats here and has brung me food. Came yesterday to bring home some of this delicious boricua style food. I must say is the best in el barrio besides my moms food. Must comeback!! 🏳️‍🌈🏳️‍🌈🇵🇷🇵🇷"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWVExODRWVXBCV1VGdFduSmhXVVV6YldOR1dIYxAB",
            "text": "Great Service!  Went for the Passion fruit juice yes it was natural & delicious. I had the pork, beef and the crab 🦀 meat Alcapurrias.  Felt like I was eating at one of kiosk in the island 🏝 Sooooo good. Yes I took some to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsclZIQjNXV3RvYVcxVFMwbGhiamRFVDNWdFZIYxAB",
            "text": "I’ve ordered by delivery from here a couple of times and it’s always consistently great food. Juicy meat, perfectly cooked rice, and great sides"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RlUzYzVOekJpYVRCRWFVZEZRWGRmUkd4dFdYYxAB",
            "text": "Cool quite place with Puerto Rican Heritage and art work . Plus other unique stores & eateries & drinks ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUFIzSktiVVJhYVVaSFFtWnVlRGxLUjBsSFpWRRAB",
            "text": "EVERYTHING WAS EXCELLENT.  MUST VISIT."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeE1XOWtkMDk1UW5WcU5XazRSa0ZKTmxCRVNuYxAB",
            "text": "Atmosphere is great! Service and staff  is amazing and Chef Francis is so awesome, very personable, you feel like you home. The food is very flavorful and delicious 😋 definitely coming back! If you have a craving for good puertorriquen  🇵🇷 food this is the spot !!\nFood was so good 👍 😋 I forgot the picture 📸."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlJUUm1jblp2Y25sd1VUSnVMVmRzWWtsS1dYYxAB",
            "text": "Just Wow ...Food was Delicious ! I Highly Recommend Cocotazo , Definitely will go Back. Prices are Great Too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5alZFbDFjRWxpT1RsWGJVOWFPRkJvU1VaV1YxRRAB",
            "text": "Delicious food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvdGRqQXRWRlE0VDBscU5Fa3RWR3g1U21KMGMwRRAB",
            "text": "The price point makes sense. This spot meets all my expectations. The food provided excellent flavor. Staff workers demonstrate authentic kindness. This restaurant satisfies me completely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFelJrbzRiR1JuVEVOa2JFUXdjemRLUnpGVVNXYxAB",
            "text": "10/10. Awesome!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMldsVm5OMHhaT0dod1ZHZGFhMlZ5TlZrelRHYxAB",
            "text": "🌟 A Hidden Treasure in East Harlem – Cocotazo is All Heart 🌟\n\nLocated inside the iconic La Marqueta, Cocotazo is a powerful tribute to Puerto Rican food, culture, and soul. The name may be playful (yes, Cocotazo means “a little knock on the head” in Spanish 😄), but the food and energy here hit you straight in the heart.\n\nFrom their soulful special plates to refreshing, made-with-love juices, every bite feels like a celebration of heritage. The flavors are bold, comforting, and deeply rooted in tradition — you can truly taste the pride and history behind every dish.\n\nThe space is intimate and welcoming, filled with warmth and authenticity. You can’t help but feel like family. Frances and her wife, the incredible women behind Cocotazo, have created more than a restaurant — they’ve created a home for community, culture, and joy.\n\n💖 If you're in East Harlem, you must stop by Cocotazo. Come hungry, leave uplifted.\n\n#ComidaCriolla #BoricuaPride #EastHarlemEats."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNVdVeE5MWEJIY0VwdGRYcGpTVE5ZVjBaM2NsRRAB",
            "text": "My wife had a rican she said best Cuban sandwich she ever had I had the tripleta it was the best sandwich I’ve never eaten delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1MwcDFjR3ROWDBKcVluRTBSMkZzVDBNeWFVRRAB",
            "text": "El \"Pastelon y arroz con gandules\" meal was so good in taste & was so flavorful I thought I was back on the island in Puerto Rico🏝🇵🇷That good o' authentic boricua cooking made me feel like i got hit with a \"Cocotazo\"🤤💥👊🏽🐸👍🏽🍴🍛🫔🍹💛Everything was good❕️ Including the staff, service, etc. Keep 🆙️ the good work❕️ I would definitely come back & recommend this place for some authentic Puerto Rican food in NYC. 🗣Wepa❕️🗽🇵🇷🏝❤😎👍🏽✨️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVdVeG5abm93TW05c05FRlROVlozUzBacU1WRRAB",
            "text": "Some of the best food in NYC, period! Do half tamarind half passion fruit juice, coki pork bowl, alcapurria (best I've ever had), and the pasteles! Quality is always great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWlFqQllWVTV5U1MxQmQzTktSMk14UVRVNFUxRRAB",
            "text": "The best food in Harlem. The beans are so amazing, they should be sold in cans."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFRERnhhSFJYVVZGaGMzRkRVbmxoUm5wNFZVRRAB",
            "text": "I’ve heard a lot about this place and it’s delicious PR dishes - as a former NYer I drove 1.5 hours from PA to see what the buzz is all about. El arroz con gandules OMFG amazing flavor. So good you don’t even need a side or meat. The pernil was ok but the cuerito was crunchy as it should be. Potato salad was ok as well but the arroz con gandules got me y el jugo de tamarindo also a big winner for me. Great place to eat some really delicious PR dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQ2RGZ3diM1YyUTNGM01HcFBVbWhMVm5OcVpFRRAB",
            "text": "The food is super great and the prices the service is great just they need to some foods every day not just on some days but over all they are great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMWJFUjBNM1ZsWWsxcWNrc3dORXh5VkVKQ2QwRRAB",
            "text": "As a Boricua teen, this made my whole trip!!! It feels so much like home and the food is sooo amazing! From the food, to the service, to the place in general, everything is on top!!! It makes me beyond joyful that there’s a place like this thats so…I just can’t even explain. Please come here when you can."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVIzZE1NSFJXTVd0dFFXdDBZbWwzVkRSWllYYxAB",
            "text": "The servers at Cocotazo remember faces and preferences impressively. The food is worth what you pay for it. Employees: exceptional. Aware and qualified. Every bite offered supreme tenderness. I urge you to try it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjelUwTmFYMlpRY2pJMlJsSjJXRFZDTW5OSU9YYxAB",
            "text": "I came here for the first time and tried their alcapurrias, rellenos de papa, tripleta and yucca with onions.\nEverything was very good..real authentic home made Puerto Rican flavor. The ladies working  here were also pleasant and inviting  ..my next visit to NYC will have to include another stop here to try the rest of their menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUVFqTXljMDVwVDBGSVdYZGZUbE51VURkbWRtYxAB",
            "text": "I went with my family to Cocotazo over the weekend—not realizing what I was getting myself into. Let me start by saying I was raised in El Barrio, a place that always felt like the heart of Puerto Rican culture to me. Over the years, though, it’s been hard to find food that truly captures those familiar, home-cooked flavors… until this past Saturday.\n\nFor the first time in a long while, I felt like I was tasting my childhood again. If you’re looking for authentic Puerto Rican food—flavorful, not greasy, and made with love and history—this is the spot. Every bite transported me straight back to my grandmother’s kitchen.\n\nThe chef (who I didn’t realize was the chef at first) has an amazing sense of humor. When I nervously asked, “Is this good?” she smiled and confidently said, “I’m the chef—everything is delicious.” And let me tell you—she wasn’t lying. EVERYTHING was absolutely amazing!\n\nI’ve been raving about this place ever since and telling everyone I know that Cocotazo is the place to go. And I have to mention—her pasteles? Out. Of. This. World.\n\nThank you for the warm hospitality, the incredible food, and for putting up with me and my crazy family. We felt right at home and can’t wait for our next visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlZHVk9RMUYzWTBFMlpIQnlUamxWWldVd2VGRRAB",
            "text": "food to die for and the chef and her wife give family vibes. I felt like I was back home super friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeVJIaEhTSFZqVm1NelV6bDBRM1Z1UVZBMFpsRRAB",
            "text": "Amazing food and management. Makes me feel like I’m eating homemade food from home."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdGJ6RndTWE5XWDBoRVpHRmlaSGQ0ZGxkRE4xRRAB",
            "text": "Overall, I gave that establishment a solid 10 😋👌\n\nI highly recommend it for authenticity and ambiance 🙂"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkblowOXRURlJVY2taWFNGQkdiRkJuUkRWR2VFRRAB",
            "text": "I originally wrote a great review but took it down because of attitude. The food is good, not great. There are inconsistancies. my 1st visit i didnt know they closed at 5 on Sundays. Their website doesn't show hours of operation, or i missed it. i got there just after 5 after an instagram review. The line was long so i assumed they were still open. i asked if i was too late to order. no one answered me. i asked again. i would have left. The chef very calmly and graciously smiled and said, give us a minute we will serve you. The other woman was annoyed. I found out later this was the chefs wife. i dismissed it as she was very tired. i get it. or so i thought...The chef was wonderful. the food was good. i ordered a half dozen pastels and half dozen alcapurrias in addition to two entrees and a sandwhch. they were all seasoned very well! The next time i went back i ordered 1 dozen frozen pasteles and 1 dz alcapurrias. The alcapurrias lacked salt. i still have 9 frozen. i sent an email about the no salt and was told that it was strange that they had no salt but i could bring them back for a refund. i didnt want money. i wanted well seasoned alcapurrias. since i do not live anywhere near this place and usually get an urge for it when i go out of my way to go there, i didnt bother taking the alcapurrias back. the 3rd time i went was today. i didnt know they started serving at 12 noon. i got there at 11:15am from Brooklyn. i was headed back home to New Rochelle and diverted to stock up on pernil, arroz con gandules, more pasteles and more. Each time I've been there i drop over $100. 1-I love supporting women owned businesses 2- I love supporting my people and 3- i have no limit in spending when i like something. if the food is really good I'll take the trip and drop the cash. So today sitting there at one of the tables was the chefs wife. I asked if i could place an order. i got attitude. SHE IS NOT WELCOMING AT ALL!! Her face showed anger, she was annoyed and acted insulted. I got, \"No we don't open until 12!\" with a look that said \"how dare you ask!\" I asked not even a little earlier? She was annoyed and barked \"no!\" then she got up walked away towards the back. She never asked what i wanted. She made no effort at all. so I saw that another kiosk was serving Asian fair and I went there. i was done at 11:50am I tried again at Cocotazo. this time the chef was behind the counter. I asked if i could order something. I'm told no, no orders until the food is up. You can kill people with kindness and ruin your service business by being curt, dismissive, unapproachable and rude. i won't be back to be dismissed and spoken to like i'm chattle. The first time i was there i got attitude from the chefs wife. I made excuses fir that. The second time she went out of her way to tell me she was the wife, which i thought was strange. The 3rd time i got worse attitude from her, the wife, and dismissed by the chef. Instead of asking me what i wanted they just turned me away with big negative attitude. Had they asked me what i wanted i would have told them i was there for another 2 dozen frozen pasteles, an entire pernil, rice with gandules, and potato salad to go with it, but they never asked. I'm not chasing anyone to give them my money!! I would have waited if they needed to prep some of it, but they just shut me down and gave me attitude. No discussion at all. They were very standoffish and they hadn't even started serving. i guess they have it that way. I wish them much luck. I won't be returning.\n\nPs a HUGE roach walked across the floor while we were eating at one of the tables in front of the Asian food kiosk area. The very sweet female that served us started chasing it, but it went under her kiosk. lt looked like a flying roach. IT WAS HUGE!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRU16bENTMlpwV1dWdVRXVlhhRUUzY0haM1gzYxAB",
            "text": "Today was my first time trying Cocotaso, and I have to say—I was seriously impressed.\n\nAt first, I was a little hesitant, so we started with something small: the alcapurrias and empanadas. From the very first bite, I was transported straight back to the Island—the flavors were spot on, just like the ones I remember from Puerto Rico.\n\nSince those passed the test with flying colors, we decided to go all in with the pernil, arroz con gandules, amarillos, and potato salad. Let me tell you, every bite was a 10/10. The food was fresh, well-seasoned, and absolutely authentic.\n\nI’m so glad I found this place—finally, a Puerto Rican restaurant that truly captures the flavors of home. Cocotaso is the real deal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Uk5YUkRXVUpKZUdJMlFqSkZNRkZPVUhrekxYYxAB",
            "text": "As a Puerto Rican, I can be tough on restaurants that serve Puerto Rican food. But Cocotazo got 👏🏽👏🏽👏🏽👏🏽👏🏽 and an added 👏🏽. The food , the atmosphere and the  decor made my friend and I feel at home. I wiped my plate clean. ( which is rare for me)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFRtVlhWbkJHWm1aWFdsb3dRMG81YmxwMGVVRRAB",
            "text": "Great 👍🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sc01FUXRjRVZ3VTBOblJUVXdURlpGUVhOV1JXYxAB",
            "text": "The experience is the best\nFood is amazing\nAnd the he people are so amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VGMxa3hRMGR5ZVdsblZqRXliblJYTFRGMVduYxAB",
            "text": "This food is DELICIOUS! Chef Francis can cook! If you are in the area (or not) - my husband and I were in the city visiting from Virginia and stopped by. It was well worth the trip!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa2QwbzRaRlF3YTBnM1NFVnJkMVJoTFdWd2EzYxAB",
            "text": "This is most authentic Puerto Rican food you can try. I love how fresh the tamarind juice was. I loved trying a different twist on a sandwich that had tied roots to Puerto Rico cuisine! The hospitality was amazing!!! I love how passionate the owner is!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbVpFUXlhSEIxZG5WRFVtcG1MVUZCTjNOcU9HYxAB",
            "text": "I've helped this place gain new customers through my praise. The staff offered service distinctively above others. The restaurant delivered completely. You get your money's worth and the salad had a nice zest. This restaurant keeps me coming back for more."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqd3NmSEJBEAE",
            "text": "Authentically Puerto Rican.  The times I have been there and have tried different dishes, I have yet to be disappointed. The food is served hot and is very tasty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc1prVnpVVXAzTTBsVVFXRk1SM0EzUjJwMlNsRRAB",
            "text": "OMG! Moved to FL years ago. Visited my mom who still lives in El Barrio. Saw a youtube short about this place. Visited and now I wish I still lived here so I can come by anytime. The owner and staff were soooo nice and humble. This is a hidden gem! Though not hidden anymore."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdFZqQlJOR0l5UlhCcU0xcG9YMlZGUTBsSGJHYxAB",
            "text": "Ordered something light for late lunch. Had an empanada de pollo y Passion Juice. 😄 um? Yum?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wS1RGSkZRWEJLUzFoWWNUWldXRk5mTldKUU1uYxAB",
            "text": "Love the food real traditional boriqua"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeVJzdkhFekpUTjB3RRAB",
            "text": "THIS!!! ABSOLUTELY PUERTO RICO!!!! If you're looking for authentic Puerto Rican food visit Cocotazo. The food just like Grandma used to cook it. The beans are out of this world. Brought back memories of when my grandma was making them."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcko5czZpcEt2enJnRRAB",
            "text": "I love Cocotazo! The food is always phenomenal and the staff is always accommodating. Thank you for making our event so special!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS082c2pBMDZHX0ZREAE",
            "text": "Loved it! Nostalgic feel the second I saw the wall featuring a collage of our beautiful culture ❤️. The food was absolutely Bomb, it like was eating something cooked by your bori grandmother or mother 😭❤️. Throwback to my Tripleta days. Definitely coming back 🇵🇷🙏…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKR0ZrcFdHNDR2d2dRRRAB",
            "text": "I love this place! First time here today! Got to see Chef Frances doing her thing!!! It’s a small cozy reminder of home, smell, decor and taste. The food is amazing, I had roasted chicken, my husband had the rib platter. We also had the potato ball. Amazing!! We were like little kids in the car waiting to dig in. I’ll def be back,\nEspecially cause her name is Frances like my mother. Home all around, again. Thank You!!\nI’d leave a pic but it’s gone, down to the bone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbXM5ckhCemFIenBBRRAB",
            "text": "I saw a video on Tik Tok advertising El Cocotázo serving authentic Puerto Rican food and HAD to try it! I sent my son and his family the day before and he and his family loved the food. MORE confirmation to try it. The food, the service, the atmosphere—10s across the board!! With every bite I took, my response was WOW! I felt like I was sitting in my abuela’s kitchen. My husband even bought a dozen pasteles. We can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaU85LWJNdGE2MTVRRRAB",
            "text": "Delicious food that is obviously made with pride and care. Everything is fresh and authentically Puerto Rican. The staff is lovely and very attentive! Can’t say enough nice things and I cannot wait to go back! They even gave my kiddo rooster lolli 🫶"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMF95X05BEAE",
            "text": "This spot served one of the best Puerto Rican alcapurrias I've ever tasted—flavorful, authentic, and reminiscent of a homemade meal. The warm and welcoming service made us feel right at home, enhancing the overall dining experience. The combination of excellent food and genuine hospitality truly set this place apart. Highly recommended for anyone seeking authentic Puerto Rican cuisine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX2RuSUtZcE5hVlB3EAE",
            "text": "First time here and I've been hearing about this place for years!! Finally came and the service and hospitality is like visiting family. Small, cozy, and intimate space which is nice and welcoming. Tripletas are the best sandwiches to ever come out of Puerto Rico. I've been searching for the best tripletas in NYC, and I am confident to say that this is now that spot!! Feels like I'm back on the island!! Their alcapurria is also very good; a nice flavorful mix that, despite not being my personal fave, it's unique to their location and I can definitely appreciate that. Their drinks are amazing, and their coffee 🤤🙌🏽 SMACKS you!! Love it!! Can't wait to come back soon!! Definitely recommend to everyone!!\n\n~Gio~~"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYmhxNTNpZ3JXRkRnEAE",
            "text": "Amazing, authentic food crafted from quality ingredients and served made-to-order by the owners themselves. Worth a visit from just about anywhere (we came all the way from Indiana). This chef is deserving of a much larger presence in town but until then don’t miss out on Cocotazo."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaFlxTjh3RRAB",
            "text": "Cocotazo was Definitely Delicious!!\nFood was amazing\n\nMy second time eating from cocotazo\n& The flavor never changed.\nDelicious highly recommend!!\nBest Spanish food in  Spanish Harlem\n115 in park ave"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MEk3RGZBEAE",
            "text": "Out of this world delicious, amazing customer service and a great overall experience. I love the little things like the Puerto Rican flag on the alcapurria. Chef Frances you definitely deserve all the success and good fortune that awaits you! I can’t wait to visit you again. Dios te bendiga and thank you for keeping the custom dishes of Puerto Rican cuisine alive!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbkotRDFnRRAB",
            "text": "The atmosphere was calming the staff was very welcoming. I asked to meet chef Francis and even though she was so busy in the back cooking she made her way out to greet me and my friend. In just enough time for us to thank her for putting so much love into the food it tasted amazing and made me go back to Puerto Rico eating my grandmothers food. I took extra food home to share with my other friends. They loved her food as well. I will be back with more friends to enjoy your food thank you for being you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcDVxUWF3EAE",
            "text": "Chef Frances & her wife were so kind to us. Sharing their story and making us feel at home the second we arrived. The food is going to make you feel like you’re in PR & for a great price.\n\nI’ll be back for the Guava Ribs cause those were looking juicy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVelNYUTBXWEJSVDAxSVRGbDZSakF0TkVsQkxYYxAB",
            "text": "Finally made it to Cocotazo!! Loved this spot its super cute and Boriqua it has such a nice vibe. I had the P.R. sandwich it was better than a Cuban on pan Sobao and the crab alcapurria were really tasty too! You also must try the Chi Chi Rodriguez passion and tamarind fruit drink delish and so refreshing!! Thanks Chef Frances we will definitely be back!! God bless 🙏🏼💝🎉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbUpyUm5nRRAB",
            "text": "I recently had the pleasure of dining at Cocotazo LLC, and I must say, it was an extraordinary experience that brought me right back to my roots in Puerto Rico. The Puerto Rican food here is nothing short of spectacular.\nFrom the moment I tasted the arroz con gandules (yellow rice with pigeon peas), I was transported back to the vibrant flavors of home. The rice was perfectly cooked, and the pigeon peas added a delightful texture. The pernil (roasted pork) was tender and flavorful, a true testament to authentic Puerto Rican cuisine. The beans were well-prepared and complemented the meal beautifully.\nThe attention to detail in every dish was evident, and everything was excellently prepared. The meal setup, complete with traditional sides and refreshing beverages, made the experience even more enjoyable. The fried items, possibly rellenos de papa or alcapurrias, were crispy and delicious, adding a perfect touch to the meal.\nCocotazo LLC has truly captured the essence of Puerto Rican food, and I am thrilled to have found a restaurant that reminds me so much of home. If you’re looking for a place that offers authentic and mouth-watering Puerto Rican cuisine, look no further than Cocotazo LLC. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dm9Ic1RnEAE",
            "text": "It is very difficult to find authentic PR food in Hawaii so we had to visit Cocotazo on our trip. The service was amazing, the food was delicious. Go hungry and try as many items as available. There was plenty of sitting at La Marketa and salsa playing in the background really took me back to my childhood.  Our favorite snack was alcapurria and our favorite part of the dish was the looooooove we tasted. My least favorite was the guineitos en escabeche (a little dry for my personal taste). Jugos de parcha y tamarindo estaban deliciosos! Gracias !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d1A3RjZBRRAB",
            "text": "Cocotazo isn’t just a restaurant—it’s home.\n\nThe first time I walked through those doors in 2023, I felt something I hadn’t felt in a long time: home. The aroma of the pernil , the warmth of the space,—it was like stepping into my grandmother’s house, where love was served on every plate.\n\nIn a city that has slowly erased so much of our Puerto Rican culture—especially in East Harlem—Cocotazo is a lifeline. It is one of the few places left where you can taste the island in every bite, where the food doesn’t just feed you, it heals you. Each dish tells a story, carrying generations of tradition, resilience, and soul.\n\nBut Cocotazo is more than just its incredible food. It’s the people behind it. Chef Frances and her wife Vicky are two of the strongest, most loving women I’ve ever met. They weren’t born in this community, but you’d never know it—because they love it like their own. They show up, they give back, they uplift. They’ve supported the work I do, embraced me like family, and created a space where everyone belongs.\n\nIn a city that moves fast and often forgets, Cocotazo reminds us to slow down and savor—not just the food, but the memories, the culture, the love.\n\nWe have a gem in our community, and I couldn’t be more grateful. If you love food that tells a story, that takes you home, that reminds you of the people who loved you through a plate of arroz con gandules—then Cocotazo is waiting for you.\n\nCome hungry. Leave full—in every way that matters"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeUtISS1RRRAB",
            "text": "Excellent Puerto Rican food and superb service! El sabor de la isla. Fantastic Puerto Rican cuisine in NYC! Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNjZMUi1RRRAB",
            "text": "I’m new to PR food but this wasn’t bad and a cute little spot in a shopping arcade in Harlem. I ordered the coki and it was nice filling lunch - lots of pork - maybe a bit bland but super tender and I enjoyed the crackling - along with rice and a nice green salad. I’d come back to sample some of their other dishes next time I’m in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbUlqQklREAE",
            "text": "Hands down the BEST Puerto Rican food I’ve ever had. Cocotazo is the real deal, food is authentic, flavorful, and made with so much love. From the moment we walked in, the staff made us feel like family. The service was warm, welcoming, and attentive without ever feeling overbearing.\n\nEvery dish tasted like it came straight from abuela’s kitchen, so rich, and perfectly seasoned. The arroz con gandules? Unreal. The pernil? Melt-in-your-mouth tender. Everything and any thing is absolute perfection.\n\nThis isn’t just a restaurant, it’s a full-on experience. You can taste the culture in every bite. If you’re looking for true Puerto Rican flavor and hospitality, Cocotazo is it. Can’t wait to come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbXJydURicmEtOTdnRRAB",
            "text": "ABSOLUTELY LOVED IT COCOTAZO IS A GREAT ADDITION TO THE NEIGHBORHOOD. I HIGHLY RECOMMEND! They also make a fantastic espresso"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMklMT1dnEAE",
            "text": "Omg, Chef Frances is the best. It's our second time we were here. The food is AWESOMETACULAR. THE BEST KEPT SECRET IN EL BARRIO. NOW OUR Favorite place to eat. Music is awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaU0zdXpnRRAB",
            "text": "Amazing customer service, chef was super interactive, actually held conversation about her recipes and family Origin. Staff were very welcoming. I completely enjoyed my Coki Bowl. I can’t wait to return and try the guava ribs"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MU1TU2NBEAE",
            "text": "Absolutely delicious. Everything was seasoned to perfection, nothing over or underdone. You can taste the heart and soul put into every aspect of the dishes. 10/10 hands down! Will be back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqc00tQzBBRRAB",
            "text": "The food was okay , I had the La Gallina and my fiancé had the tripleta . I was disappointed in the lack of flavor for the beans and the chicken. There was no love ! The Tripleta was very good and I think that I would come back for that…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncVBhSXBBRRAB",
            "text": "Everything is banging. You feel the love 100%—in the service, in the design of the restaurant, and definitely in the food. My fave part was the rice. AMAZING. I want a vat of it to bring home. And the chef was a sweetie. COME!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaWNid1hBEAE",
            "text": "Before arriving in NYC I Googled where the best Puerto Rican food was and El Cocotazo came up as 1 of the top 5. I decided to try and I must say, it truly felt as if I was at my Abuela's house in Puerto Rico. The service by Chef Frances was incredible too. We arrived as she was closing but after hearing that we came from out of town, she fired everything up again and served us arroz con gandules y pernil with a crunchy piece of chicarron. I'll definitely be back the next time I'm in NYC."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNUp2cXdRRRAB",
            "text": "While I found this place just browsing on Google I decided to give a try, and I will tell you was one of the best decision of the night we showed up late so but that did not stop the owner operator Frances and her wife the most two down to hearth people working together great spirits.\nMy daughter and I order pernil sandwiches while we watch Frances do her magic in the kitchen we looked around on the decor the setup the place really made you feel like your eating in PR the sandwiches was delicious the Parcha juice was fresh and to close things out we had a flan chhhaaachioo we could not even walk to car lol ohh I forgot I took home some yuca pasteles I made em yesterday the masa was so on point definitely give it a try. Stop by you’ll have a great time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicWNDTkh3EAE",
            "text": "It is always a pleasure to come here. Chef Frances is awesome, bless her hands. She has passion and you can taste it in every bite. Her staff is amazing.\n\nNow let’s talk about the food . My husband the Guava glazed ribs with arroz con gandules and I had the Rican Sandwich. Wow wow wow.\n\nThe glaze on the ribs is amazing , meat falls off the bone. The taste of the Rican sandwich is to die for. Wow so juicy and delicious.\n\nThis has become our favorite spot.\n\nThank you Chef Frances 🇵🇷"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dmZlSmpBRRAB",
            "text": "Let Me Just start.....que viva Puerto Rico Y nuestra gente Boriqua. Because all in all....one can handcraft a meal. Or a tòntèrìa.....Or just have a catering service. But to have a boricua flow due to the inspiration of our island cuisine. That's an EXPERIENCE on its own. I'm Just In Awe due to the volume. The connection, and the all out one to one experience ones feels as you walk in. The Energy and the AtAJA Vibes one Feels once we pass the threshold.  It's remarkable and amazing.  righteous blessings to cocotazo. Cubans are good...But RICANS are better.....hacha y Machete....🇵🇷🔥🎶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucDVUM0d3EAE",
            "text": "Ordered from Cocotazo for a business lunch. Working with Chef Frances to select a menu that accounted for all allergies and dietary restrictions was seamless.\n\nEveryone at our office loved the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N01lS3hnRRAB",
            "text": "A must visit in Spanish Harlem. Worth the trip & wait! I haven’t had pernil that good in years!! I haven’t had 3 leches that good since I was in Puerto Rico. The staff there is kind & attentive. I had the coki, alcapurrias, ma’s relleno de papá, tres leches, jugo de parcha. My only regret is not taking some pastelillos to go. Can’t wait to go back and try the guava ribs."
        }
    ],
    "reviews_count": 78
}