{
    "name": "Amor Cubano",
    "place_id": "ChIJbzPpGQT2wokRW5Zsbs44Gis",
    "grid": "MN11",
    "address": "2018 3rd Ave, New York, NY 10029, USA",
    "rating": 4.4,
    "user_ratings_total": 1135,
    "phone_number": "(212) 996-1220",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFQxRkRaSEUxTTBSU2RuZFJPWFJWTUU5SVNuYxAB",
            "text": "Service was great. The waiters and every employee was very attentive. The food was ok not amazing but still good. The service is better than the food. I would go back for sure."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd2FFd3hSRXRGVlRKT2FVZEhWekZQVVdab1pIYxAB",
            "text": "Loved the mojito—fresh and perfectly made. Staff was pleasant, though the ambience could be better. I’d still go back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMVFqSXdaV051WnpOa2NreGFiV28yY25oVU0xRRAB",
            "text": "I gave this a 2 mostly because there was nothing between 1 and 2. Walked in place was empty other than 3 people who were clearly patrons. I had to go in further before the human sitting in the back acknowledge my and my friends presence. Not a great experience.\nI came to this spot because my favorite cuban restaurant Zona de Cuba closed and I was looking for authentic cuban flavors. What I got was under cooked Congri and over fried tostones.  The waiter even referred to the rice as \"morro\" not congri. Not happy and will not be returning to this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1VsWkJTbEpzUTNRMFNVMVZVbFJDUVZoYU1HYxAB",
            "text": "Fun place, great food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxemJGRktUblZ0WW04MVZFOWpkV3hWVjJwcVJHYxAB",
            "text": "This place is a gem in Spanish Harlem. live music every Friday and Saturday service is good the food is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aFUzUnRkVEpHVURsV05HTkpNRU5JWTFWdVdFRRAB",
            "text": "My favorite restaurant in New York. Great/ perfectly cooked churrasco and the yuka fries are so good. They play live music Saturday nights, from what I’ve seen, and it makes the restaurant vibrant. Service is speedy and attentive to detail. Have been coming here for the past 2 years and is consistently 10/10."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NFgwSkplRnBtTlMxQk5GTlhlRkpETjFvMWJVRRAB",
            "text": "I have not yet had the opportunity to try their food but I popped in here for a quick happy hour and was treated so lovely by the staff. The drinks were well balanced and tasty, especially for the good price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNFUwMDRWVEpLUVU5UFZXVTNkM2R4Tld0MVlrRRAB",
            "text": "Jhonstan is the best!!!! He was so nice and recommended amazing items; def worth the visit! (Pro tip: go on Friday or Saturday night for live music)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTmN6WTFlV1I0TVVab2JuSktjRVoyWTIweE5IYxAB",
            "text": "Went on Friday August 1st, 2025, with 2 other persons to have dinner, after being told by a friend that the food and drinks were excellent. Well this is not the case, the breaded steak was extremely over cooked and tasted like cardboard,  the rice and beans were bland, when asked a waiter to provide me with extra sauce for my chips, he said there will a dollar charge for it, I didn't care about prices I was there to eat. The drinks were okay, but the music was phenomenal and it was nice to see older people having a good time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1QySTBlSFJmZW1sb2RFaHZUbVJ1U0RaMk0zYxAB",
            "text": "Went with my mom and a friend. Food was not that great at all. The breaded steak was really breaded couldn't find the steak. Everything that you wanted extra like a sauce or anything they charged you for, drinks were okay, music was great. If you're going just for the music and a couple of drinks then that's great. Food not that great."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa2IwVTBSR3BCYzJsb1ZuRTJiV2xxTW1ZNGJIYxAB",
            "text": "Les recomiendo la vacafrita y el lechon. Jhonatan hizo unos cocteles excelentes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMlRsQmZjWE0yVkZOemJIQk1VRkpJYWtkelFYYxAB",
            "text": "Excellent service, it couldn’t be better.\nJhonatan is an amazing bartender, ask for him.\nThanks for making my birthday unforgettable  🥳"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMWVsUm5PV3Q0UVhwbk9EUXpNMUpMYTJkbGFuYxAB",
            "text": "Les recomiendo sentarse en el bar, Jhonatan te hará sentir como en casa.\nLa vaca frita 100/10\nLechón asado 1000/10\nY los cojitos espectaculares.\nViernes y sábados música en vivo.\nMe encanta este lugar 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM1VVbERUR0k0VW5OclJuTmxlamxMU1hwd1dIYxAB",
            "text": "This is a lovely restaurant in East Harlem I love going to for great food and drinks. Their cojitos is one of my fav drinks in the city!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMVRISlRha1UyTkhWcVptcE5Tbm96YlZOeFRYYxAB",
            "text": "Amazing music. Great drinks and food. Jonathan and Daniella are so kind. Come through! And order the cojito!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUmFIQmZhRVk0U1c1emRYWlBUVkJMTW01bU1uYxAB",
            "text": "Marianne was the best hostess ever!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM09FaExOelo0VEVGM1MxZExXV2MyVUVoUVQxRRAB",
            "text": "The atmosphere was both relaxing and charming, creating an inviting ambiance. The food was delectable, and the service was exceptional. Jonathan and Mariana were wonderful hosts, making our experience truly memorable. We will definitely be returning to this delightful spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWFVGaHRiRVJwWTJaU1VIQmlZalowY1djNFlXYxAB",
            "text": "I came here over ten years ago and the food was great. I went last weekend and the food was awful. I ordered the Cuban parlla that tasted nothing like tomato sauce. And the tostones with the carne molida was also drenched in tomato sauce. It was like eating spaghetti sauce on tostones. The service was good. She gave me a flan for free since she saw I wasn’t happy. I paid 120$ for a few little pieces of chorizo. Because that’s all I ate. I might return for the nightlife and drinks but to dine it’s a hard pass."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFUxTlZOR1UzYkVKVGFWVmpVbWQwVTNsWlJtYxAB",
            "text": "Your dining budget goes further at this establishment. The cost structure makes sense here. The meal contained rare elements and arrived without waiting. The whole staff shows genuine friendliness. The restaurant meets all requirements."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a1MybHlNMmhhZUcxWldqaGpWekkzT0U1RGNXYxAB",
            "text": "Compramos unas margaritas y unos mojito ayer ricoooooo me encantó lo recomiendo en happy hours."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMWNFcGFiM1JPTm1weldVWkxabk5qZEdVM09YYxAB",
            "text": "Jonathan & Marianna’s impeccable customer service elevate an already stellar atmosphere! This is what’s been missing in the service industry. We will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdFRrSTJWR2x5VTBrdFQzaFhZaTFCUW0xUlNGRRAB",
            "text": "Great place live music. Bartender even gave us free shots"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkalp6bHBXVm96Vnpjek1VWlJkMlZ2Y0hoemNtYxAB",
            "text": "My friends and I love coming here. The staff is awesome. The food is delicious. Fridays, be ready to dance Salsa!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMcks2YV9QbzRMUVN3EAE",
            "text": "Al llegar la mesera nos dijo que aún estában listo, así que esperamos unos minutos y la verdad ella fue muy agradable. Yo pedí un churrasco (m-r ) acompañado con arroz blanco “ya hecho del día anterior” al parecer las habichuelas negras estaban quemadas y sabían solo a perejil, las sopas de pollo de mi esposo estaban incomibles, el pollo estaba seco y el sabor era rancio, cuando le di la queja al dueño se puso a la defensiva y no dio ninguna solución y no llegamos a ningún acuerdo por lo cual terminamos pagando todo tal cual; concluimos que solo le importa el dinero mas no dar una buena atención. Aclaración la mesera Laura. es muy buena, su atención es excelente. el dueño a la defensiva y sin argumentos. Me hubiera ido sin pagar. Así de malo es el servicio del dueño.\nMi nombre es Iván Pérez dueño de IPN CATERING EVENTS CREATIONS.\nEl Mojito es el mejor 🤩"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcjFxWUtYcWFhNGl3RRAB",
            "text": "Amor Cubano drives amazing service and an awesome vibe. Stop by here for live music and a family style of service thst you just wont get anywhere else in the city. Drinks are light and well crafted, with amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVHk4ZERhdjlqR0xnEAE",
            "text": "Food, drinks and live music were amazing ! Our waiter Jonathan gave us a great recommendation on what we should order and it did not disappoint, la vaca frita was delicious 😋. Will definitely be back soon!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcTV0dkNSMm9DeVJnEAE",
            "text": "Me encantó desde que entré. La atmósfera. El servicio del bartender. La comida y bebida ahhh y la música 🎶 tremendos artistas!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRzQzcy1WcnBIWWFnEAE",
            "text": "Bebidas, comida, servicio, todo 10/10. Deliciosa comida y los tragos demasiado buenos, como amante del mojito esto es un paraíso para mí el sabor es muy fresco y natural. Amé este lugar!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKN0J3NG15aF9qbmZnEAE",
            "text": "I order food from Grubhub, and it’s not the same place. The beans taste like they came from a can, and my side order was hard as rocks. I hope it’s just a ghost kitchen acting like this restaurant. I know the quality of this place can never be this bad."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM2R2ZHVSeC11bVp3EAE",
            "text": "LOVED LOVED LOVE AMOR CUBANO!! Daniela y Jose were the BEST! They made my birthday lunch so memorable and I can’t wait to keep bringing people back. Please come and visit them!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYU9oYnp0d0ltc2V3EAE",
            "text": "Daniela y Jonathan were beyond amazing. We celebrated my friend's bday and we had such a memorable time.\nMuchas gracias!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTDU1Nl9fNm9HRlh3EAE",
            "text": "This place is absolutely amazing!!! The service was so great!! We were served by Daniela and the bartender, Jonathan, was making drinks that were made to perfection! Everything we ordered was delicious and they were so nice to my baby dog and very accommodating! They have limited outdoor seating and a very beautiful interior design!! I absolutely love this place and I promise you would love the flavorful delicious food and the exceptional service!! Very impressed and will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZmI2b0x2NF9HU3VnRRAB",
            "text": "Firstly, amazing service from the waiter and bartender, Daniela and Jonathan. Courteous, attentive, helpful, and great attitude. The food was also amazing. We couldn’t ask for anything more. Overall, a great experience. And, make sure to try their happy hour drinks as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZVJ6cWlBczhtOEVnEAE",
            "text": "Great, just get there early, closing is at 11pm"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZVhtS3FNNUpXNlJBEAE",
            "text": "Great service.  Jonathan was very polite and gave great advice on food selection"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeWlrS1M4ai1QN2pnRRAB",
            "text": "10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYWpuOUhDMFlQRmFnEAE",
            "text": "Jonathon and Danielle are the BEST!! I did a dinner for my sons 25th and it couldnt of been better or more fantastic!! They gave it all and they went in, my son LOVED IT ALL!! EVEN THE BDAY BUBBLES!!! 😁😁😘🤩🤩🤩🥰🥰"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ2FQc1J3EAE",
            "text": "Great decor and atmosphere. The food was well cooked and delicious. We were all very happy. There's really not much else to describe the visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjZ1VFh3EAE",
            "text": "Lovely family dinner (older kids)…Christina & Johnathan were wonderful! The Old Cuban cocktail was just enough booze & brightness without the overt sweetness of a mojito. The lechón and vaca frita had a ton of flavor and the yuca with garlic mojo was creamy and so yummy. Reasonable priced and great atmosphere."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbjdPQTBBRRAB",
            "text": "Excellent tradicional Cuban dishes!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvejlhOHlRRRAB",
            "text": "Terrible. The steak with onions was not chewable! Must have a new chef. Been coming here for years. It was also a good meal. Will never return!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcThMQjFRRRAB",
            "text": "El mejor restaurante latino del área. Buena comida, buen servicio y buena música, había música en vivo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOVkzSnNBRRAB",
            "text": "Awesome !!! Delicious food & drinks !!\nMariana , Araley & Jonathan are awesome  and very attentive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcjhlVHlRRRAB",
            "text": "Not only is the ambiance incredible Jonathan makes the best drinks I have ever had in East Harlem. The cojito is divine and comes with raw sugar came. The drink is truly to die for.\n\nAlthough the drink is my absolute favorite I also love the food. The churrasco steak paired with the chimichuri>>>\n\nYou have to come here. You will not be disappointed!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcjhmaDZ3RRAB",
            "text": "Amor Cuban is a great restaurant choice. Jonathan makes the best Cojito (coconut mojito drink) in all of NYC. It’s delicious and refreshing. The best drink I’ve ever had! And Christina was a great waitress. Highly recommend this restaurant"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajRYU3p3RRAB",
            "text": "Jonathan and Juan Carlos took great care of us. We got the arepa verde, jamón croquetas, y empanadas de queso y camarones.\nMusic was great. Service exceptional, will def be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NlkyZnBRRRAB",
            "text": "This is such a beautiful place with such amazing people. The staff is extremely kind. The food was absolutely amazing. I would definitely recommend this place as I will also be returning. 😊"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OE4tRzF3RRAB",
            "text": "Great vibes was here for my uncle birthday they took great care of us Johnathan made sure our party had everything we need I will definitely be back here again !!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OU5LRUhnEAE",
            "text": "We went to this place as a second thought because Ricardo’s was overbooked. Well let me tell you, we truly did not regret it. They accommodated us immediately. The food and drinks were amazing and the service was excellent. I highly recommend it. You must check it out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MU9XQ0Z3EAE",
            "text": "Very welcoming and I had a nice time there with my family. The service was great and he offered drinks on the house."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaExpNXdnRRAB",
            "text": "Food was bland. Drinks were average. Not worth the price in my opinion. Staff were very friendly + comped Calimari. Desserts were the only thing worth tasting. Good vibes + aesthetically pleasing foods with no flavor.\nDrinks 5/10\nPlantain Chips 8/10\nYuca rellena 6/10\nSweet plantain ⭐️\nPargo frito 5/10\nTres Leches ⭐️\nFlan⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c3Q2SVdnEAE",
            "text": "Let me say this is one of the best experiences I ever had in the restaurant: I felt so much like home there . I started the year with a great experience when I decided to go to this restaurant to celebrate my mom on one the coldest day in Jan 2024 and May I add I’m glad I trusted my gut . The lady and gentleman working there was so accepting and accommodating of me being late . Long story it was empty , clean and the food was excellent. I would encourage you to try their drinks which was strong and good ; the sauce for the bananas was amazing . I can’t wait to visit again . I felt a lot of culture and that is what we want , hidden gem Trust me if you went to just get wings on their happy hours I’m sure you will not be disappointed but even a romantic dinner would be just as successful"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubm9qbHVBRRAB",
            "text": "3 Stars\n\nI wish I could give a 3.5-star rating, as there were aspects of the experience that I really enjoyed, but some areas left me wanting more. First, the live music was fantastic—it created a lively atmosphere and really added to the overall vibe of the evening. The customer service was also impressive; the staff was attentive, friendly, and made us feel welcomed from the moment we arrived.\n\nAs for the food, it was a bit underwhelming, especially given the anticipation I had. We ordered the Mariscada and the Paella, two dishes I was excited to try. Unfortunately, they were just fine—not bad, but definitely not as flavorful or exciting as I had hoped. They lacked the rich, bold flavors that you’d expect from these types of dishes.\n\nThat said, not everything was a miss. The Tamarindo Mojito was a standout—it had the perfect balance of sweetness and tang, and I would definitely order that again. My personal favorite, however, was the Plátano Chips served with garlic sauce. The chips were crispy, and the garlic sauce was absolutely delicious, making it one of the highlights of the meal.\n\nIf the main dishes had matched the quality of the drinks and appetizers, this would easily have been a higher-rated experience. With some improvements in the kitchen, this place could be a solid choice for a night out, especially with the excellent ambiance and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMd3JMS0l3EAE",
            "text": "The food was good, the service was okay - nothing special; I was hoping more hospitality like some other Cuban places in NYC/NJ, and the music was good but I’m sure it would be better on a live entertainment night.\n\nIf 20% gratuity is added to a party of 5.5 (we had 1 child) then I would expect better service. Also the wait was long considering it wasn’t that busy. Otherwise could have been 5 stars."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aXZYMmlBRRAB",
            "text": "I was going on a sister date with my triplet. My sister was coming to my neighborhood to hang out in \"un Verano en Nueva York\" with me. We were going to the Marquetta for a house music event but wanted to eat something first. I decided to bring her here because i have been here before and i liked it. This place is good for food and entertainment. They participated in restaurant week and had a fixed menu. Can't complain about the food, but you need to be very patient with the service staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqN09pbDhBRRAB",
            "text": "Randomly walked in yesterday and this place is really cool. Very nice vibe and not too overwhelming. I was craving a sandwich and when I found out they infact did have the Cuban sandwich on the menu, (my favorite sandwich), I had to get it. This was my favorite Cuban Sandwich I've ever had. Major points to them because when I've had Cuban Sandwiches from other places, something was off each time. This one was so good from the portion size to the bread texture and flavor combination. My server was Daniela and she was amazing. She was kind, sweet and really knew what she was doing. She also made some delicious classic Mojitos that were on their happy hour menu (from 12-7pm). I'm not typically in Harlem but if I am in that area again, I'm definitely going there.\n\nOne thing to note though. If you're the type that typically pays for your meals using smart pay, they don't accept that yet so make sure you plan accordingly and bring classic payment methods.\n\nOverall for my first time: A"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaHJiQjZRRRAB",
            "text": "This is easily the most underrated restaurant in East Harlem! Great staff, amazing food and some of the best mojitos you’ll ever have, Amor Cubano delivers!  I’m still not sure how people aren’t lining up outside to dine here.  Place has a super chill vibe and the staff is welcoming and attentive."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOXR5VzZBRRAB",
            "text": "Wow!! Wow!! Wow!! O.k. so I literally really loved everything at Amor Cubano.!\nArielle was our server, and from the front door, she was nothing but friendly, kind, and helpful! The food,...oh my gosh..CRAVE WORTHY! We started with the Yuca Rellena...sooo good. Get 2!\nI had the Fried pargo...now I love fried pargo..it was perfection! Not too much, and perfectly fried... was very tasty!\nMy husband had the Bistec de Pollo..he ate it so fast! The rice & and beans were to be savored.\nOverall, the restaurant is nice, cozy, and feels very friendly. The bartender Jonathan was very nice and made great drinks!!\nWe will definitely be coming back😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ3R2cHNRRRAB",
            "text": "A+. Everything was great. Happy hour til 6pm on a Friday was awesome. We had empanadas, tostones, paella and skirt steak. All of it we would order again! Mojitos were made properly with cane sugar. Yum!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkb2VibmJ3EAE",
            "text": "My husband and I had a fabulous time and delicious meals on Valentine’s date night.  My husband had a skirt steak that was done perfectly medium rare and its blue cheese sauce was very tasty.  I ordered a branzino that was crispy and delicious.  The atmosphere was very lively with two women guitarists who were awesome players and lovely voices accompanied by fantastic drummer. We were fully satisfied and decided we must come back again👏🏼👏🏼👏🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcXFtdUxBEAE",
            "text": "Service was spotless. Jonathan and Kathy were more than amazing! 100% recommended. Coconut mojito hit the right spot and the passionfruit juice also was pretty fresh. We tried the Paella and the Palomilla. Everything was well seasoned and the portions were huge, we still took a lot to go. Definitely coming back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkODRlYmVREAE",
            "text": "It was a long, eventful rollercoaster of day... desperately in need of some sustenance, we looked for a spot in route to our final destination.\n\nWith one of my favs, we decided to visit Amor Cubano, based on a found memory of their champagne mojitos. It was a cold Saturday night in January and all the stars aligned. We pulled and found parking right outside the door. We entered and was seated immediately without reservation even though it was crowded and the first week of NY restaurant week.\n\nWe perused both the regular and restaurant week menu. In an attempt to keep it simple we went the regular menu and ordered everything at once. Of course two champagne mojitos and empanadas to start. For entrées, we went with Arroz Con Pollo (for me) and Churrasco- grilled skirt steak (for my partner in crime). Customer service was good, food came quick and hit the spot. We enjoyed it all while listing to the live band.\n\nThis was a nice ending to an eventful day.\n\nJust A Note:\n\nA tag on IG… gets you a spin of the bonus wheel. I snagged a gift card for my next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ1lTb3l3RRAB",
            "text": "Amor Cubano offers an authentic taste of Cuba with amazing food that transported me straight to the vibrant streets of Havana. The service was impeccable, and the restaurant's Cuban-inspired artwork added to the immersive experience. Everything about my visit was truly awesome.\""
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHczd1NXF3RRAB",
            "text": "Yummy Cuban Food in East Harlem.\n\nThe food was really good just on the pricey side. The waitress/bartender was phenomenal and incredibly attentive.\n\nI saw a stage with drums and a mic stand so I’m of the belief they have live music. Hoping to return to enjoy it over drinks.\n\nThe decor was tasteful with exposed brick on one side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMWMyUWFBEAE",
            "text": "Been a minute since I’ve eaten here. We sat outside (seeing outside seating in the hood still baffles me lol) the service was ok. I think they were short staffed. I had the camarones al ajillo to start & palomilla as my main. Everything was delicious. Can’t go wrong with anything on the menu."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeTVXNDJBRRAB",
            "text": "Restaurante cubano fantástico.\nLos precios un poco elevados pero la calidad y el sabor fantásticos. Todo lo que pedimos, muy recomendable. Los patacones, las empanadillas, las croquetas, la yuca, los garbanzos o la arepa.\n\nLa atención muy buena así como la limpieza, la decoración y el emplatado de los platos.\n\nLo recomendaría 100%."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNFl6TktREAE",
            "text": "Went on a Friday. After happy hour. Drinks were good. Sat in the bar area. Enough sitting. The band was amazing 👏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OWViUVRBEAE",
            "text": "WOW! The food is delicious, the service is out of this world, and the live entertainment is practically a free concert! Johnathan and Daniella never fail to take care of my company and I when we are here. My favorites have to be the yucca rellena and the churrasco. But everything is delicious! Flavorful but not overpowering. I come every week, the mojitos are the best in el barrio!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOHF1WVpnEAE",
            "text": "I really like this place. It's such a fun place to go because there is fabulous live music, kind staff, and amazing drinks. I liked the food until I got my main dish, which included a very overcooked lobster tail. My husband said his beef dish was amazing though, so this place gets 4 stars from us."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURveko3SGtnRRAB",
            "text": "Excelente restaurante cubano. La comida estaba deliciosa, desde que llegamos nos sentimos en casa todos nos recibieron con una sonrisa y el servicio fue excelente. Tienen una gran variedad de sabores de mojitos nos encantaron. Y habia musica en vivo, todo los clientes empezamos a bailar y cantar. Completamente recomendado!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdHJlMFpnEAE",
            "text": "This is my go-to restaurant for mother's day and her birthday. We've been celebrating at Amor Cubano for 3 years and they never disappoint. My 88 year old mom loves the live music, usually a trio, taking my mom through music of her Puerto Rican childhood through to the present. We've always had top notched service and that touch of home, a welcoming spirit. I would also recommend Amor Cubano for a date night. Make reservations and prepare for one of Spanish Harlem's food gems. What's not to love. Extremely highly recommended"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2M3JmUk1REAE",
            "text": "El mejor lugar para tomar deliciosas bebidas. La comida es asombrosa y el servicio el mejor que he tenido hasta el momento. Les recomiendo mucho las margaritas y la sangría blanca.  Y muchas gracias a Jonathan por las hermosas fotos que nos sacó. Definitivamente volvería"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcTUzSE9BEAE",
            "text": "Really loved everything about this place. I ordered the Picadillo (photo) and it wasn't as flavorful as I'm used to, main reason for the star loss.  But everything else was amazing: cocktails,  churrasco steak, tostones with cilantro dip sauce,  guava bread pudding, Cafe bombon!! There was also live music which was a pleasant surprise!!! And service was awesome. Will definitely be back"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLLWFmMWZ3EAE",
            "text": "Went to Amor Cubano yesterday for my birthday. 1. The service was impeccable. Didn't know which Sangria to get the waitress brought me a shot of both so that I can decide. 2. The food was very good. Only thing I asked for my Churrasco…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVamN2RElnEAE",
            "text": "Awesome little Cuban restaurant in Harlem. Staff was super polite spoke English and Spanish. I ordered a lunch special which comes with an appetizer a lunch special dish of your choice and a drink for about $15. The regular dishes were around $17 to $23 depending what you get. Some sides were $5. But the food was great! Had a beef soup and a Ropa Vejia with white rice and black beans. Beans needed alil salt but nothing really to complain about. The restaurant was very nicely decorated and very homie feeling. Also had a stage for live bands with drums on set. I can imagine how alive the places come on weekend nights. Staff was very attentive and making sure everything was fine. I def recommend it. There is a full bar with some Cuban drinks available as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURheXAzSlJREAE",
            "text": "Food and service was excellent.  One waitress at the time we sat down, but she took care of 3 indoor tables, 2 outdoor tables, and 4 at the bar. Like a champ. Very good at her job."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNTVqaG5BRRAB",
            "text": "I LOVED this place. The food was amazing, the live music was amazing! I would def be coming back here again and again! Highly recommended!"
        }
    ],
    "reviews_count": 77
}