{
    "name": "SAPOARA Restaurant & Bar",
    "place_id": "ChIJvR3iaP31wokRuMJSy9UX7wI",
    "grid": "MN11",
    "address": "2262 1st Ave 1st Floor, New York, NY 10035, USA",
    "rating": 4.5,
    "user_ratings_total": 437,
    "phone_number": "(212) 256-0199",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRmNrWTJUbEo1ZDBaZlMyVnVNbGh6T1V4RVNIYxAB",
            "text": "I always have a great time, servers are excellant and the dj is fire for friday nights"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdE1XcGhaVTlOZUVRM1pYZE1NMFJQWTJSQ1VsRRAB",
            "text": "I started coming here every Friday for about two months and it's always a vibe. I really enjoy myself each time and sing and dance to the songs. The people and the staff are very friendly and welcoming. I don't regret coming here at all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVFFtdzVUVmRvWDNobGNsQjJMV3R3UzBSS2RYYxAB",
            "text": "Try the steak sandwich it was off the hook delicious definitely a must drinks are also great and music"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xablZVMXhNelJNU21KUE1tMDRla1pMYVhWTmExRRAB",
            "text": "Fantastic food! Fantastic Drinks! Great music. Welcoming vibe. Amazing staff and owners.  Can’t recommend it enough !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWFRsZV9xX3BmZW13RRAB",
            "text": "A good place to chill with friends and colleagues. The staff is very warm and professional. a good business we should support."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeWNEMF93RRAB",
            "text": "Loved this place. My first public Karaoke. The people were welcoming. The food was spot on for a night of fun and drinks. I went to celebrate a friend's birthday.  It has that \" You wanna go where everybody knows your name\" kinda vibe. Good people.  The host I believe his name is \" Randy\" is fantastic!! \"Wednesday nite Karaoke\""
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdnBhaHFBRRAB",
            "text": "Came on a  Friday evening. The food and service were good. The DJ was spinning good R&B. The restaurant is small and a little unorganized when it comes to waiting for a table. I get that it's a neighborhood spot, and everyone knows each other, but if it's a restaurant, treat it like one. If it's a lounge, change it to a lounge and not a restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN3YyanhBRRAB",
            "text": "Went for a friend’s birthday. From the moment we walked in we were greeted by the friendly bartender then Darlene our waitress. Food was amazing everyone was so welcoming and accepting of us being 4 lesbian women. The crowd was fun the music was great. When they sang happy birthday to our friend the entire restaurant joined in. Everything we ordered was delicious. We are definitely going again. Such a great spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNXJManZBRRAB",
            "text": "One of the best spots in Manhattan New York"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncXZHRm1BRRAB",
            "text": "Friendly staff, great drinks nice place 👌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeExMRGVREAE",
            "text": "IT’S ALWAYS A PLEASURE TO  WINE AND DINE  HERE AT  SAPOARA!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNDZmd0lREAE",
            "text": "I walked in knowing this place qualified for the EBT meals program and let me tell you .. this place was a great surprise.   The food I wished I've taken pictures ,but it was all too good I didn't bother.  The owners are great , friendly and professional.   I had the chicken caribe tenders and nachos .. plus order of mofongitos and everything was awesome...  Big props to crew who made my experience a memorable one . I'll certainly return.   grácias.."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNDVPUnJBRRAB",
            "text": "Probando nuevos lugares y  Los Rico qué se come acá dios ... y muy buen servicio.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd2VYeFhnEAE",
            "text": "Great experience at sappers, super friendly staff. Def will return."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma3NfSURBEAE",
            "text": "Great bartender (JoJo i think is his name) and beautiful and friendly crowd.  Music is great and I love the ambiance!  I would go back here, want to try more of the food and drinks."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MDRxZWFREAE",
            "text": "Had a get together here for the first time . Great staff, food was delicious, and music was hitting all night! Great chill spot !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NDctWmxRRRAB",
            "text": "Sapoara catered our family event with very short notice this past Sunday night, great food, 2hr Open Bar and great music, service, friendly staff and very attentive\n\nTruly an incredible night and great space\nThanks for making it a night to remember, we appreciate Sapoara and staff so much 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdEtYZVFnEAE",
            "text": "The food was amazing. Perry was very attentive great customer service over all a nice Lil gem in harlem. I'll be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueElhUDZnRRAB",
            "text": "Great service!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueFByUHlRRRAB",
            "text": "Always a vibe here! Everyone is always friendly and welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId0ltU0tREAE",
            "text": "This just an absolute gem in the heart of Spanish Harlem NYC. Gizelle, Jeff and Staff are top notch hosts.  Have a visit and you won't be disappointed with the service, food, music and professionalism.  I recommend all food selections below. Great place to host your next event.  Awesome hospitality guys, as always..thank you!!\n-  @funky_frank_bboy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTltZnhBRRAB",
            "text": "Wes was amazing. I would recommend this place for brunch  if you’re celebrating a birthday or occasion. We celebrate all of our family occasions here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ZzYtZFdREAE",
            "text": "Wow what an amazing place to enjoy a good meal and speak to fascinating people. Ofcourse I was reading the (hater’s) reviews about the place but i decided to see it for my self. Wow again, the service was very nice and even thou it was packed, Perry the BOSS made sure each and everyone was attended. And Joseph the bartender killed it in the drinks🙏🙏🙏.\nFabulous place to enjoy watching sports and engaging with good people. Sapoara rocks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NmE2RXhBRRAB",
            "text": "Great atmosphere ! Spanish Harlem gem with great food and music. I love Wednesdays karaoke I saw it on the news and never stopped coming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Nlk3S0ZnEAE",
            "text": "Great customer service ! Great staff ! Must visit ! I definitely will come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M3I2c3VRRRAB",
            "text": "Great place always a good time recommend the garlic fries and salmon bites"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3M3A3a0x3EAE",
            "text": "Good ambiance, we came when it was slow and we had a great time. Music was on point and the service was spectacular. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bUlXVWFnEAE",
            "text": "First off, Joseph aka JoJo was so kind to us! He was patient and respectful. Happy hour was on point, shots included. Overall good music, good chill vibes when you want to have a good drink and good food. Recommend 100% Oh, and Karaoke on Wednesdays!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OE5TQ3RBRRAB",
            "text": "Was AMAZING 🙏 we had early dinner for 3… Ordered a bit of the best… Chicharrones de pollo, tostones with aioli, rice and beans, truffle Parmesan fries, grilled shrimp and chicken Caesar salad with  perfectly grilled chicken 🙌😍🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z0p2Q1pBEAE",
            "text": "Lit"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NWJ5VjZ3RRAB",
            "text": "Came on a Wednesday evening with my party while the restaurant was having Karaoke night and Happy hour deals all night. The staff were friendly and welcoming and brought us to the patio where the sound and music were gentler. We really appreciate it as we can still have conversations during our stay. Although it took a very long time for our snacks to arrive, the staff/owner & DJ came by to ensure we're having a good time. We really enjoyed the Chicken Caribe sliders & Beef Empanadas. The Caribe sliders were tasty but just a tad too salty for us. Their draft beer selections were good as well. The ambient was fun and lively. We also noticed other patrons seemed to be having a great time. We loved the energy of their DJ.\n\nWe highly recommend this restaurant/bar if you're looking to support a family owned business.\n\nRecommendation to the owner to update online menu pricing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cU5YWk5BEAE",
            "text": "Enjoyed a tasty dinner here on a hot summer night. My family and I loved the food and the service was great! We were made especially comfortable by the fans that they had going. The music and ambiance were a nice addition."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OE11d3R3RRAB",
            "text": "Staple in the community. Always love it here. - Echevarria-Prado family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMzhyRUh3EAE",
            "text": "Best HH vibe on UES 116th. Thanks Wes for the attentive service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjc3R29RRRAB",
            "text": "excellent customer service and great energy. the music, food and waiters efficiency would definitely recommend and come back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjU3SnZ3RRAB",
            "text": "This lace has amazing customer service n outstanding service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjVicmh3RRAB",
            "text": "This place is a go-to!!! They did is amazing!!! Food is soo good! It’s literally a hidden gem!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibi1hWTNnRRAB",
            "text": "Came for a quick brunch with some family, was hosted by a great smile named West. Food was barely a wait, great happy hour deals. Music had my aunt thinking we still in the early 2000’s on Saturday 10/10 atmosphere. Bottomless mimosas, sangria was great, definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaHF2czR3RRAB",
            "text": "Unfortunately with an 8pm reservation we did not receive our food until 9:30pm. Only four guest might I add. This is after waiting 30mins to get out order taken. The waitress was very pleasant and kept apologizing. When the food finally arrived ( steak quesadillas) the steak was dry, and cold. The cheese was not melted. Receiving the bill they double taxed us. They charge tax per item and at the end. Manager said it was a card fee mind you were were paying in cash. Speaking with the manager just made it worse the logic was not there. Do not recommend for dinner maybe a quick drink and some good music. Can't tell you how the drinks were didn't have any alcohol at dinner. Eat at your own risk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibXMtWlhBEAE",
            "text": "Great atmosphere, food, music and the hosts are Awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX2ZLdG5BRRAB",
            "text": "I had a party of 9 for a celebration. Food was amazing but the service was horrible. Meaning i made this reservation several days ahead to make sure everything was going to go well. Apparently they were “short of staff”. Knowing they had a party coming they lacked on getting emergency staff. The service and the timing of the food coming out was ridiculous. Food was getting cold while waiting for the sides the structure of the way they were making the food and bringing them out was terrible. Mind you they had the audacity to tell me that a reservation of 20 were coming and the area i reserved had to be brought inside 🤨. They couldn’t even bring out food at the right timing for 8 people what makes you think they would do a better job serving for 20!!!!  Sorry the restaurant industry is in so much competition and they were horrible on keeping their reputation alive. I would never reserve a party here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ME56TjVRRRAB",
            "text": "Great staff and drinks. Fun crowd, friendly staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbmJqQ0JnEAE",
            "text": "Nice atmosphere a bit small and food was decent .,, waitress was great"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweHQzX2RREAE",
            "text": "This place is awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMTVtaTZ3RRAB",
            "text": "If u gonna go there for drinks then is awesome. Food quality sucks. Jumbo wings are pretty much puerdue size wings"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENGRiWFJBEAE",
            "text": "Good is great hospitality awesome place ja a bit tight but management awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbFBhZG1nRRAB",
            "text": "AMAZING BARTENDER!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbGZfUEpREAE",
            "text": "Food is amazing!!! Cozy and welcoming atmosphere, must drop in if in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOVBPdnJBRRAB",
            "text": "Is good ♥️♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOanVPb2V3EAE",
            "text": "It's 2024 and this place is still a hit in my heart ❤️ 💙 💜  I highly recommend coming to this beautiful establishment nestled in the heart of Spanish harlem on the east side. Come show some love to this Gem plus the best thing about this place besides the food, are the amazing people! It's such a vibe... love you 😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZ2F2VDd3RRAB",
            "text": "Great atmosphere, good service, fresh delicious and generously portioned food plus affordable prices (menu items priced under ten dollars). Originally booked seating for a party of twenty-four with Jackie Guzman who was very kind and caring, we had a large group of eighteen out of twenty-four same-day. The staff were so accommodating and flexible with meeting our groups needs. The manager Perry ensured a positive experience overall and made us feel welcomed, at-home and like family. Thank you for making my thirtieth birthday so special and unforgettable!! I highly recommend!! P.S. food and drinks were so delicious, there was no opportunity for additional photos of other items food and drinks were gone."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMG9xcUl3EAE",
            "text": "The Food Is Great!\nRecommend Trying It!\nI will update Food Pic's😊\nUpdate 9/30/21 Food as always was great and the delivery time wow! Fantastic\nWe love you Chef Jeff!!!!\nUpdate 1/16/21\nLamb Chop w/Mash Potatoes, Chicken Wings w/Beans and Rice The big surprise for me is I don't eat Egg Plants but, Chef Jeff got me hooked now on his Egg Plant Stew put it over white rice as seen in photo\nUpdate: Still The Best!! 6/2/2022 Steak or Grilled Chicken w/Onoins, White Rice and Black Beans*Forgot those Veggie Burgers Man!!!!*"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtN2JYck5REAE",
            "text": "This isn't my first time coming here but I highly recommend this place. This is the only place I know that has an extended happy hour. The food is amazing , the drinks are bomb, service is amazing. Overall 10/10\nI always enjoy myself every time I come here. Looking forward to going back real soon!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVOXFHRDhRRRAB",
            "text": "I had 'The Lamb Burger' and.... !Wow! That's the best burger i've ever had. Period. Their drinks are on point. The Staff is super inviting till the point they make you feel that you are at home!. The owner took time to come over, meet and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSZzVlNUZnEAE",
            "text": "This spot was so lit, the drinks were strong and good, the food was bomb and the service was amazing. Definitely my new go to spot for happy hour and a good burger. I’ve got to try the wings next time!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJanRQRlNREAE",
            "text": "Love Sapoara ,The owners are the best, Shout Out  to Gizelle & Jeff,  they are truly like a Family to Me !! When you sit and eat the delicious variety of meals Jeff personally makes and keeps inventing , for me it's amazing, not to say that Jeremy dont meet up to Jeff standards, But over all it's a place where I feel at home with the owners Especially and then the Staff !!! To Continuance years of  Blessings upon Blessings to this Bar/Restaurant and may it grow to be a 5 Star, which in my eyes it is Already !!!  Much Love always... Angie & Rafael !! 💯🙏💯❤💯😍🥗🥐🥣🌮🍗💯😜😋😜💯❤💙❤💙😍😘😘😘😘 ... ( just to think these are very little posting, Knowing I have much more priceless memories, but these will do for now !!!.,,🤷‍♀️ !!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NnU2N1J3EAE",
            "text": "Their food is decent. They got a new menu which doesn't include Alligator items anymore. The chicken empanadas and chicken quesadillas are most popular items. Affordable place to spend some quality time with friends."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOC1TRUdREAE",
            "text": "Amazing place, food was really good and service was outstanding...uff dj the best part music kept coming and it was really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaDRxb1NnEAE",
            "text": "We were a walk-in party of 6. They advertised the sandwich of the day and most of the table got it. I had a salad and a drink. The music was good and I can tell they have good business."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2OVpqbW5nRRAB",
            "text": "The vibe was amazing, music was great, the bartenders are amazing. There margaritas get you very tipsy and you really have a good time here"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNXUyX3lBRRAB",
            "text": "Stumbled upon this cute little places when a few friends invited me out for drinks.  It is cute and small with a great menu. The sangria is absolutely amazing and my favorite part was my bartender Eve. She was super nice and charismatic really made the time worth while"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNTZxRklnEAE",
            "text": "Early happy hour is petty dope lunch special was on point apps hit the spot and the drinks where made really good and I'm picky with the margaritas I definitely recommend this spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MU9uck5BEAE",
            "text": "One of the best places to go if your in east harlem.  Always treat us well here after our St. Anthony procession. Highly recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNFpqZUR3EAE",
            "text": "From day 1 both Perry & Jackie worked with me on a Surprise Retirement Party. They treated me like family, worked with my budget, the food selection and more. We rented the location for this private event. The staff were amazing and accommodating. From the cook to the wait staff to the manager they made the party experience a total success. Everyone was ready and steady with anything we needed. My guests were happy. We had a cash bar. The drinkers gave the drinks and prices a good review. I couldn’t ask for more. Sapoara, thank you for making our festivity a more than great experience and thank you for a hospitable staff. You guys are the best."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJN1pqRkZBEAE",
            "text": "My New favorite place!!! The food is AMAZING!!! Very friendly laid back environment. Patio dining option is a plus as well. Good quality wine here also! 😊…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac29ic3ZBRRAB",
            "text": "Went here yesterday with my boo. Food was good, good portion size. Drinks were strong and delicious. The music was 90s hip-hop so the vibe was nice. Good neighborhood spot! We will definitely come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoanQyX0VBEAE",
            "text": "great neighborhood spot! it has cute decor with a backyard space. the service is caring and quick! the food is good and the drinks are classic. fries are perfectly made and the chicken tostones sliders are my go to! i think this is a really good and solid weeknight spot as they have events and different music each night!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOXZDNVdnEAE",
            "text": "yummy! An event here and the owners were fantastic. Such great hospitality. The food platter was delicious and the right amount."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXV2NHR3RRAB",
            "text": "The only good thing I can say about this place is that the drinks are great and also cheap! As far as food and service wasn’t to my expertise. My wife and I both order  two entrees and one appetizer, my entree came out first, second  the…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHd01hTDBRRRAB",
            "text": "Supported a friend food wasn't so good but the backdrop was cute!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNDQya1dREAE",
            "text": "This restaurant is one the great hidden gems of NYC. The service was top notch as Bree was excellent! The drinks are on point and do not disappoint especially with the endless supply from the brunch menu. Marcy does her thing behind the bar…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMHB6dzBnRRAB",
            "text": "The place is quaint, and snugged.. it’s not for party animals.. it’s ambiance favors privacy and personal space. The menu is not limited, due to the Chef’s open mind. They accommodate cultural awareness as well as the seasons. The music can be loud on late night weekends,  but it’s what is to be expected when winding down from a hard work week and turning up before a good days rest. The drinks are pleasant.. giving frozen options all year around is never a bad idea. With a healthy draft selection that’s always trending never neglecting the all time favorites, very reasonably priced. And the staff are kind and attentive I don’t wait more than I need to place an order. My food is hot and always fresh tasting I’m a big fan of this! I watch as they sanitize my space, and that’s an A+ in my book.. I’ve never sent a meal back Take it from me, good food is not fast food, and the best food is worth the wait! Amen."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bk92aENREAE",
            "text": "I held a graduation event at Sapoara and it was the best choice I made. Since day 1 that I contacted the party coordinator, Jackie, I was welcomed with great vibes and I knew that I had made a great choice. Our server Sam was very attentive, friendly and accommodating. Perry also made sure we were all having a good time and helped out with the speaker so we can play our own music. All in all I give them 5 stars because the food was great, the drinks were great, the vibes were great and the service was great!! I appreciate the entire Sapoara staff for all of the efforts they made to make this event enjoyable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eXFUZmVnEAE",
            "text": "I had such an amazing time celebrating my Birthday at Sepoara.\nA Hassle-free experience was what I received. The wait staff was attentive and friendly. A shout-out to Elida for being awesome!! The place is warm, cozy  and intimate.\nThe food was great, the drinks were good and the DJ was on point. I would definitely\nrecommend this establishment to anyone looking to have a good time with no fuss."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtM3AtczNBRRAB",
            "text": "If your looking for an authentic spanish restaurant in East Harlem this is the place to be. Giselle and Jeff were so accommodating to my family. We were a party of over 15, we were celebrating the memories of my mother that grew up in El Barrio her whole life. They made us feel so welcomed in their restaurant we were able to play our own music as well and dance in their backyard space. The food and drinks were delicious! We were able to try it all and ordered crafts of their rum punch sangria.\n\nThank you again for turning such a sad moment in our lives into a positive one, dancing and eating delicious food with my family in memory of my mom meant the world to me. We will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwalBhcDB3RRAB",
            "text": "Boy we had a time last night. I got to do Karaoke without being judged. The food was amazing. Those $2 shots baby. #happyhour. This girl was happy and we cannot wait to return!!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncnYtbWxBRRAB",
            "text": "I went there for the first time yesterday and the staff were so welcoming and friendly. My bartender's name was Eve and my server's name was Bree they both did a great job providing me with excellent service. The drinks were good!!! Bree…"
        }
    ],
    "reviews_count": 77
}