{
    "name": "Perch",
    "place_id": "ChIJac7LXe33wokRMbEC0elomNE",
    "grid": "MN11",
    "address": "1693 Lexington Ave, New York, NY 10029, USA",
    "rating": 4.7,
    "user_ratings_total": 201,
    "phone_number": null,
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUGFsTnpPSFk1ZUdGaFFreHdPRjk0U25oNVZVRRAB",
            "text": "A true gem in East Harlem! The place is small and absolutely charming. Every little detail is carefully thought out to make the experience feel special.\nToday we were served by Miguel, who was amazing! The cocktails were incredible — honestly some of the best I’ve ever had. Miguel knows his craft, truly an artist behind the bar.\nThe food menu has something for everyone, and everything was delicious. Definitely one of our favorite spots for date nights!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNWQxQTVWMUprTkRNMlpFUmpjbWxJVTFreVptYxAB",
            "text": "Quiet atmosphere. Best drinks, cool crowd, great for late or early drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eGJrdFJPVkp6V1U1b1NtdEhjblZzZWpkWVZsRRAB",
            "text": "Tiny but gorgeous spot with a wildly creative cocktail bar, friendly and approachable staff, and surprisingly interesting food menu to accompany your drinks.  I was looking for the perfect spot to replace my go-to 67 Orange Street which had unfortunately closed.  And I found it.    I would probably go here every night if I lived in the neighborhood, dining on flawless oysters and rillettes, and quaffing cocktails that taste more like elixirs than just alcohol.   Acoustics are controlled which permits easy conversation and lighting is subdued and romantic but you can still read the menu.   Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbGFtdEhUVzkzZDB4VGJrdGpWWEpWWVRWeldsRRAB",
            "text": "This place has an out of world charm. Really cool like 1940's big money appeal. My gf and I really enjoyed this place the recommendations were spectacular. Check out the pictures below, check it out for yourself."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKemRGWTVNMkk1T0RkaFZsQnlkV2hNYWpBNFpHYxAB",
            "text": "Lovely cocktail bar in east harlem. Sometimes I'm hesitant to try cocktails at bars that have a lot of bitters, etc as they seem to be over engineered. However, the cocktail I had at Perch was so delicious. Well made, beautifully designed. The bar is super cute and perfect for a casual date night. Bar seating only!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdE1VTXdWa1JWT0UxM1dIcDRielY1Y1ZKSFQxRRAB",
            "text": "I had high hopes for this place, but unfortunately, it fell short. The wine was actually quite good, which makes it even more frustrating that it took 10 minutes just to get a second pour. The food was underwhelming—nothing to write home about—and definitely didn’t make up for the poor service.\n\nWhile the bartenders were friendly enough, they were simply not attentive. It took far too long to get anyone’s attention for anything, and the wait for basic service really soured the experience.\n\nOverall, very disappointing. Not sure I’d return, especially with so many better options out there 😞."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLXUtVHR3RRAB",
            "text": "I love this place.  The decor is really pretty, and sets the mood for the establishment.  The drinks are amazing (the one with the smokey mezcal sticks in my mind especially), and are well crafted.  Of course that is because of the staff who go out of their way and use their experience and knowledge to produce such satisfying drinks.  The food, so far, has been unique and hits the right spot for sharing size portions.  All in all, a great addition to my neighborhood for a relaxed evening out or an after work drink.\n\nEven more years later update: Jason and Miguel are amazing.  Great cocktails and service, and the only reason I go there anymore.  Stability in the team of mixologists/bartenders would go a long way for this place.  Sadly, I have to pick and choose the days I walk in now based on who is behind the bar.  Miss the days of anyone being an amazing server/craft cocktail maker/conversationalist when I walked in the doors."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMGF6TjZTVEJPTUZReWFqVmpVWEJWYmtaTlVVRRAB",
            "text": "If you’re passing by, welcome to one of the most unsuspecting gems of the upper east side. Quaint and humble, Perch sits just around the corner, begging the suspicious explorer to dive deeper into their curiosity. You will find a quiet oasis upon entry, one where the service is personal and the guests are interesting. If you are reading this and closeby, you have one of found the most interesting spaces in this diverse town. Take your best date or bring a friend, you wont be disappointed!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRGNYbGZaMkZZTWtseFdsVnhaRFZuYkdGTU9FRRAB",
            "text": "A small and intimate place where to drink delicious cocktails. It's so great to have such an amazing bar in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNWNXaFpPV1ZEVEhGVFJuaG5iRkp3WHpZdFkzYxAB",
            "text": "Amazing food and cocktails in a gorgeous space. Went early for happy hour and easily snagged seats right away. Cocktails are interesting, well crafted, and boozy. The food was dynamite - get the longaniza croquettes!! Can’t wait to go back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMGVtbHJPRzlxTVRrdFJteFZkalY0YkZoNVNIYxAB",
            "text": "No Diet Coke"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bldFRXRWMFpNVHpCSk9WTk9kRXBVWVMxSFJsRRAB",
            "text": "Cute bar! Truly. Kind of expensive though"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb1NITkxZbUY1Y0c1aVRteDJVRkJoTkZKU1QwRRAB",
            "text": "Is a must in NYC"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeXY5djM4Z2RYSkRREAE",
            "text": "Fun and inventive cocktail bar in the heart of east Harlem"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT1ZqYUw5X1p2TTNBRRAB",
            "text": "🍸✨ A Vibe You’ll Want to Live In — Perch Is a Whole Mood\nIf you’re looking for just another bar — keep walking. But if you're after handcrafted cocktails, seductive ambiance, and that feeling of being exactly where you're meant to be… Perch is the spot.\n\nThe mixology here is next level. Every drink is a work of art — both in flavor and presentation. I ordered the Old Fashioned, and it was pure magic. Bold, balanced, and totally Instagram-worthy.\n\nThe vibe? Effortlessly cool. Dim lights, smooth beats, and just the right touch of downtown edge. Whether you’re on a date, out with friends, or flying solo — it somehow always feels personal.\n\nStaff are sharp, stylish, and know their craft. They don’t just serve drinks — they elevate your whole night.\n\nPerch isn’t just a bar. It’s a destination. One of those rare places you discover and immediately want to gatekeep… but can’t help telling everyone about."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHF5cHN3RRAB",
            "text": "Happy to see such establishments in East Harlem. I find it a bit overpriced for the quality of the drinks."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREa09uaERREAE",
            "text": "The best cocktail bar in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MU1tUHdRRRAB",
            "text": "Josh was amazing, food was great! You must try the bread dip combo so delicious! This was a lucky find with a few friends but the drinks, the service and the food was awesome!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MEwteHBnRRAB",
            "text": "Delicious cocktails and tasty food in a warm and inviting space"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dWY2ZlZnEAE",
            "text": "I recently had the pleasure of visiting Perch, and I can confidently say it’s one of the best cocktail experiences I’ve ever had. From the moment I walked in, the ambiance set the stage for an evening of expertly crafted drinks and impeccable service.\n\nWhat truly sets this bar apart is its commitment to quality ingredients and presentation. Each cocktail is a work of art, thoughtfully balanced and beautifully served. The bartenders here are true craftsmen, taking the time to explain their creations and ensuring every sip is an experience in itself.\n\nI usually stick to my go-to drinks, but I decided to step out of my comfort zone—and I’m so glad I did. Every cocktail I tried was exceptional, surprising me with flavors and combinations I never would have chosen myself. Whether it was a bold and smoky mezcal creation, a delicate floral-infused gin cocktail, or a rich and complex whiskey blend, each drink was perfectly executed.\n\nIf you appreciate top-tier mixology and a place that takes cocktails seriously, this is the spot. I can’t wait to come back and see what else the talented team behind the bar comes up with next. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRODhXdzR3RRAB",
            "text": "Tonight was fantastic as always. Christian handled the bar like a champ. Highly recommend to everyone!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNGVDTTNnRRAB",
            "text": "Bartender was very rude. Won’t be returning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLXNPQ3V3RRAB",
            "text": "Chic vibes, excellent cocktails, and cute tapas. All bar seating. Good for a friend meetup or a date."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRc3ZiWHRRRRAB",
            "text": "I had a mother and daughter date. We wanted to visit a location that we have not visited before in our community. I let my daughter choose the location, and we ended with Perch. It is a small social place. It one big bar, no additional table. The menu is small. So if you want a full course meal and are super hungry,  i suggest going elsewhere. However, I love that they had oysters on the menu. I'm not sure if a worker called out or running late, but service was slow. The whole bar was full of customers and one bartender. The drinks were beautiful after waiting fifteen minutes for it. I had to wait longer just to place a food order. Once we finally placed our order, what calmed me down was the food. The kitchen for me made the evening. We ordered different items, and they were all delicious. The decoration of this place is sleek and clean. The ambiance was great, and the soulful music in the background was the right mood my daughter and I wanted. Will definitely give the place a second chance and hope the service is quicker next time."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNEpLa1V3EAE",
            "text": "Excellent cocktails and oysters. I want to go back to try more of the menu. I would say they focus solely on sippers, so if you're a guzzler you need to breathe when you're here. Besides the oysters, the meatballs provide a great salty cut against their cocktails as well. As for the cocktails, I think this is a place where you leave your ego at the door and ask for help. It'd be surprising if you knew exactly what you wanted, so come in with some generic things you like. Then let them navigate the menu for you the first time. You'll get the hang of it later."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM2F1bjJBRRAB",
            "text": "Frank is fantastic. Enough said."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaTYzZDV3RRAB",
            "text": "Delicious cocktails, cozy atmosphere"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc3VxYWFBEAE",
            "text": "Overpriced drinks for happy hour\n$20 for a cosmo at 5:30 pm?"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbE5qTEV3EAE",
            "text": "Specialty drinks on point 👌 Get the burger 🍔 !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3blplMW5RRRAB",
            "text": "Nice place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieC02Q1BBEAE",
            "text": "Good vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieUtQY0NnEAE",
            "text": "Great spot to stop for some delicious cocktails! The chocolate torte with creme fraiche and orange spice zest was good too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2QzeFhREAE",
            "text": "My to go bar in East Harlem. Great drink and awesome service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybnZ6NG1RRRAB",
            "text": "Oyster platter and a seasonal cocktail makes the perfect summer evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeEtLWWRnEAE",
            "text": "Came on a Sunday. Not to crowded. By the looks of it, only one bartender and one chef, but we were attentively served. Drinks are fun, if pricy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmFiMFFREAE",
            "text": "What an experience! Delicious cocktails, great service... I'll be back very soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOG9pUVFnEAE",
            "text": "Amazing staff and cocktails. We tried a ton of drinks as well as food. It’s great for sharing a variety of dishes. The space is nice and cozy and the atmosphere is warm and inviting. Thank you, Jackson and Wren for a wonderful evening. Definitely a new favorite spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqa0pIVzNBRRAB",
            "text": "Decent drinks, non-menu drinks were alittle pricy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNFBiUDdnRRAB",
            "text": "Perch is a cocktail bar that I've had on my list to visit for a while and I'm so glad I finally got the opportunity to try it. Coming in the bar is fairly small. There's only bar seating available so not the best place to bring a group. I came with my partner on a random weekday night around 7pm and there were only two seats left so def plan accordingly. Perch does not take reservations so visiting during off hours will give you the best opportunity to find a seat :)\n\nMy partner and I ended up ordering the Mambo Siciliano and the Luna de Miel cocktails, respectively. Both were delicious but if I had to choose a favorite it would be the Luna de Miel. It was smooth, not too sweet, and well balanced. For food we ended up ordering the longaniza croquettes, smashed fingerling potatoes, and the lamb meatballs. All 10/10 with a slight edge to the croquettes for my fave. We also ordered the NY strip which was flavorful and tender but ended up coming out a lot more rare than what we asked for.\n\nAll in all a really strong cocktail bar choice that I can't wait to add more into my rotation!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNDd2Uk5REAE",
            "text": "Downtown prices in uptown.\n\nVibes are good but space is very narrow, you’ll always be in someone’s way.\n\nDrinks are decent."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMk9pXzV3RRAB",
            "text": "Nice ambiance and unique drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaFBmeHBBRRAB",
            "text": "Cute spot with interesting cocktails. Nice vibe, friendly staff. Wish they had more variety of drinks sans bourbon/mezcal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcy1yOXh3RRAB",
            "text": "Excellent cocktails! Jessica was personable and knowledgeable. Made me feel right at home and was happy to talk about the cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbk55ZWV3EAE",
            "text": "Went here yesterday with some friends for holiday drinks. I love the chill pub atmosphere. Will definitely come back to try their food too :D"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxME1lWS13RRAB",
            "text": "Simple long bar. Great bartender. Loved the IPA"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMzdLM0ZREAE",
            "text": "Food is great, cocktails even greater. I especially love the farm to bar specials"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsLTY2Qi1nRRAB",
            "text": "Great drink menu, wonderful atmosphere, very friendly and inviting staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa0p2X2R3EAE",
            "text": "Wow. It’s a little gem of place.  My husband I shared 1/2 doz oyster, cheese plate, ceviche, scallops and finished with flourless chocolate dessert.  Everything was so delicious and beautifully presented. Service was excellent and fabulous atmosphere. We will definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbjVuZUd3EAE",
            "text": "Steph is an excellent mixologist. Great cocktails and fun conversation. Truly takes enjoys his craft. My wife and I really enjoyed Perch and look forward to coming back to this \"hidden gem\"."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMmJyRGF3EAE",
            "text": "The service is always welcoming and friendly. The food never fails. The burger especially. It hits the spot every time. Bread and dip it a great starter. Scallops were a first time try. Can’t wait to have again. Fresh and flavorful. The pop of the cherry tomatoes was a delicious extra touch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bWRUSUl3EAE",
            "text": "This place is a hidden gem! Delicious and unique cocktails, excellent scallops (not pictured because we scarffed them down so fast), and exceptional risotto. The ambiance is lovely as well,  super cozy and intimate, and the bartender/waiter Derrick was friendly, helpful, and knowledgeable. Looking forward to our next evening here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OWVhWm9RRRAB",
            "text": "Went to Perch on a Thursday night for a date with my wife and we had a great experience. It’s a cozy, 25-seat tapas bar with a great drink menu and tasty small plates to share. The place is thoughtfully designed and the atmosphere felt very upscale.\n\nWe ordered shishito peppers, croquettes, ceviche, smashed potatoes, and the scallops and everything was very unique and delicious! Our favorite was probably the croquettes as they were surprisingly tasty and packed with flavor. The ceviche was also really flavorful and a favorite. The scallops were good, albeit a bit salty and expensive (4 scallops for $23).\n\nOverall, I would definitely recommend this place and come back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhc0lYYWpRRRAB",
            "text": "A comfy oasis in East Harlem; a cute hideaway from your typical hustle and bustle of New York City; a place to call home after a long day.\n\nPerch is an up-and-coming cocktail bar with deliciously crafted mixed drinks that will soothe your soul and leave your palate refreshed.\n\nIt’s so evident the love, care, and thought that has been put into this amazing place. Come, stay awhile, and let your cares fall to the side while you *perch* yourself at the bar and experience this incredible journey.\n\nThe food is delicious, the cocktails are exquisite, the atmosphere is delightful. A perfect 10/10, 5 stars, and 2 thumbs up establishment! 💚"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMlliSnZRRRAB",
            "text": "Can lightning strike in the same place twice?\n\nIn the case of East Harlem restaurateurs Leo Lauer and Darcie Siciliano, the answer may be yes… Or at the very least, just a few steps away.\n\nThe duo, who successfully launched craft beer bar East Harlem Bottling Co. four years ago, are sending thunderclaps across El Barrio with their new team and latest concept one block down Lexington Avenue, Perch— an intimate, by-design, full-liquor cocktail bar with specialty drinks, satisfyingly-sized small plates, and an unmatched, welcoming ambiance in our ever-changing neighborhood.\n\nAs the kids say, this beautifully designed space “is a vibe”— seating 25 comfortably at its solid oak bar, classically reminiscent of old New York with its arched wooden ceilings and backlit mirrors. Illuminating swoon-worthy wallpaper filled with evergreens and mauves, the lighting sets the mood, along with the well-curated accents of industrial, earthy, and modern art deco details in just the right places. The atmosphere is upscale without being uptight, with much of the credit due to the warm and friendly team behind the bar.\n\nWith more than 120 bottles at his disposal, Brooklyn native and beverage brainchild, Rob Giles, has brought his talents to Manhattan and created a cocktail jungle where dreams are made of— there’s nothing he can’t do. Imagination meets sophistication on the craft list with shaken blends like the Nutty Belle and City Sunsets, and the rotating Farmer’s Market sparks a curiosity and desire for what he might dream up next. Inspired by the history of cocktails and determined to storytell through his drinks, Rob’s love and spirit for spirits is crystal clear— even through his take on the standard classics. The hints of lemongrass in the Moscow Mule give it a flair that is anything but basic, and Rob’s ability to weave complex, refined flavors into universal formulas that appeal to every palette makes him the ideal mixologist... and one to watch.\n\nThis delicious assortment of cocktails can only be matched by Chef Raj Abat’s diverse and delectable menu, where culinary classics are met with unexpected twists and joined by adventurous, yet brilliantly balanced plates. Chef Raj, whose resume boasts the first vegan Filipino restaurant in NYC, brings a commitment and passion for fresh ingredients that shines through his dishes. Chef’s take on the traditional Cacio e Pepe pleasantly surprises using mochi, a Japanese rice cake dough, for its pecorino-covered noodles, and the squid ink gnocco served with honey butter and country ham is unlike anything you’ve ever tasted. The oysters are fresh and well-priced, the porgy is filling, perfectly fried, and topped with a flavorful sauce where chimichurri meets salsa verde. My personal favorites: The hamachi crudo is the star of the seafood show— a beautifully plated fusion of ceviche and sunomono flavors complete with added greens, as well as the short rib, served with fresh bread, marmalade, and marrow. It’s bone-sucking, finger-licking good, but luckily comes with a mini spoon to scoop up every last bite. Make sure to save room for dessert— the lemon curd paired with cherries and butter cookie crumbs strikes the perfect chord of sweet, sour, and salty notes.\n\nPerch is a win for East Harlem residents craving unique cocktails and eats in a beautiful place where everybody knows your name— so if it’s possible for lightning to strike twice, it certainly has."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaU5PUDR3RRAB",
            "text": "Great vibes at this small and elegant cocktail bar on Lex and 106. The cocktails were well worth the $16. The penicillin was my favorite, refreshing and not too sweet. Will be back to try the food, they're known for great eats!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhenRHUXNBRRAB",
            "text": "Just tried Perch for the first time, absolutely spectacular!!! I tried the cheese plate (phenomenal) and the lemon curd (SENSATIONAL). Everything on the menu is well thought out and perfectly balanced. Can’t commend them enough for bringing…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4al9IRER3EAE",
            "text": "I stopped here for a quick bite with a friend. It was not bad. I had potato fingerlings and a glass of prosecco.  The ambiance was alright. Not too packed, but there is not enough space, which isn't really that big of a deal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOWNYY2VREAE",
            "text": "Love love love love love this place, it’s so quiet and somewhat of a hidden gem in East Harlem. A place you walk into where you kist feel at home and the drinks are absolutely out of this world fabulous (happy hour is divine). Totally…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN3VXdTlBRRAB",
            "text": "Perch is a nice place for cocktails and small bites in East Harlem. They make really good cocktails (see picture), loved it, I also tried the shishito peppers that were pretty good. The decoration creates a cool environment and the place is…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cXMzRWlBRRAB",
            "text": "El Barrios new gem! You can’t go wrong here, from the cocktails, the food, interior design, amazing hospitality, and friendly staff - there’s attention to every details."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocC1xQThRRRAB",
            "text": "Cocktails top 👌🏽\nFood perfect 👌🏽\nVibe on point 👌🏽\n\nOverall ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOHZQYnl3RRAB",
            "text": "I recently visited Perch and was thoroughly impressed. The tapas-style plates were amazing tasting and great to share; the cocktails were made with great care and skill. The atmosphere was intimate; the place is quite small and only has bar seating. I would highly recommend this cocktail bar for anyone looking for a great evening out."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dy1tUThnRRAB",
            "text": "This place has incredible attention to detail. The cocktails and small plates alike had so many distinct and complimentary flavors going on. The atmosphere was so friendly, and the servers were so knowledgeable and kind. Prices add up pretty quick if you’re eating and drinking, but definitely worth it for the quality and experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocVBUSTJnRRAB",
            "text": "Drinks are great. Bartenders are great. Ambiance is great. In this location, it is nice to see a boujee bar like this start to pop up. It shows times are changing. That being said, the prices are extremely high for what you get. Overall I’d say this is a great Thursday night type of quick bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNWJ1YUxREAE",
            "text": "Came here for happy hours on a Friday. We only got drinks but it was great, so were the service and atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNlMWV0ahAB",
            "text": "Great spot. Went with two friends on a whim and we were lucky enough to get seats right away. Food and drinks were good. Our bartender, Melissa, was attentive and made great drinks. Don't leave without ordering the chocolate cake--pairs great with a negroni."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNzVxMVVBEAE",
            "text": "What a cool place! I loved the intimate feel of the bar, the cocktails were out of this world amazing, and the service was great. Was not able to try the food, but we will definitely be back for some small plates and more drinks!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbFp6TkVnEAE",
            "text": "The drinks here are OUTSTANDING. They measure up to any cocktail bar in the east village. The food is really good too.\n\n- Half Windsor - best version of a Mai Tai I’ve ever had\n- fair winds - outstanding\n- contadino - wow\n- nutty belle - truly outstanding tiki style cocktail\n- the final say - very very good version of the Last Word"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNjdyaEpBEAE",
            "text": "Beautiful space and setup. Definitely was very excited to try this place and when I did, I was absolutely horrified by the terrible service. I’ve been in Manhattan a while and bar is pretty bad in terms of service. Yes all the seats were taken but there was full standing room and the bartenders just ignored. Finally when I did sit down the cocktails were okay. So overall just disappointed that we waited even though the guy bartender was by far the worst I’ve seen in the city. But the lady was slightly better, cause finally we were able to get a drink. They just acted as if we were getting service for free. never going back here, unless there s a change in the staff. Tragic, cause it’s a beautiful space."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMF8zQnZnRRAB",
            "text": "Excellent little oasis, with a focused food menu. I had the NY strip steak — a good cut, cooked precisely, paired perfectly with a mild salsa roja — and a side of smashed fingerling potatoes. The salsa verde which came with the potatoes…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaUtUc0dREAE",
            "text": "Great cocktails. Their menu has lots of fun drinks and they can make all of the classics.  During the warmer months they have a farmers market cocktail that is lots of fun. Food is great too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNkpqN193RRAB",
            "text": "Fun little hole on the wall place, my wife and I popped in for a night cap which turned into more than 1. The staff was incredibly friendly and knowledgeable, and the cocktails were AMAZING! Seriously worth a look if you want a creative and delicious cocktail"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcW9Xc1RnEAE",
            "text": "Great gem in East Harlem. Amazing craft cocktails, chill ambience and very good service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbUlMQ0ZnEAE",
            "text": "Amazing location with gorgeous design featuring windows shining upon East Harlem brownstones to make you feel like you’re in the coolest parts of the city. Amazing menu, cocktails and people here. You can’t beat East Harlem ad it is up and…"
        }
    ],
    "reviews_count": 74
}