{
    "name": "Patsy's Pizzeria",
    "place_id": "ChIJvXfkSP31wokRJ1Lqb0Nk7qQ",
    "grid": "MN11",
    "address": "2287 1st Ave, New York, NY 10035, USA",
    "rating": 4.5,
    "user_ratings_total": 3528,
    "phone_number": "(212) 534-9783",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM1pGRXRXSHAyV1ZGaWMxVlFNSHB4VFdKMVdWRRAB",
            "text": "I’m highly disappointed with the service of this restaurant I loved their pizza for years I ordered on uber and they made me the wrong pie uber was no help I call this restaurant the guy on the phone “claiming he is manager “ said I can make u a pie u have to pick it up “I said it can’t be delivered he said no impossible and I said I like to speak to the manager or boss he said he is but in the same breathe said he could get in trouble for giving me a pie I said I want to speak to ur boss he telling me hold on it’s busy and has me on hold for a while I really wish I got his name he was bery rude such a shame I tell him I have a baby and I’m not able to pick it up and they can’t even have the courtesy to delivery it KNOWING THAT THEY MESSED UP MY ORIGINAL ORDER it’s such a shame I read som reviews this place had changed it’s a shame I wonder if it’s the same owner's because the man on the phone definitely was not an owner"
        },
        {
            "date": "수정일: 15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbnZmRGZBEAE",
            "text": "Best pizza in the city."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFd1JYcHZUVVIzV21Vd2J6SkxUV0ZVWm5CUGFWRRAB",
            "text": "CASH ONLY!!….its 2025 not sure if this place will survive if they don’t take both types of payments…. I heard the pizza is good, but I guess I won’t know because I don’t carry cash."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNFJYZDRTMlJsY1hkRVozVkdTbUZsUmtOcFIyYxAB",
            "text": "Best slice in nyc"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeVNsSk9iVnBxVlhwSVNXbEZTVm8wV0ZkU09XYxAB",
            "text": "old style nyc pizza also if you're a movie buff this was the goal for the main character in the last a quite place movie"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWE5GUTFORFJuY1cxbVYxRm1hRFpzUWtSNlNtYxAB",
            "text": "A total staple, classic spot - brings my hubby back to his younger years and just one of those it doesn’t change! Bring cash! You will love it - totally timeless!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVUzbFJTbEpxZVRsaWVXOTZWMUJuV25CVVRVRRAB",
            "text": "The food was absolutely delicious but please please please tell me what was in the Harlem spritz cocktail lol I was floating on air lol"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeGNVbFpMV3hEVWxGVU0zSldYM00wTkhob2FVRRAB",
            "text": "Placed an order for pick-up through GrubHub.  When the order pick-up changed from 20 minutes to 50 minutes I called to cancel. They said I needed to do it through GrubHub. GrubHub wouldn’t let me cancel as it notified me that Patsy’s already began the order.  Which I find impossible since I called Patsy’s East Harlem 1 minute after they changed the pick up.  The Patsy’s employee now changed his story  after I called him again and said that he can’t cancel without his boss’ approval and his boss won’t be back for a week or a month!   He was rude and calling me “mami” which I find offensive.  I will never ever place an order there again."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMkx2Smt3RRAB",
            "text": "They have some of the best pizza in the city"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkS00ySkVkMlYwT0c4NVZHaFFaR1ZhVG14UGNsRRAB",
            "text": "Went in and ordered two slices which was sitting in the window looking cold & old. He begin to serve and I asked could it put in oven LIKE NORMAL PIZZA SHOPS DO & Was Told “No, its still warm” I just left. Rude service & dirty atmosphere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVRVa3dXVEIxTjNvM1VFOWxaMjlaVkRWWGVWRRAB",
            "text": "If disappointment had a flavor, it would be this pizza. I don’t even know what I just ate it’s like they took the idea of pizza, ran it through a paper shredder, and served it lukewarm.\n\nI’m from Jersey, so trust me  I know good pizza. This ain’t it. This isn’t even bad pizza. This is anti-pizza. The crust tastes like wet cardboard, the sauce is thinner than a politician’s promise, and the cheese? What cheese? There’s more dairy in a black coffee.\n\nThe slice flopped like it just gave up on life halfway through the box. One bite and I genuinely felt bad for the tomato that died for this. You could feed this to pigeons and they’d unionize for better meals.\n\nPeople hyping this place up need to have their taste buds checked either that or they got a different chef from an alternate universe. “New York’s best”? Bro, I’ve had better pizza drunk at a 7-Eleven.\n\nSave your money. Save your dignity. Patsy’s might’ve been a legend once, but now it’s just a tourist trap serving nostalgia disguised as dough."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaFkwcEhaVWRLV0ZwemFGQTBlazFmY2t4SGMyYxAB",
            "text": "Get their Cheese pizza to go… you will thank me later.\nBest in NYC. 👍❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMVlrbEVPVkpCZDFKcGJEaHlRMHBoTURob1oxRRAB",
            "text": "Loved patsy pizza I recommend it 😋"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUFdreHNlVGgxZFVKRFVFWkxMVkJTYTBkdlIwRRAB",
            "text": "On a rain soaked Sat in Harlem tried this iconic pizza place very disappointed it missed the mark big time back in day sure it was better it hit us like bomb sorry it tasted good but my system and wifes were effective in bad way too bad had high expectations for price failed big time...i want refund...i know that's not happening from looks of place it's changed hands for sure old blue eyes would not be pleased."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRFVtbzNVMTl2UkZWTFpXeDJXR1E0ZDJad00yYxAB",
            "text": "Pizza is fire but the one a hole has the worst attitude but it’s so fire people have been putting up with it their entire life lol"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scGMyVTFXRTlOTUUxV1JuUXpXako0VVhScVJuYxAB",
            "text": "FOOD WAS BURNT  OMG NEVER AGAIN"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWmRXOUpObWN0TXpodGVsOVJha1F6VG1odVlXYxAB",
            "text": "Legendary, unique thin crust pizza."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUk5rVkNVSFZZTTFobU9VTkpUemxzTmpOck9XYxAB",
            "text": "It the best .\nBut you have to be considerate of the workers and there moods as they work in that hot 🔥 place for hours .\nJust be kind when ordering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYWVFaHdYMHRqTTJVM05YTXlWa3RETm5CNVZHYxAB",
            "text": "Amazing! I love this place, the pizza is super fresh and delicious, I’ve been coming here for a long time and the employees are super friendly. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRU5EZGFaaTFVV2poTll6VTVaMWhQYTBkWGRrRRAB",
            "text": "Don't recommend this establishment, pizza 🍕 is terrible, customer service is not the best, you don't feel welcomed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVIzcEJXVXBEVEU1M2EyMTZVbEJYUm1kalEyYxAB",
            "text": "Pizza hot and ready when you walk in"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saVZHSkVVWGxQUlZoYVgwMW5aek5GYzNkTVUzYxAB",
            "text": "I am John The Bartender at Down the Hatch in New Orleans. Met a gentleman from Manhattan. Said you have the best pizza in NYC. 118th and 1st Avenue. Posting from New Orleans. Please write me a review back. Small world. 🌎 Well he's wrong. 2287 1st Ave, New York, NY 10035…"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUWVIZ3hkVzFGVTJWYU9HUkRUSEpUYUROQ2NtYxAB",
            "text": "Patsy’s Pizzeria, una experiencia muy agradable en East Harlem. Segun las reseñas, es un icono en la ciudad con historia que data de 1933. Es una combinación de la pizza italiana que tomó su propio carácter de New York. Su horno de carbón, le da un toque de sabor único y su masa es delgada y crujiente.  La pizza tiene un tamaño ideal para compartir entre 2 personas.\n\nPedí una pizza margarita con prosciutto: tomates frescos, mozzarella derretida, albahaca y ese prosciutto salado que le da un toque perfecto. Estaba deliciosa, con sabores simples pero intensos. Para acompañar, una cerveza Blue Moon fría, que combinó genial con la pizza.\nEl lugar tiene un ambiente antiguo y acogedor, con meseros amables que te hacen sentir en casa. Si quieres pizza de verdad con historia, Patsy’s es el sitio.\nDato: solo efectivo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabVRtNXJSV2N5YjFZelowMHpkRmRvTjNKZmRrRRAB",
            "text": "I’ve had this place bookmarked for ages, so I stopped in after a 35 min commute to see it. I was recommended the Pink Pig, but they gave me the Patsy’s namesake on accident (would recommend - really enjoyed!). I then tried the Pink Pig since I was curious about the Vodka sauce, and it is a tiny layer that you can’t taste with the pepp (you can decide how pink it is to you from the photos). If you’re dining solo and can’t afford two pies as a single woman in NY, I’d recommend clarifying questions when you first order to be sure you know what you’re getting… otherwise, you could be down $60-$85 for not knowing how to communicate better. I tried when the joint was empty, but my English is a WIP, and the Latinos here speak a mix of English and Spanish while they’re working. I grew up with Mexican Spanish, but I’m not sure that’s what kind of culture is here, because facial expressions are so different from the ones where I’m from. It’s New York, and this isn’t an Italian joint I think - at least the hospitality isn’t (no judgment, just my observation from my first time sitting down here). I’m thinking Italian hospitality is a lost art of sorts - where has the time gone with the language and care of the Med? Probably somewhere fun 😅 No shade to the staff here though - there aren’t that many!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd09USmZXalJtZFhZeVkzTXlTVkY1V2t3NFpHYxAB",
            "text": "A great New York slice. It has a little flop to it but I’m not mad about it. The dough melts in your mouth if you get a fresh pie! Sometimes it can be chewy if it’s not fresh but it’s still so yummy. Make sure to ask for a fresh pie! This location is historic and the staff are passionate which makes the pizza that much better 🥰🤌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbWQyUnpTR1JxWTNkc2JYQlJjMjVDU0ZoTVYwRRAB",
            "text": "I've been eating at Patsy's since 1998 and it the iconic pizza, NYC is famous for. It's been around since the 1920's for a reason."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMVFWRlpiMkYyV25OcE5GQnFiV0pDZWs5R05XYxAB",
            "text": "Awesome pizza served in a place with some very cool history.  And you got check out the pizza oven."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1JsbFpSRXRKZDNKT1JsOVJSRGxGV1ZocVNYYxAB",
            "text": "Great place to relax and enjoy a good meal. Can’t wait to come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeE9WbGpVR2h5WTNoUGVIaDVOUzF3YkdkMWFGRRAB",
            "text": "Historical pizzeria from the 30’s. I liked the New York pizza here that is cooked in coal oven and the dough was well cooked and tasty. Pizzas are huge but let you eat them, not heavy at all. Suggested if you want to have dinner in a historical place full of photo from the past. Host is very nice. Bring cash since this is a cash only place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNGNVdDJTMlJXVDIwMmREbDZMWEEyYm5WUE0xRRAB",
            "text": "Pozza was great. Salad with Chicken was delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdFZYazRTRU5aWTFsT2NqRXdOMlJFUTE5cGQyYxAB",
            "text": "I'm very impressed by the flavor. And for $2.50 for a slice, this is an amazing deal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTFh6TmpORzU2U2xwemFETklhR2xLVFVvNVIyYxAB",
            "text": "Pizza is burnt mostly everywhere. The service was great, I didn't know it was cash only but the waiter trusted me and let me get my cash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMU0yTm1la0UzTUVST1draFdSWFZpVEhSeFdWRRAB",
            "text": "Love this pizza !! The closest pizza taste to the real pizza they make in Italy 😋 definitely recommend getting more than one pie ..pizza is very thin and delicious!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVJEaHhSRWM1TVhnMlduZHNibmxmVkd3NUxXYxAB",
            "text": "My husband and I had an original pie and Cesar salad and it was absolutely delicious. The service is impeccable. It's no wonder this place has been around so long!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV09HeGZRVlJXTURScE0zSjJWVW90Tlc4NExVRRAB",
            "text": "A simple NY slice but arguably one of the best in NYC. Both cheese and pepperoni are excellent. There is a restaurant connected as well, but we have been picking up for 10 years and it never gets old. Highly recommend"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd29fcEV3EAE",
            "text": "Pastys pizza 🍕 nothing has changed same great taste"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSVZUSnNUR2RXYTBjM0xXbGFjakJHU2swelUxRRAB",
            "text": "Thank you Jason for a great experience! And Fred…very memorable and the pizza was absolutely perfect."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeWNtMVFXbTFKT1hSQ2IxSTFRalY2V25kUlJGRRAB",
            "text": "This is one of the best Pizza’s I ever had. It’s very light so when you’re done eating you don’t feel that weight. The flavor was absolutely amazing, my go2 place when I’m in the area. Pic and disc included"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNE4wNHdSbkpvWjFCWVpESlJkMVpTWlhoaVVIYxAB",
            "text": "Absolutely horrible. Ordered from Uber eats and they gave me a pepperoni slice, which was not what I ordered. Also, the pizza itself was completely damaged. This doesn’t have anything to do with the restaurant however, when I tried the pizza, it was absolutely horrible. Just taste like garlicand butter without any flavor. This is absolutely by far hands-down the worst slice of New York pizza I’ve ever had they should be ashamed of themselves and the fact that they allow this to be delivered is unconscionable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT09XOW5TRkIwTmxSVUxUVnhWV3R5ZUV3NGNsRRAB",
            "text": "Best pizza - hands down"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NFdrczJWVGxDUkZGWmVGb3Raamx1WDFaSFduYxAB",
            "text": "I was to I could add any topping to my slice, only on pies.. someone make that make sense.. $2.50 for the smallest slice in NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNGRXbHVTM1Z6Vm5SblFYVlhWblZyWDJ4S2IzYxAB",
            "text": "If you like NY style pizza.....this is the place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRlFuaHVVbEJGV1cxalFtbHJWazg1YmxKclRsRRAB",
            "text": "Old school Italian place that offers way more than just pizza.  We celebrated my birthday with to-die-for lasagna with extra sausage added."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmF6aDVaRVZRZEdOTGNXNU1MVkZUYUVGMWJGRRAB",
            "text": "Great pizza just walked in and the pizza was ready"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1RrcG1jamRxTTJKdGQwcEpORWhOVldSTU1YYxAB",
            "text": "Without question the best pizza I’ve ever had. Recommended by friends, it was an awesome find. The staff are super friendly, and the atmosphere has kept the old school restaurant vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNk4wNUVVVUl6UmtGRmEybDBibXBxY0daRFdHYxAB",
            "text": "IF you Know You Know!!\nHands Down...\nNY NY you Must Stop And Enjoy..\nThis Is A SPot that makes You feel like your a New yoRker...\nEven if your really not....\n🍕🍋🍽\nGood window service\nAnd Amazing Service @ the Tables...\nHome Sweet Home"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWFVFTkhaMHB0TldKdUxXcFdXWFZWYzNaaE9HYxAB",
            "text": "Best thin crust brick oven Pizza in NYC. Hands DOWN!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RlJTMTBWREpRUVhOR0xXMUNjVGx3WlRSUWVHYxAB",
            "text": "Classic coal-oven pizza with a crisp, smoky crust."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNFRYbEJiRmhTVERGUFZIcFhXbTVCWWtkb09IYxAB",
            "text": "Great chew and sauce albeit some flop. I’m getting a whole pie for myself next time. Can’t believe I slept on patsys for so long!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFd1kxOVpSMlJhVEY4NWExWnFkMmxhY0ZGYWVWRRAB",
            "text": "Nyc best pizza 🍕 🤪🤪🤪"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaDluZVJnEAE",
            "text": "Wow pizza! If I were in Manhattan, I would keep going there until I got tired of their pizza's. I regret I only found this place during the last few months of my NY stay! 최저가의 조각피자를 지나가다 우연히 먹고 첫맛에 반해버림. 그런데 그리말디스피자와 비슷한데 조사해보니 뿌리가 같은듯~"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abGNEUnpOelpQVVdkWGFIaE5SRFJCVUhWSE5WRRAB",
            "text": "Patsy’s really is New York’s best pizza, dough to cheese to sauce ratio is perfect. The crust doesn’t flop. We have never been the only customers there! This is the walk in pizza shop next to the restaurant. This place gets so much foot traffic your pizza will definitely be fresh to order( has been every time; we go at least 1 a month)! Everyone seems happy here, the employees and the customers !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSGQzVmhaWGRrTWtkaFNrNTJORkJTYkZGRVoyYxAB",
            "text": "Saturday for lunch. Transported to the 60s. Two bottles of ice cold Blue Moon, check!  Appetizers: Muscles and stuff class, triple check!  Bread for dipping the soupy garlic-e sauces from the apps, nice check! Then the gem of lunch: 16 pie, cheese with pepperoni,  sausage, fresh garlic, topped with arugula! Heaven! Our server: Jason. Spoke of history of Patsy, nostalgia,  movies and life in general living in Manhattan! If you come across him, say \"hi\". A warm fellow and down to earth!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVlJUWmhUM0l3VmxKNFNuVjBkV1oxYzFweldrRRAB",
            "text": "The OG location of Patsy's still cash only, with a slice shop counter nrxt door serving those on the go. A old school dining room adorned with pictures of celebrities and local community. The service can be a bit slow at times as the slice shop is generally more busy during the day. The portions are generous, price very reasonable, athough recently has gone up a but along with a redution in menu item. I would take here over the midtown spots with different owners anyday."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeUM0UGFRMDh6TDN3RRAB",
            "text": "Pie at the takeout place, and I'm not sure which restaurant this is reviewing, the pizza joint or the sit-down Italian next door also called Patsy's. Pie was great, but I wanted to try a meatball but he would only sell me a whole meatball pie even as I was his last order of the night. So I got meatball pizza instead of pepperoni which is what I really wanted.\n\nMeatballs not worth a detour but the pizza is."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdGM2dnR3RRAB",
            "text": "A Slice of New York History with Every Bite\n\nWalking into Patsy’s Pizzeria feels like stepping into a time capsule of classic New York charm. With its vintage black-and-white photos lining the walls and the scent of coal-fired pizza wafting through the air, Patsy’s isn’t just a pizzeria—it’s an experience.\n\nThe pizza? Pure perfection. The crust strikes that elusive balance between crispy and chewy, with just the right char from the coal oven. Each bite carries a whisper of smokiness that only a true New York institution could deliver. The Margherita is a must-try—fresh mozzarella, vibrant tomato sauce, and fragrant basil laid atop a crust that could make you weep with joy. Simplicity done flawlessly.\n\nBut it’s not just the pizza. The atmosphere hums with a casual, welcoming energy, whether you’re a local grabbing a quick slice or a tourist on a pizza pilgrimage. The staff is friendly, efficient, and passionate about the pies they serve. There’s something magical about the way Patsy’s bridges generations—older patrons reminiscing about decades past, and younger ones creating their own memories.\n\nIf you’re a fan of pizza (and let’s be honest, who isn’t?), skipping Patsy’s would be like skipping the Statue of Liberty. It’s not just about the food—it’s about history, culture, and a love letter to the art of pizza-making. Patsy’s Pizzeria isn’t just a meal—it’s a slice of New York itself.\n\nFive stars. No question."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psck1FVlJaRFl5TjI5VlJuSlhTMFJ5VldaaU4wRRAB",
            "text": "Solid slice, cash only for $2.50 and quite fresh - vintage NYC thin crust style, but didn’t blow me away. Have to come back and try the sit down area / get a pie"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneHFxMUx3EAE",
            "text": "We really enjoyed our meal at Patsy’s. The pizza was unique and very good. Love the thin crust. Also got ravioli with vodka sauce and it was delicious! I love the sauce!! Also thought the prices were very reasonable, the service was good, food came very quickly, and we were not rushed at all."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaHJ6ZE9REAE",
            "text": "Heard about and finally had the chance to try Patsys and Without a doubt the single BEST ITALIAN FOOD and PIZZA I’ve ever had. Cute, cozy, and everything made to perfection 🤌🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdE9ydG1RRRAB",
            "text": "Great pizza and entrees since 1933.  I have been coming to this neighborhood restaurant for many years and have never been disappointed.  My favorite Italian restaurant in the NYC area.\n\nPrices are very reasonable.  They also have a good wine list and deserts are excellent.\n\nThe list of celebrities that have dined here is extensive and there are celebrity photographs on the walls.  They include Frank Sinatra, Dean Martin, Al Pacino, Robert De Niro, and many others.\n\nHighly recommended."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcHRIUzhBRRAB",
            "text": "We had a very tasty and fresh Marguerite Pizza.  Each slice we tasted a whole basil with fresh mozzarella cheese.  Though we really wanted pasta dishes, we didn’t have enough cash to order them.  We did finished our meal with very yummy tiramisu dessert. We will definitely come back with cash next time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURma3RpbzBRRRAB",
            "text": "Tonight, Saturday January 4th 2025 We ate at the original Patsy in Harlem. The Pizza is always phenomenal. Thin crust, excellent flavor and no flop. We sat at table 22 and our waiter was so friendly and has been there for over 20 years! We even bought a t shirt to represent the perfection of the pizza. We ordered a regular pie and a sausage pie. Our 92 year old aunt loved it!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHY2eHVRRRAB",
            "text": "A legend in Harlem, but to be honest I am not a big fan of wood fired pizza.  This pizza was pretty good and they used excellent ingredients.  It was still a bit crispy on the crust and nobody still could eat the crust.  While eating we were confronted by someone begging for money, which seems to be supported by their cash only business model.  They really need to do a better job of controlling the flow of patrons.  We also had trouble adding to our order and finally paying.  The meal took about 45 min longer than it needed to, and they would do well to turn the tables over faster anyway."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzb2VETkJBEAE",
            "text": "My mother introduced this place to me because she grew up down the block. And they are still remarkable! The food was amazing and the portions very large. The service was very classy! Will definitely be returning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOU9yYmpRRRAB",
            "text": "We grabbed a takeout pie from Patsy’s, and it did not disappoint! There’s a convenient outpost right next to the restaurant, making pickup a breeze. At just $16 for a whole plain pie (you can add toppings for extra $), it’s an incredible deal for such high quality pizza. We always start with a plain pie when trying a new spot, and this one was perfection—crispy, flavorful, and so good that we polished off the entire thing, crust and all. There’s a small station where you can add classic fixings like garlic, oregano, and more to customize your slice just the way you like it. Heads up: there’s no seating on the takeout side, so it’s best for grabbing and going. We’ll definitely be back to dine in and try the full menu!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM0pMU1dREAE",
            "text": "Fuimos por la película de \"Un lugar tranquilo\". Teníamos muchísimas ganas de visitar la pizzeria.\nEl local es acogedor, correcto, disponen de tronas para niños.\nEl precio está bien, en relación calidad precio.\nLas pizzas son enormes, con una, comen hasta tres personas.\nPedimos un entrante, queso rebozado. Era una cantidad más que suficiente para tres personas y un niño pequeño.\nLas camareras muy amables y atentas."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMelRzNWFHX05IdG93RRAB",
            "text": "Purchased a pie with the promotion of a free drink on the side. This is how it arrived 😭 No drink or utensils included and I asked for red pepper flakes and Parmesan to be put on the side. Don't order from here unless you can go in person because they do not care about their delivery customers"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCck0yVkhSRlF6TWsxV2QxOXhNbEZGYldaTmJrRRAB",
            "text": "Pizza has always been amazing. If you want the take out, you gotta bring cash. It’s cash only, but it’s fast and fresh. The crust is great and the sauce is sweet — no acidity. My favorite pizza in the city without competition."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMlIycHlNa1ZKTUdsNlgwcENVa1o2Y1VWR1JrRRAB",
            "text": "Patsy’s Pizzeria in Harlem is Overhyped and Overpriced!\n\nI’ve been to many places that have mastered the art of a basic cheese pizza, but here… I was highly disappointed. I had high expectations for Patsy’s, especially given all the hype from news outlets, magazines, and even movies.\n\nUnfortunately, the pizza was bland, and the customer service left much to be desired. Our waiter seemed rushed, didn’t offer much help when we asked about the pizzas, and didn’t explain why the place is so popular.\n\nTo make matters worse, they only accept cash—but don’t even have an ATM on-site. The pizza pie cost $25, which felt outrageous for something so flavorless. The only redeeming quality was the thin crust, which at least didn’t leave me feeling bloated.\n\nNow, let’s talk about the garlic bread—an absolute crime. I was very dissatisfied overall. On a positive note, their bathroom was impressively clean.\n\nFor that alone, Patsy’s gets 2 stars from me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXZlVVBREAE",
            "text": "Food: coal oven pizza was thin and light weight. Ingredients good and perfect blend!\nIt's not my favorite style pizza but it's still very good!\nWaiter explained that pizza is their specialty from coal oven so no calzones and typical pizza menu available. They do serve dishes.\nLocation and parking can be hard at times. Off street parking is limited and can be frustrating to find if you are dining in.\nRestaurant is CASH ONLY!\nTwo doors to restaurant! One for dine in only which is menu items and whole pies. Other door is at counter and no seating available!\nAtmosphere is old school pizza feel. Pics line walls of different guests who have visited."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoamFiNi1BRRAB",
            "text": "Found this place through Dave’a Pizza Reviews and decided to give it a try.\n\nThis was one of the best pizzas I’ve ever had, ties for first place for me! It was the perfect ratio of crust, cheese, and sauce. The pepperonis were crispy and crunchy without being dry. They also had a slight kick to them but that’s what made them so good. If the pepperonis don’t curl like this I don’t want them 🤷🏻‍♀️\n\nKeep in mind they are a cash only restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsaHBfQjFnRRAB",
            "text": "Absolutely delicious, classic New York style pizza. Perhaps the most representative example I’ve had, almost the archetype of New York style. Why not five stars? Only because if this is the bedrock, there are just so many more exciting and unique takes throughout Manhattan and Brooklyn. It’s hard to say this is the best, but it’s absolutely comfort food and fantastic specimen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua2JMSFFREAE",
            "text": "Wow. It's the most barebones, quintessential New York slice, yet it's so delicious. The sauce is out of this world, fresh but with a savory bias. I'm not sure if there's a bit more salt than most fresh tomato sauces have, or if it's some other combination of spices, but it works harmoniously with the cheese. Again, super basic, but this place is a treasure.\n\nThere's a sit-down restaurant, and a place with slices next door.\n\nDid I mention it's cheap? It was $2.50 for a cheese slice, so inexpensive it almost felt like I was being paid."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOekl3cUtya2JTY1ZBEAE",
            "text": "Tremendously good pizza. Well priced cool spot. Top 5 pizzas in my opinion anywhere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Mk5hYzNBRRAB",
            "text": "What a charming place! Obviously this is the original Patsy's circa 1933, a short walk from the 6 train. We visited on a cold, quiet Saturday afternoon, and were greeted by a friendly server doing everything that day except make pies. It's an easy menu if you're getting pizza, but there are plenty of other Italian entrees, salads, appetizers, all made fresh.\n\nWe settled on an Original thin-crust pizza with onions ($22.50, no green peppers here, somehow), a side of spinach, and a bottle of the Montepulciano ($30). That arrived within a couple of minutes, naturally. There were several tables ordering in front of us, but the pizza (and spinach) came out rather quickly, hot but ready to eat. Such a thin, thin crust with lots of bubbles, lovely undercarriage, and the sauce, so good! The mozzarella had a bit of saltiness to it as well. This is easily one of the best in the city, as virtually everyone reviewing Patsy's has attested.\n\nI was a little disappointed that the long bar area is not generally in use, as it's a striking second room, but hopefully it regularly opens on busier days.\n\nCash-only, as ever, with ATMs all around the neighborhood if you forget. But a lunch for two with wine and tip for 80 dollars at an iconic pizzeria? We're going to make the trip regularly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX3BLWU93EAE",
            "text": "The original Patsy’s since 1933.  The restaurant shows it’s age.  It was relatively full but we were able to get a table quickly.  There are pictures of the many celebrities that have frequented there on the wall.  The staff was friendly.  Overall the food was good.  Out of the dishes we ordered the Coal Oven Pizza and the Eggplant Rollatini stood out.  However it did take some time to get the pizza.  It’s also cash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMX1ltejNnRRAB",
            "text": "I had the special one and it was delicious. The staff were all nice and I liked the atmosphere too! I’m glad we made it here before the aliens attack (or before it gets more popular due to the movie) 😮‍💨😌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ek9YWkdWbGc0ZURVM2N6QnNZMWRSY1dsNlgyYxAB",
            "text": "The pizza is very good here! It’s an institution! The pies aren’t small but they are airy and crisp. Half a pie is the weight of 2 regular slices… then you go ahead and knock down the rest of the pie… but it’s so good you grab one to go lol. Definitely stop in here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa01EZElVRVp0YzBGSFJUVkdka2hsV2xKV2FGRRAB",
            "text": "Amazing place to eat. Pizza is consistently great! The arugula salad was delicious. The atmosphere is friendly. I have been satisfied every time I have had dinner at this particular Patsy's!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncnV6SWpnRRAB",
            "text": "Amazing pizza, great atmosphere, the service wasn't the best ever, but not deserving of anything less than five stars,\nSalad was also good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRmVUZHNjRzgxUWtSME4ySnFRV2h3YWpOYWRXYxAB",
            "text": "Pizza at Patsy's is hands down the best NY style pizza you will ever find! From the crust, to the sauce, to the way is folds perfectly in your mouth! Run, don't walk and get yourself a slice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNlphX3VRRRAB",
            "text": "First time on the East Coast and our friend took us to New York for some authentic NY pizza. The parlor looks deceptively small but there is a whole bar area and extra seating if you go towards the restrooms. Ok so let's get to the meat and cheese of the review, super thin crust cooked in a brick oven, cooked well but not burnt! Delicious sauce base lightly topped, we had four guys there and we just about killed 4 whole pizzas! We tried a classic cheese pizza, Patsy's special, and the Siccila or something like that lol. I run a pizza parlor in California and this pizza was so different than what we do but I loved it!\nIf you are in Jersey, New York, or any of the surrounding areas do yourself a favor and make the drive over for some amazing pies!"
        }
    ],
    "reviews_count": 82
}