{
    "name": "Santiago’s Beer Garden",
    "place_id": "ChIJew0GrQX1wokR4ChwOTIWBrI",
    "grid": "MN11",
    "address": "2337 1st Ave, New York, NY 10035, USA",
    "rating": 4.4,
    "user_ratings_total": 1413,
    "phone_number": "(833) 367-4547",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeVdWWnlRVTFFVlhGV1h5MDJVRVZNZFZsaVZVRRAB",
            "text": "The food was absolutely delicious and the staff were beyond pleasant. The atmosphere was perfect. Nobody was acting crazy and loud. Everyone seemed to be enjoying themselves."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWE5XUjBiRXgyWjJONlV6ZHpkWGhpUlhBM1NVRRAB",
            "text": "Nice chill vibe. Great place to just relax."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M2FuRXRSVU41WDJ0NWFVaFdhVzVDUTNjdE5WRRAB",
            "text": "I’ve been coming here for a year and the food remained consistently delicious. Genesis and winner are amazing waiters as well. I do plan to return!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTFZscFBTRUptV2poM1dHRm9iVVZSWkZSUU5HYxAB",
            "text": "This is one of my favorite places for Dominican food. The food is always hot and fresh, and absolutely delicious. Tonight I ordered for delivery, and they'd forgotten one part of my order (which can happen when places get busy). I gave them a call, and the young lady who answered, Annie, was so kind and helpful, and brought me the missing part of my order herself. I really appreciated her kindness and willingness to immediately resolve the issue, and this is why I will stay a loyal customer!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndFYwd3lZVVZUTTJ4TE1XUkxORkpXTWxsYU9WRRAB",
            "text": "Fiesta time here and we had a time !\nGénesis was so nice everything she recomened was amazing !\nRabo moro was so so good !\nWe asked to bring oye the chef to give him a kiss BC man is was amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcFRuTmlWa2hNYUhGd05qTm5ZVlI2T1dWalduYxAB",
            "text": "Paola is the best. She was fast and very accommodating."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTkxYbExVV3d0YWxCbFRtSlhTVUZEZFUxMVQxRRAB",
            "text": "I love this place."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeldYQmFiRU5tYTB0VmFHTldOMlJPTjBoeFNXYxAB",
            "text": "Santiago Beer Garden\nI visited this place because of all the hype on social media and figured, why not try it out? That’s what we do in NYC, right? Well… my expectations were definitely not met.\n\nFirst, the entrance to the sit-down area was confusing and honestly kind of off-putting. I’m not sure what’s going on there, but it didn’t leave a good first impression. Once we were seated, we waited around five minutes for a server before having to ask for one.\n\nThe QR code menu was barely visible—so faded we had to scan a third sticker just to finally see the menu. We ordered a passion fruit mojito and a red sangria… big mistake. The mojito was awful—no sign of passion fruit at all, and the mint had a weird smell. As for the sangria… let’s not even go there.\n\nTo top it off, even though we made it clear we weren’t ordering food, we were asked four times within seven minutes if we were ready to order something to eat. It felt super pushy, like they were forcing us to get food.\n\nIn short: the service was poor, the drinks were bad, and we ended up paying $40 for two drinks we didn’t even touch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVdHRnpSM0pTVTJ0VGVETnpRMHB3UlRoa1YzYxAB",
            "text": "Excelente gracias por todo.\n\nThis is the best place in NYC\n\nAlways good people, great food, good drinks. Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOU1JUYzBUVlJQV2xOVFJFNU5TbXd3T1hOU1drRRAB",
            "text": "Bottomless brunch! Food was solid but expensive for how simple most of the menu items are. Churrasco and mofonguitos were good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNFZIbExObGQ0WmtsRE1HVkhiMjlTWTNGMWFuYxAB",
            "text": "Safety warning !Today my relative ordered from you guys upon taking items out bag we found a piece of someones nail on the container with sazon on it and the person who didn't see it and took a bite of chicken started having pains in the upper left abdominal this is a health hazard all our friends family friends & everyone we know all agree never again please do not order food from here because there may be a nail with sazon in addition it's insane how many places in the community can't be supported due to unsanitary & lack of freshness whole order disposed reported this matter on app we all finalized never again Santiago's this includes all family & friends never to return or order ."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR2NuTjNOamxQYTBRdFlXdGhMVkpFZVV4WFJYYxAB",
            "text": "Excelente lugar muy acogedor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWWNGaENjVVphUmpaNVVscFZTVXhTWVhwd05uYxAB",
            "text": "The food, service, and atmosphere all exceeded my expectations!!\nThis will definitely become a solid to go spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdVpWQXhMV3RoU0ZCTUxWbHNNRTl5TTNsWmFsRRAB",
            "text": "Came August 8th with a friend, and the food was amazing, baby! I love oxtails. My friend and I both did Mathew’s way with coconut rice and a side of sweet plantains to die for. I added the three-cheese baked macaroni and cheese. The food tasted even better after the second day warmed up in the microwave, which says a lot. Will definitely be back. 🤍 Also the ambience is a vibe next time I’ll get pictures ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMVEwUnJPWEZtT1cwMldsVlhZVFpLVFhBdGJIYxAB",
            "text": "My friend and I came here for lunch on a Friday. When we spoke to the host (a Spanish lady), she told us there would be a 45-minute wait, even though there were 3 EMPTY TABLES and no one else waiting to be seated. We decided to leave, but later returned to try making a reservation.\n\nTo our surprise, they claimed you CANNOT make a reservation in person—it must be done online only. Honestly, that’s a very inconvenient and unnecessary rule.\n\n⚠️ Just a heads-up: they DO NOT ACCEPT WALK-INS. You will ONLY be seated if you’ve completed an online reservation. So, DON'T WASTE YOUR TIME stopping by in person hoping to get a table."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZlNVOUxRMmxNTlRGT2Fua3RSVmszUlROdE0wRRAB",
            "text": "great staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcmVsSnViV1p5TFV0WWRGUnZXSFZDTm0xWVRGRRAB",
            "text": "Winner is an incredible server. The food was on point coming from a Dominican. Savory and like grandma going ham in the kitchen. Service was also good timing and with great recommendations by WINNER"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUWQyMXdNMVZJU0ZCaWFsTm1XV0pQY2xVMlNtYxAB",
            "text": "Great food. The mojito was yummy and the space was cool. It was a nice oasis from the hot weather."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFIyeFNabUpWU0dkNVoyTjBjVEZ4YWpFeU4wRRAB",
            "text": "Great time. Food was so good."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeWJIaHllR3hKV1dvNVEzTTNPVkptT1hoeGJrRRAB",
            "text": "Excelente lugar ,y el personal super nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscU5rZHJORTB6TmxCNE5tMXRkVWRIY0ZSTWRYYxAB",
            "text": "Great food, not so good service. One of my friends ordered a Shirley temple and they literally mixed the grenadine and the sprite, who does that? Also I ordered club soda and that came out of a soda gun a but they charged me twice because apparently they didn't do free refills. For a place that wasn't that crowded and barely had enough floor staff, they surely were not generous to their customers. Also I found hair on my food but decided not to be a Karen about it. A little generosity would do this place a world of good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVmREQldOMDlWYWxkdmFuTndhbWd0YkV4RlltYxAB",
            "text": "The outdoor seating is colorful and lively, with string lights that give it a festive feel once the sun sets. I tried their tacos with a cold draft beer, and the combo was spot-on — fresh, flavorful, and satisfying. The music adds to the atmosphere without being too loud, and the staff were quick and friendly, always checking if we needed anything."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTmRVeGZabWxOVjNOVU5VMTZNbTU0VUVwT1RFRRAB",
            "text": "Quality spot. Best pernil I had in NYC 🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSU5WWnpRVTB3UW5BemMyVlNOSFJFWW1sTldXYxAB",
            "text": "Santiago’s food was very good, but the drinks were just okay. There’s a “sangrita” on the menu that I definitely wouldn’t recommend—it tasted more like a mix of random liquors than an actual sangria. The overall vibe of the place is nice,…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblRsQXhXV1JDTFRFMU0ySnBWRXR4V2xwcFgwRRAB",
            "text": "What a fantastic discovery! After having drinks nearby, we decided to stop by Santiago Beer Garden for one final nightcap and we're so glad we did. We ordered a caipirinha and mojito - both were absolutely delicious and expertly crafted. The staff was incredibly friendly and welcoming, which made the experience even better.\n\nThe atmosphere is amazing too - I was blown away by the beautiful mural and artwork throughout the space. It really adds such a vibrant, artistic touch to the place. This is definitely going to be our new go-to spot, and I can't wait to bring friends here. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVVJYQkhUMG8wWlZkQlVFTmtNVFF5U21OTVkxRRAB",
            "text": "Came here to celebrate a friend’s 40th birthday, we had a great time. The food was delicious, the staff was awesome and the music was great!! This place might be a little small but the decorations are beautiful and the size makes it feel very welcoming. There’s barely a bar and due to the size of the place once it got packed it felt hot. We ordered from the pre-fix menu which included a house salad, pastelitos to share with the table and a choice of a main dish. I decided to go with the coconut rice & beef stew with maduros on the side it did not disappoint. My husband ordered the pernil and yellow rice. He also found his plate to be very tasteful."
        },
        {
            "date": "3달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1RWbElRbDlXWkhkT01teGtlakV3YW5wVlkzYxAB",
            "text": "哇，这里真的有种诗情画意的感觉，田园风，很惬意"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdE4xOWZPRXRPU1ZkYU1XZEhaVmxSWW5sRmFXYxAB",
            "text": "Really good churasco and drinks! Great service from Winner :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nNGJFbDJPVTVXZFZaUGIyZGhSREZwYzNKUk1rRRAB",
            "text": "Mad good or whatever. Waiter Mr. winner was understanding."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcVoxOXhTbFExUzNSMFJWTkZObFUxWDJaMVExRRAB",
            "text": "best churrasco i’ve had, highly recommend. drinks are great too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd2RFTlhNa0ZGYWtweVJuTjNPREZKVGxkdWRVRRAB",
            "text": "Great place for brunch! Moses was a great server. Ambience and vibe was lit!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMFUyNVNjSEpyTVRSTldYcHdVSFo1VTI1VlRsRRAB",
            "text": "I attended the Sunday brunch with bottomless mimosas. It was amazing! Thank you to our host Moses! The food was amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ak5VRkdYMDh4Y0ZOclZXMUNUakZUVDB4WkxXYxAB",
            "text": "Service was amazing. Food was top tier. This is exactly the place you go when you want a top tier experience in Harlem. Will always come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUk5Wb3RaemRWYnpKVGNtbG5VRkpUU2xKR01GRRAB",
            "text": "The food here is amazing. I couldn’t finish it no matter how hard I tired. I will definitely come back and see Moses."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVlQzQldXRE16YW5KcVN6ZEdhRTF1T1ZOT05FRRAB",
            "text": "The churrasco was amazing- it was so juicy! And the portions were great! I will definitely be coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTlIwMWpTV0ZXVmtwdU5Xc3pYMFpXZFZSSlFsRRAB",
            "text": "Great place to spend brunch with the girls! Amazing service and food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdWNuQnhSV05GYTI5cVNYbzJTM2hqVUhKc2JWRRAB",
            "text": "Santiago's Beer Garden was perfect for my nephew's after-graduation dinner. We were immediately wowed by the awesome summer decorations, which totally set the mood for a fun, celebratory night.\n\nThe server, Jay, was just the best! He was super welcoming and friendly and cared for my whole family. The gentleman cleaning the tables was also super professional and polite. They made us feel special, which made the entire evening even better.\n\nBut the food!!! Oh my gosh, everything was so good! The oxtail was fall-off-the-bone tender and packed with flavor, the pork chop was cooked just right, and those chicken chunks were a big hit with everyone.\n\nSantiago's Beer Garden has a cool vibe, and the amazing service from Jay and his colleagues made my nephew's graduation dinner totally unforgettable. We're definitely coming back! Thank you!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSmJGVlVNemRYZVVOek1XWjRWVlpoZVVwUGIxRRAB",
            "text": "I just now left. Food was great. Service was horrible. I won't be coming back. Everytime I come, my family and I get treated less than. People were on both sides of us and they got checked on constantly. Our waiter never checked on us. Never asked if we wanted another drink or if we wanted dessert. Didn't ask if everything was okay. The guy that welcomed us was extremely un-welcoming. No smile, not even welcome. Just said sit wherever with a dead look on his face. The waiter was a bit rude. He stopped me mid sentence on my ordering and made a hand ✋️ like this. If you don't like your job or aren't a people person then let someone else have the job that cares and deserves it. Lucky I even gave a tip 😤 cause it wasn't even deserved."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU05XcG5UWGRYWmpST2RXNTJTVnBzU1Zwd2QxRRAB",
            "text": "They need to better In cocktails, we asked for a coffer martini, it was not good. The food was ok. Also, the waitress he seems  in the bad mood, and they were in rush like eat and leave. Never again at this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MVEycHpTRGRFUkZKSU5HZHNNR1F3UkMxa1dVRRAB",
            "text": "Music was amazing. Bartender was on point. Great vibes !! Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVRFdHlWekZqVkhsbFkyWlBVVmhKTTBSdFMwRRAB",
            "text": "Paola is the kindest sweetest waiter! Te aprecio mucho amor! Literally checked in on us every turn, was accommodating and so attentive! Will come back anytime she is on shift! Overall great eats and strong drinks! Great first time experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdlYwSkhQLWRLR2JREAE",
            "text": "From the moment I walked in, I was impressed. The ambiance was warm and inviting, with just the right balance of comfort and style. The staff were incredibly welcoming and attentive without being overbearing — you can really tell they care about the customer experience. absolutely amazing! Every dish was fresh, flavorful, and beautifully presented. I highly recommend the [insert dish here – e.g., “grilled salmon with lemon herb sauce” or “signature pasta”] — it was cooked to perfection. The portions were generous, and you can tell a lot of love goes into their cooking."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TGQxWkdTVFZEZWtSS09YbzJha0Z4T0ZGRmNWRRAB",
            "text": "The vibe and Energy was amazing here today . Paola was a great server to us and made our time very special. Will come here again !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMdXF6cURHcG9IbFp3EAE",
            "text": "The atmosphere is fun and lively, but this place’s potential was overshadowed by the its failures. The staff was neglectful and spent more time enjoying themselves or chatting with friends rather than attending guests. It took 8 minutes for us to be recognized as clients while  we waited at the door. Once seated, we then waited another 20+ minutes to be acknowledged. Aside from that, I had the sea food platter, terrible idea. The calamari tasted as if it was fried 2 days prior and the shrimps were tasteless. The batter was heavy and lacked seasoning. My partner had the chicken soup and it tasted worst, salty and the meat tasted over cooked. All in all the concept is solid but this places potential but requires a great deal of work in order for me to return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUHgtUG15enFXN0p3EAE",
            "text": "We had an amazing experience at this restaurant while celebrating a colleague’s birthday! The rabo was absolutely exquisite—rich, flavorful, and perfectly cooked. The churrasco was incredibly tender, melting in your mouth with every bite. On top of that, the unlimited mimosas were the cherry on top, keeping the celebration flowing and fun.\n\nThe service was friendly and attentive, and the atmosphere made us feel right at home. I’m already planning to come back with more friends and family. I highly recommend this place to everyone—you won't be disappointed!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxblRVTlpTRFZsYkhOWU0yMHllSGM0VFhOdVJVRRAB",
            "text": "What a nice surprise!\nTheir commitment to good products includes satisfying amounts. Food was great, super fresh, flavorful, and a large variety.\nService was great, too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNVNIaGtVVWhoUlRsSk1FSllhR1JvWVZOT2QxRRAB",
            "text": "Great food customer service a plus, bartender and server great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJX3d4OHVqMVktUUdREAE",
            "text": "I used to love coming here frequently but they've raised their prices and it makes it a bit harder to buy food here. The lunches I used to get were $10-$12 and now it's $15. The food is amazing, don't get me wrong, but it's just not affordable anymore. I still come once in a blue moon, so I give it three stars because the prices have gone up significantly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdUVrTDIzOXYzRC1RRRAB",
            "text": "I love it here !\nThis guy winner served us with so much love oh man I can't wait to tell my whole family about this place .\nAnd Genesis was amazing the hospitality here is greatest . If you don't know how to have a great time without complaining stay home ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMU2VwdDJ0b0lqNXR3RRAB",
            "text": "First time here, Genesis the manager and winner is Amazing.. the vibe was great. Will def come back."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cHJlNXZRRRAB",
            "text": "여기와서 먹어본 라틴아메리카 음식점 중에 가장 베스트 였습니다. 가격도 적당하고 주인아저씨도 흥과 멋짐이 넘쳤어요. 단지 한국인으로서 한국요리가 생각나는것은 왜일까요..?"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaWJsdXZfZ1AtN0NBEAE",
            "text": "I visited this restaurant for a repast in honor of a loved one who passed away, and the experience was truly memorable. The food was exceptional—authentic Dominican cuisine with a unique twist that made every dish stand out.\n\nAnthony, our waiter, provided outstanding service alongside his colleague, ensuring that everything was smooth and welcoming. Their attentiveness and kindness made a difficult time feel a little lighter, and I deeply appreciate their efforts.\n\nWe had a wonderful experience and will definitely be returning. Thank you, Anthony, and thank you to the team for making this moment special despite the circumstances. The dress code is casual."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYU85TU9JMHZYOXZ3RRAB",
            "text": "The place is amazing. Cozy and well decorated. The food was amazing and the drinks were great. We had the calamari, a Caesar Salad, and the Empanadas Trio. I had a mezcal mule and my partner had a a martini. Jay was excellent in serving us. The food was fresh and came out of the kitchen really quickly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU1QUEpBEAE",
            "text": "I recently attended a friend’s birthday celebration at Santiago’s Beer Garden in NYC, and I was blown away by the entire experience. We had the back area reserved, and let me just say—the space is beautifully decorated with flowers everywhere, creating such a fun and charming atmosphere. It was giving “tropical garden party” in the best way.\n\nWe had an open bar along with appetizers and dinner, and everything was honestly a 10 out of 10. The food was incredible—super flavorful, fresh, and beautifully plated (check out my pics!). I ordered the steak and shrimp entrée, and it was absolutely delicious—perfectly cooked and seasoned. I also tried a friend’s coconut rice, and now I’m lowkey mad I didn’t order a side of it too—so good.\n\nShout out to Anthony, who was our server—he was amazing! The entire staff was attentive, friendly, and fast, which really helped make the night feel effortless.\n\nWhether you’re planning an event or just looking for great food in a great vibe, I highly recommend checking this place out. It’s definitely a hidden gem worth visiting in NYC."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN1lLWUR3EAE",
            "text": "I consider this to be Harlem's hidden jewel. From the outside, you wouldn’t expect what’s inside — a beautiful, comfortable setting with a super pleasant atmosphere. The people at this restaurant are amazing, and the attention to detail each one puts into their work is clear. The drinks and food are absolutely amazing. I hope they never change."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LUo3dlRREAE",
            "text": "Been a busy Sunday brunch. Beautiful environment ( keep in mind it is an outdoor space) but covered and very warm. I like the decoration also. Food was very tasty and well presented. Drinks was fair enough for their price.Service was also good. The level of the noise was to loud to my opinion but in total was a very good experience. The prices are very reasonable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMWQtQlhnEAE",
            "text": "This was our second visit to Santiago’s, and it definitely won’t be our last! From the moment we sat down, Franklin made the experience unforgettable. He mentioned it was his first day, but you’d never know it—he was confident, friendly, and absolutely on point. Franklin felt like part of our friend group, making us laugh and feel right at home. His energy was infectious, his service impeccable, and his suggestions were spot-on.\n\nThe food was delicious, the music set the perfect vibe, and the overall atmosphere was everything you want for a fun night out. Santiago’s has definitely become one of our favorite spots. Big shoutout to Franklin for making our night so special!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bElUc3NnRRAB",
            "text": "Never EVER had an issue here when I used to live in the area. The food is phenomenal and the service was always TOP tier. 10/10 recommend the stewed chicken or the chicarrones with the oxtail gravy ooooooo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdlhoLTJWNW9hVVN3EAE",
            "text": "The art work was beautiful. Very eye pleasing location. Bartender knows his way around a mojito. Service was fast and accurate. Our server was kind, attentive and personable. The pernil was sooo good. Just the right amount of salty flavor and crispy skin. You can't really mess up beans and rice.  I wanted to lick the plate. Will return for another girls night."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXBxNzJBRRAB",
            "text": "The food here is absolutely amazing, and feels like a home cooked meal. Servers were attentive at checking in to make sure there was nothing else we needed, and got us seated quickly. The portions for everything were great, aside from the dessert as they did feel a little small for the price. The sancocho was a perfect for a cold day, and paired with the rabo you can’t go wrong. Would definitely love to go back and try some of their other items."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbDhMMVl3EAE",
            "text": "AMAZING. I’m Vegan and I had the stew eggplant is was soooooo good. The flavor was amazing. The coconut rice was so good. You can tell everything was made fresh. It’s clean and aesthetically pleasing. The greenery and artwork is beautiful.  Our server Genesis went above and beyond for us & gave us great recommendations. Everything she recommended was very good. My friends loved their food as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcklMSnRRRRAB",
            "text": "Santiago Beer Garden in Harlem was a fantastic brunch spot! We went on a Saturday, and the aesthetic was so cute—definitely Instagrammable. The food was delicious, especially the Matthew’s Way dish with oxtails, fried chicken chunks, and coconut rice—so flavorful. My favorite, though, was the vegetarian Fongo, which was super fresh and packed with flavor. The drinks were perfectly boozy but still tasted amazing. And shoutout to Genesis, our waitress, who was incredible and made the experience even better! Highly recommend for brunch!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaUx4UGJ2dUlTNHZ3RRAB",
            "text": "Great service, ambiance, vibe, music, and the food is just like back in Dominican Republic 🇩🇴 full of great taste"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN4aXBZSxAB",
            "text": "We had an amazing Mother’s Day Brunch at the outdoor seating area. The hostess was very friendly and accommodating especially since we were a little late to our reservation.  The food and drinks were amazing. We started off with the empanadas and fried calamari. They were fresh and well seasoned. The Mojitos were on point as well. Not too sweet or super strong. For the entree we ordered the oxtails with coconut rice with black beans. It was a great portion of food, tasted  divine  and was very filling. Carolina our waitress was great. She was very attentive and got our food and drinks in a timely matter given the busy Mother’s Day event. Will definitely return again and will recommend to friends and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcS1YcDZ3RRAB",
            "text": "Came here with my coworkers for my birthday. The staff was amazing. Friendly understanding. Food was delicious!! Drinks kept coming my type of service. This is a birthday to remember. Thank you for your hard work!! I appreciate the staff. I highly recommend."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aTYyMXNBRRAB",
            "text": "Food was excellent. Arrived very quickly after ordering. I had Pollo Guisado with coconut rice and beans, and it was very flavorful and tender. Service was excellent with the food arriving very quickly. Came two days before Christmas and the very warm interior and tropical atmosphere inside were quite welcome on the cold winter day. Wanted tres leches cake for dessert but they were out so I had a delicious brownie instead. Will have to come back another time for the cake!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOXF2c25BRRAB",
            "text": "I went as part of a party of 8 and I have to be super candid. The restaurant is beautiful,  and the manager on duty did an amazing job of making up the slip ups. Our server was super polite and was attentive without being pushy however The food took forever and when it arrived it was cold, tables arriving after us were receiving their food. I had to send mine back because I  couldn't overlook it and my side of avocado took even longer to come out. Our drinks took long to come out as well. The food is extremely delicious and every business may have an off day. I see so many great reviews 😕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSazhiR1pBEAE",
            "text": "I loved the food, it was great... The drinks I had are really good as well... My only issue was the waiter served us our food, but never gave us utensils in the first place and we asked for the utensils but was still waiting around over 5 minutes. Besides that the theme and decorations inside is beautiful..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPR2MtNnFFb2NLeFBBEAE",
            "text": "We selected this place for Dominican Mother’s Day. Although the food was decent, this is why we will NOT return to this place. We were a party of 11, and the reservations were made in advance. Five of us arrived 20 minutes early, which included my elderly, disabled parents. They told us we were too early and they would not seat us until the entire party was present. So, we had to exit the restaurant and wait outside the restaurant! The restaurant only had a few people inside and our reserved table was clearly empty. These people weren’t considerate enough to accommodate my elderly parents and offer them seating inside even though they saw that my Mom uses a cane and my dad is in a wheelchair! Then when our entire party arrived, on time, we were seated and told we had 90 minutes to eat!!!! I’ve NEVER been told anything like that! When we ordered dessert and asked for coffee, they said they did not serve coffee in the summer months! What Spanish restaurant doesn’t have COFFEE?!!!  NEVER AGAIN!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNi15Rm1BRRAB",
            "text": "The vibe in this restaurant is so relaxing and nice. The food is amazing & the drinks are good. The server was great kept coming back and asking us if we needed anything. Only bad thing I disapprove of is that they will not allow you to wait in restaurant for an additional person in your party. My friend had to freeze outside waiting for me to arrive since she was there 15 mins early. I think this policy has to be changed because anyone else would have left from being so cold. I understand the restaurant isn’t so big but i feel this is so wrong on all levels."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMDl6Y0N3EAE",
            "text": "The food here is really REALLY good! I’ve only had the pernil and coconut rice with black beans (they have two kinds). Literally THE BEST pernil that I’ve had at a restaurant…I didn’t even need the green sauce that I asked for! It was very flavorful without being overly salty! It was perfect really."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6LXFpQlNnEAE",
            "text": "If you're on the hunt for some killer Dominican food in a fancy setting, you've got to try Santiago’s Beer Garden. I swung by for Mother's Day and seriously, the place did not disappoint. The food is absolutely delicious—each dish bursting with flavor and just the right touch of authenticity that makes you feel like you’re dining in the heart of the DR.\n\nService here is on point, too. Despite the holiday rush, everything came out fast, and the staff was super attentive and friendly. It really made our celebration feel special.\n\nJust a heads up, though—the space is a bit on the snug side, and the bathroom situation is tight, which might be a bit of a hassle when it’s busy. But honestly, that’s a small price to pay for such a fantastic dining experience.\n\nAll in all, Santiago’s Beer Garden is a total gem. Great vibes, amazing food, and speedy service. Definitely a must-visit if you’re in the mood for some top-notch Dominican cuisine in a chic spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxLXBPY0JREAE",
            "text": "Went with a party of 4....food was OUTSTANDING. The fried shrimp and empanadas appetizers were great. I had the fried chicken chunks with rice,my friends had the oxtails,steak with onions. Everything was on point. Went back recently and was not disappointed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNV9YM1VBEAE",
            "text": "I went a year ago and I didn’t love the experience nor was it memorable, I tried it again yesterday and I absolutely loved it. The food was amazing and the bottomless brunch was a lot of fun. Glad I went back and tried it again. Thank you so much for a lovely time."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaS1xUjR3RRAB",
            "text": "Love this place! As a Dominican Girl, I am always looking for restaurants that blend our culture with modern dining. It’s such a cozy place. The food and drinks are delish! We had Anthony as our server and he was very attentive and kind. He recommended the best dishes and drinks. Music was good, I would say mainly Spanish urban. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbDRfajJBRRAB",
            "text": "Went on a date with my bestie and it was super cute. The music volume was good, the service was quick and the food was 5/5.\nWe ordered the Trio empanadas(chicken/beef/cheese) & The Jalapeño poppers to start with. The crust on the poppers were PERFECTLY crisp! For the meal we ordered the baked chicken w/yellow rice and beans. The oxtails were fall off the bone good and paired with white rice and beans. Definitely, coming back and looking forward to trying the steak or Butterfly Shrimp. Drink-Soju punch"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNmNDNklBEAE",
            "text": "Food and drinks were really good. One of the best Dominican owned restaurants I’ve been to. Great service from the entire staff and a super chill atmosphere.i ordered the oxtail with yellow rice with a side of sweet plantains. I will definitely be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1OTQyNnF3RRAB",
            "text": "Food was tasty but not served as specified. e.g. steak was made well done when it was requested medium rare, then it was sent back and came back medium to medium well. Drinks were okay. Service was lacking, our server went on a break and didn't communicate with anyone to come take our entree orders which had us waiting some time after our appetizers were eaten and plates cleared. We had to get up and go their work station to request service.\n\nAdditional note: their chairs aren't very comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc18ydHpnRRAB",
            "text": "I came here with my wife on a Friday afternoon. It was semi-busy, but were able to get a seat right away. From the start we were amazed by the vibe of the restaurant as well as the temperature, it felt refreshing just being inside. The music was also great. The one comment is that it can be loud due to the volume of people. The hostess was nice and we started with the mofonguitos and drinks. Both were delicious and would recommend trying both. As for the main course, I got the pernil with coconut rice and it was blown away. I normally don't get impressed with the food of my people, but here, the taste was there at every spoonful. The pernil was tender and delicious. The dessert was good, typical dessert. I would come back, 11/10!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbnRYaHNRRRAB",
            "text": "I am starting this review with some direct advice if you're really hungry and come to eat right away for the food wait time for the food is 45 mins or longer.  came here on to separate occasionsandit'ss 45 mins till your food arrivesato the table, make sure you aren't in a rush, and stick with beer and wine. We came here tonight for dinner with a reservation, From the photos, Santiago's Beer Garden (outside) looks humongous, but in reality, it's actually quite small. Our table was wedged in tight between two others, but thankfully, our neighbors were really nice.Drinks: we ordered a mojito, margarita, and sangrita. All three cocktails tasted like straight-up juice. The strongest drink we had was a Presidente beer. The food was ok. Nothing to brag about did not have the wow factor. Service from the waitress was great she was fun and entertaining. Beautiful place inside definitely imstagramable"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMWZuNzJRRRAB",
            "text": "The food is pretty good, but my server absolutely sucked. The guy who bust tables that was really really nice and very kind and really attentive as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Z00tbi1BRRAB",
            "text": "The food was absolutely delicious. We waited at least 1 hour for them to tell us they didn't have pernil or oxtail. But the churasco steak was delicious. And they made up for this by giving us delicious empanadas and dessert on the house."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcnVqNHhRRRAB",
            "text": "Santiago’s is one of my favorite places to eat in NYC. If you don’t know about this gem you should get acquainted. This is my third time visiting Santiago’s and I usually drive over a hour to get here. Some may think that’s extra but NYC is me and my fiancés get away a lot of the time.\n\nWhen you get there you’re greeted instantly and I love that. The aura of the reaturant is a garden vibe and the music is upbeat and loud enough to vibe too but not so loud that you can’t enjoy conversation. The staff is A1 and attentive. They were quick and friendly.\n\nThe food was yummmmy as usual. I had the salmon, mixed veggies, and tostones. The salmon was cooked perfectly. My fiancé had the oxtails with yellow rice and black beans along with sweet plantain and sliced avocado. The oxtails were soft and flavorful. We also had the fried calamari and the empanadas for an appetizer. So good. My favorite drink is the Pina Colada. I mean it is so good and they are generous with the liquor in the drinks. Trust me you’ll love them.\n\nMake sure you check out this little gem located in NYC!"
        }
    ],
    "reviews_count": 83
}