{
    "name": "Sisters",
    "place_id": "ChIJ4bMvkQv2wokRUPRQUqYPUEc",
    "grid": "MN11",
    "address": "47 E 124th St, New York, NY 10035, USA",
    "rating": 4.1,
    "user_ratings_total": 658,
    "phone_number": "(212) 410-3000",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTlMwSTJOVWg1Y0d4d2FtUndZV2s1YTJWS2VIYxAB",
            "text": "My daughter and I ordered take out today. We couldn’t believe how tasty and wonderful the food was! We had the chicken curry roti and we have to say we’ve eaten a lot of this from other places and Sisters has won our hearts and stomachs. The jerk salmon was just as pleasantly tasty and we love the caramelized veggies. The staff were very nice and it was a warm and welcoming atmosphere 10 out 10! We’ll definitely be back. Oh and the pineapple cornbread was delicious too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZllqWldNRnBsUTA5UExUSXhOR2RmTFd0SVVXYxAB",
            "text": "The staff was thee most attentive and courteous I've ever had from any restaurant! The gentleman waitstaff is the utmost BEST! I Went there for my youngest son's 20th birthday and they made it sooooooo special! I LOVE THAT PLACE. I Hope people go there so they can enjoy the food,  atmosphere and staff!! Oh, and the owner was extremely kind and such a beautiful person!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cU1UTkpWM05YY2pKRFQwZE9TVkZoY1ZBeFZYYxAB",
            "text": "We had oxtails, rice and peas, cabbage with carrots, as well as  yams. The food was fresh great portion sides and tastes made with love!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dWJGWnpaR1pmZG1KeVVVeG9VR2hpVEdKQmNtYxAB",
            "text": "Such a cozy restaurant with amazing food and service. The three women running the place were all so kind. Oxtail was melting off the bones and in my mouth and rice was perfectly cooked. I don't live in the neighborhood so I can't come back everyday but I will stop by every time I'm in east harlem. Thank you for such a wonderful meal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bVpsUjVSazluTkhobmJsbFhaQzFOYUhsd1RWRRAB",
            "text": "Really amazing food and the best people!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMVFXcHRkRGhZTnpGUlRUVnZjRkV5WDFwR1lWRRAB",
            "text": "I ordered through Uber eats. I never had a oxtail roti before so I wanted to try it. For what ever reason there were small pieces on yam on top of the roti skin. Not only that the roti it self taste like sugar. I never had sweet oxtail before. I didn't enjoy it at all, and felt like I wasted $30.00."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UVFWcDFZVEZYYVZCRGNtdzJlSEZJWW1kSldGRRAB",
            "text": "Really small portions and gave me the wrong food after delivering my meal to the wrong place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM1pXOUpkV3B0WkVSNVEyVXRjM2xzVVVac09HYxAB",
            "text": "Small resturant. No card payment during visit. Cash or Zelle only. Food was very good but not exceptional.  Portions small. Staff polite and friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFRIWkllalZ1WkVWQlpEWlBlVzFpYldwSVdHYxAB",
            "text": "Small is really small especially for $5"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNFVWTTBRa0ZOTW04MU5ITkRPV0ZxUzBkdGJWRRAB",
            "text": "Sweet yams were a 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTk1EWTFiRmhoUzBOQ2QwOWZkRWxIU2sxM1MwRRAB",
            "text": "I’ll never go back. Upon receiving silverware, we were given two damp napkins. When asked for a few dry ones, the waiter said brb, left out and went to the neighboring bodega for a handful more.\n\nOrdered the Mac n cheese which came out looking like it was scraped from the bottom of the pan, tasted very dry. The restaurant itself was hella hot and dusty. There’s an A in the window tho. I think the  hibiscus lemonade may have been the best part."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSGNtNVdPSGQ1ZFUweFJ6RldiMDFrVG5nMVZWRRAB",
            "text": "The food was nasty 😒 I didn't like the food the curry wasn't mixed well it tastes very gritty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNVdrSnFiM2hsVVRaS1EwTkphek56WDFWZldWRRAB",
            "text": "Really amazing food and the greens where so well seasoned 🤤."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RVFtRllibUZUUWxwSE0wMWFUMWhEZG1SWmNWRRAB",
            "text": "Good food with good people"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUFlyb2pWMllqeTNBRRAB",
            "text": "The food is really good. I got the jerk chicken with rice &’ peas. I definitely plan to return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQUDUzdmVSOWJEZS1RRRAB",
            "text": "Very nicee"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJNnBwc0QtMnNEZElBEAE",
            "text": "Stopped by Sisters Caribbean Cuisine for their lunch specials and was pleasantly surprised by how flavorful and satisfying the meal was. I tried both the jerk chicken and the chicken curry, each served with a rice and seasoned cabbage.\n\nService was quick and friendly, making it a great spot for a weekday lunch. I’ll be trying the oxtail next time.\n\nAh! It’s cash or Zelle payment only."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM3hoNWlZOEptQkd3EAE",
            "text": "It’s a cool small cozy chill spot to grab lunch or dinner, I need to go back there and order to go so I can pig out in private lol"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZXU0X1Bya3VpRTJRRRAB",
            "text": "Solo he pasado a recoger comida"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLakN0dmoyb1puc0dREAE",
            "text": "They are the best mon food taste good very good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX09pcXI4d3ZmY0JREAE",
            "text": "I love them"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHRhWGp3RRAB",
            "text": "The Owner very nice. Make you feel like family here. Sisters we’ll be back on our next New York adventure. Thank you for a great and warm welcome."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUxUSEh3EAE",
            "text": "I get roti from Sisters whenever I get a chance because it is in my opinion the best roti I’ve had uptown.I have never had a problem with them but last night had me furious.Whoever made my plate clearly didn’t care to read and didn’t care…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvanRqaVVnEAE",
            "text": "Amazing food and extraordinary customer service. We had a little bit of everything but everything literally tasted so good. We recommend the jerk chicken, ox tail, candied yams, Mac and cheese, collard greens, everything lol"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHV2a29BRRAB",
            "text": "best roti i ever had"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbUlhTlNnEAE",
            "text": "We got \"lost\" in Harlem and ended up at Sister's. The food was really delicious and, compared to many other American restaurants, the food here was freshly cooked. The Lady was so nice and told us about her trip to Europe, hopefully she will make it to Germany very soon. She gave us the menu as a souvenir of our visit, it has a good place in our home. I have attached a photo with my home village in the background. Best wishes from the three tourists from Germany and hopefully see you soon"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWNIS193RRAB",
            "text": "I came here for the first time and was disappointed with the professionalism and customer service. I saw that they had a sign advertised right in front that said 15% off first order if you download their app. I asked the gentlemen inside and he could not provide me any substantial info on their “own” advertisement. He instructed me to order through the app. So, I  downloaded the app and went to order but upon checkout I saw no mention of the discount. I asked him yet again for assistance which he was of no help. I requested for the manager, he then said he’s not in then he quote stated “ matter of fact I am the manager today.” I was highly confused how a manger could be so incapable & unwilling to make the service right. He then said I can call the owner myself, (which is a very improper request in itself). I said no the least he can do is call the owner himself to get more info and assistance with running his establishment which he clearly needed. He called her and she said the sign isn’t suppose to be out, and told him to turn the sign around which proved lack of awareness and accountability on their part. I would have expected the owner to attempt to make it right. At any successful establishment, the bare minimum would be to at least give the discount advertised and apologize for the inconvenience would have suffice. I just wanted what was advertised but, I guess that was too  overly ambitious. I walked right out. I try to shop and attend black owned businesses being a women of color myself but, sometimes the customer service is just un-bearable and my time here proved it to be correct. Highly unprofessional. Do not recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMHVySk93EAE",
            "text": "Marlyn was the consumate hostess. Our reservations had been lost and the restaurant was going to host a group the night of the reservation request. She offered a slightly earlier arrival time, which we obliged. When we arrived, the restaurant, normally a casual set-up, Marlyn had set out the 'good china', goblets, and cloth napkins with decorative napkin rings on our table to apologize for the confusion! She was also a delight, a great conversationalist, with a great smile. Oh yeah, and the oxtails were slamming! It's small, intimate and homey.  Treat yourself."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNWVHTW9RRRAB",
            "text": "On a sightseeing trip through New York, we happened upon this place for dinner. And I have to say, we were pleasantly surprised. The food was excellent. We were also warmly welcomed by the owner and had a great conversation with her. A lovely woman who we will always remember fondly! Greetings from Germany and hopefully we see you soon again!! (The three Tourists from Germany).❤️❤️❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ejh2MEVREAE",
            "text": "Great food and customer service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ejdtWVNnEAE",
            "text": "Amazing! Went there for a team dinner night, the food and customer service was spot on enjoyed it to the max.…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ejRtX093EAE",
            "text": "Delicious food, attention to detail, and warmth from staff makes it a wonderful restaurant for any occasion. I will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ei03NVhREAE",
            "text": "very good food and excellent service. staff was very friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MU9MLWV3EAE",
            "text": "The service was very courteous and very accommodating.  The food was some of the best I've had in years. I didn't taste the processed chemicals we are accustomed to even in high-end establishments. Everything was amazing. The oxtails were so tender I was able to eat them successfully with a fork. So you KNOW that's saying something."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzllWGx3RRAB",
            "text": "First of all me and my daughter like trying different restaurants and she came across this one and we ordered from them and not only the food looked nasty it just look like it was thrown in the plate & the most disrespectful thing was when they gave me 3 oxtail bones smh horrible taste and the oxtails"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWZUMWF3EAE",
            "text": "Thank you for the delicious food and wonderful service!!  Can’t wait to return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX3NMWG1nRRAB",
            "text": "Ordered delivery from this establishment while in town for work.\nPaid for extra oxtail gravy and pepper sauce separately, however received neither. Also ordered the hibiscus lemonade but received regular.\nDisappointed that with the additional costs I didn’t receive these things i paid for. I will say the jerk chicken was tasty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNjdUaVpnEAE",
            "text": "We have been here today for the first time and the food was amazing. chicken and vegetarian plate was both super yum 🤤\n\nThe lady who served us was so nice, we chatted a lot and she made us feel very welcome 💕"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNjdUY0lnEAE",
            "text": "I visited Sisters for the first time today, and it was absolutely delicious! I had a vegetable plate that was full of flavor and love. On the counter, there were lots of interesting books to read while waiting for my dish. I wish all the best to sisters and see you next time. Much love"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMWZfdTlnRRAB",
            "text": "After a long day of appointments, Sisters was such a welcoming place with such comforting and delicious food. The owner was very friendly. We were even given samples of additional sides so we could try them. If you're at the MSK Ralph Lauren Center, recommend this restaurant right across the street."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX09QbFlREAE",
            "text": "I can’t believe that they are still here. I was first introduced to sisters back in 94 or 95. I was working down the street from them and my Wednesday and Friday lunch was the pea soup. What a fantastic meal that was. I move out of NY and recently I have returned and am going around all those wonderful restaurants in Harlem that I remember. Sadly some have close but some are still around and am happy to see that sisters have stay open and now they have table service. In my time it was take out. I will be visiting them soon with my entire family."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN0t2azd3RRAB",
            "text": "Loved this place! Would recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMjdqMDFBRRAB",
            "text": "Super tasty, as per usual! I got the veggies roti. Nomnom"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfa2VDWHJ3RRAB",
            "text": "Ordered on Uber eats and the woman working has no comprehension of how to work the online orders. She called to ask what my order notes meant when they were options selected from the presets. She then called me back to ask me where the delivery driver was ? This store uses it's own delivery staff . How am I to know where the driver is. This is the second time I have had a negative experience with this store. Maybe in person service is better but ordering is a nightmare."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdUpuNjJBRRAB",
            "text": "Super sweet people ❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMzRucFNBEAE",
            "text": "I personally did not like the seasoning on the food but that is just me. I ordered the veggie plate and the cod patties I felt like there was too much black pepper, but I think you should still check it out and support, maybe you'll like it more than I did everyone's taste buds are different and maybe I'll try something different next time before ruling it out."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LWE2NGtRRRAB",
            "text": "When walking in you notice how small it is there are a few tables for you to sir down and eat. You are instantly greeted when coming in. I wanted the shrimp roti but was told that they were sold out so I got the oxtail platter with peas and rice and cabbage. This did not disappoint the flavor and spices were there and it was delicious. If you are looking for some delicious carribean food please go here. You will get full off of their portions."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNmZIMzJBRRAB",
            "text": "The oxtail roti made me understand why Jamaicans say bless up"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMU9uNVJBEAE",
            "text": "Almost licked the plate! Everything was delicious"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzblo3c0hnEAE",
            "text": "Best food I have had in a very, very long time. Shevone at the front was super nice and personable. Food Fire, vibes fire! Parking was easy to find as well. Will be back every time around. -From CT"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3JERmtRRRAB",
            "text": "I first came across this restaurant’s food at an event I attended.  A few of their dishes was a part of the catering.  Their food was absolutely delicious I had the yams, fried whitening fish, and collard greens.  Let me warn you if their collard greens were SPICY.   I don’t do spices.  Even many of the people who love spices also stated it was to spicy.  I was in the area and decided to order for lunch.  I visited the restaurant in October 2023.  I placed my order online so it could be ready for pick up when I arrived.  I was disappointed to learn the fried whiting fish is only available through their catering menu.   I decided to order the stewed chicken, coconut peas and rice, steamed cabbage, yams, macaroni & cheese, cornbread, and lemonade.  When I arrived to the restaurant, I noticed it’s not a sit-down restaurant.  Seems like you pick up and go.  I was greeted by staff told them I was picking up and they let me know my order was ready.  I was so eager to dig into my food.  I was expecting the Caribbean flavors and was let down and disappointed in my meal.  I even shared with my coworker for her opinion.   The best thing out of everything I ordered was the yams and lemonade.  The chicken was bland and had no flavor.  The peas and rice was okay.  The cabbage wasn’t cooked and still too crunchy again no seasoning/flavor.  The macaroni and cheese wasn’t good.  The cornbread was okay, it has pineapple in it.  I don’t think I’ll return and if I do it’ll only be for the yams and lemonade. This didn’t taste anything like Caribbean cuisine.  The portion of the food was also really small.  My total was about $36.00.  This location is accessible via public transportation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaEo2WWpRRRAB",
            "text": "I went there on May 12, 2024. I picked up some Mother's Day food for my Aunt. I ordered oxtails with okra and white rice. I got my Aunt oxtails with coconut rice,  peas, and sweet potatoes. The food had wonderful flavor and you could tell they made their browning sauce because it was a little too sweet for me, that and the fact the plates were too small is the only thing I didn't like. My Aunt enjoyed every bite. Donald was so nice over the phone and when I got there. I would go there again. They get a 🤩 emoji from me. Excuse the photo we started eating then I remember to take a picture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbU03Y2JBEAE",
            "text": "Horrible experience. Don't even write Instructions if your getting it delivered because they don't listen. I ordered oxtails with white rice and collard greens with a side of sweet potatoes and mac and cheese. I asked them to separate the Mac and yams because I didn't want them touching the meat. They ignored that and smashed everything together in one small container. More than half the container was soggy rice and collard greens. The collard greens were WAY too spicy to eat! Who makes spicy collard greens?? They gave me less then a full table spoon of yams for 5$ smh same with the Mac. At least the Mac and oxtail and sweet potatoes were good but the collard greens ruined the taste of everything because everything was smashed together. I had to scrap it out of my yams.. I'm just so disappointed to have spent over 30$ smh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb2UzUUNREAE",
            "text": "The food was wonderful! I had shrimp roti, the curry was spicy and flavorful, the shrimp were large and the portion size was generous. The hibiscus lemonade was so delicious, I would drink that everyday if I could. I took yummy coconut pineapple cake home for dessert.  Service was friendly and accommodating. The restaurant is very small, could seat about nine people family style, at one long table. The four stars for atmosphere instead of five is for the heat. On a hot day as it was, the air conditioning was not adequate for comfort. They are planning to put in more fans soon, which would help."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNTZ6eEVnEAE",
            "text": "Absolutely delicious curry chicken Roti (Buss Up)! I believe he may have handmade the Roti right while I was waiting. Oh em gee! Large portion, spicy and well seasoned! A+"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bjYySVJBEAE",
            "text": "Ordered from here for lunch for my grandson and I. 1st off... delivery guy pointed out for me to check my food because of huge oil spill on paper bag food was in. When i was unpacking food the smell was unpleasant. Once food was unpacked you can see entrees were wrapped in saran wrap. Large amount of oil collected in wrapping and leaked out into bag. Cracked open the callaloo (spinach and okra)... 🤢. Looks like throwup. Nothing I ordered had meat. Veggies and rice shouldn't smell like this. 1st and last time ordering from here. Damn near $70 down the drain and we still dont have lunch. ☹ All of these 5 star reviews are LYING. TRUST! I give credit where it's due... ESPECIALLY good food.. (peep my other reviews).. this aint it though !! 👎🏾👎🏾🤮🤢😷🤐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcXZmX2V3EAE",
            "text": "Tried the curried goat roti and chicken entree, it was delicious. If you're not used to those wonderful spices, be careful in a few hours. I'd go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cVpDNTZRRRAB",
            "text": "They do only take away now. You can eat at nearby park. Excellent caribbean food. Chief cook was very nice and allowed us to taste different levels of spice to make sure food was not too spicy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOFpDZWd3RRAB",
            "text": "The food is incredibly flavorful and well balanced. Also the owner was very sweet to my mom and me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxejVDbFh3EAE",
            "text": "The Best oxtail with rice I ever had!!! Amazing sauce. Not oily at all. Rich and tasteful!!Take out only."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNHV6SzBRRRAB",
            "text": "I just had the most delicious lunch! Curry chicken with callaloo, and I ate every bit of it! Flavorful without being salty. Filling too. I'm sad that in the 6 months I've been working here I hadn't tried it sooner.\n\nMy coworker got the jerk chicken, which was melt off the bone good, with a peppery kick at the end."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMGZHVkp3EAE",
            "text": "Purchased a stewed chicken roti (non wrapped) earlier from sisters. It’s 8:33pm and I’m now having lunch at work. To my surprise when I opened out the roti it seems like some was missing (see photos). This is not the first time this happened. Can Sisters explain this to me?"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeVBHMnRRRRAB",
            "text": "I enjoy the food here quite a bit - I think the food alone would made this place a 5 star restaurant. I think the value could be just a little bit better - curry with roti is almost $20, and is a very standard size. Can't fault the food, though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbkliRm9RRRAB",
            "text": "Hmmmm so good didn't get to take a pic. They flavored my goat just right. Love the spiciness. A friend referred and I'll be back?  You'll not be disappointed. Delicious!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdklTNFdnEAE",
            "text": "Very disappointed in the portion of food. The price to serving ratio is unfair. The cornbread was literally a slither. I won’t be supporting this business anymore.…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NXVYMUxBEAE",
            "text": "At this point they owe me some stars! This is by far the worst Caribbean restaurant I've ever had.  Almost $100 for 3 orders of pure garbage! I'm convinced that the good reviews were written by their associates.  The food looked good and if I could get full off of looking at food awesome but I can't.\n\nThe Oxtails; I've never seen oxtails this small.\nI received 5 pieces and only 1 had a small amount of meat on it,  the rest was just fat and bones.  They smelled like ketchup,  taste like sugar and Thyme.\n\nThe peas and rice taste like they only added coconut milk and nothing else.\n\nThe steam cabbage with carrots taste like sour water\n\nHad we enjoyed the food I still wouldn't return.  Almost $100 for 3 orders of food, at any other restaurant the portion would've been considered a small.  It's not a coincidence that both orders of oxtails was all bone and fat. All 3 orders went into the trash.\nI see they mentioned being a small black owned business which I would love to support however,  you can't rob the community that you expect to support you.\n\nI'm glad to see you pay attention to your feedback.  What I find unfortunate is the lack of accountability in your end. Every day will not be a win. Had your response to my review mentioned you may have missed the mark with my order,  I would have given it another try thinking I caught you on a bad day. However,  you're choosing to deny all negative reviews as though it is impossible to have an off day.\n\nThe lack of accountability and disregard for my experience just leads me to believe this is not the place for me,  my family and my referrals.\n\nI too, am in the customer service field by way of hospitality- accountability goes a long way. Run your business how you see fit, I don't see the need to return or refer the guest from my business.\n\nEnjoy your day, no love lost wish your business a better future for others."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcElpeGFBEAE",
            "text": "100/10, absolutely delicious. I got the curry chicken, mac & cheese, and collard greens. Will be back to try more!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0MGFienJ3RRAB",
            "text": "The food is very good. Tasty and fresh. Prepared well.\n\nThe service is polite and courteous. They do take some extra time to try and get your order right.\n\nYou'll get a better result on timeliness if you call your order in advance."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbC1yV3h3RRAB",
            "text": "My mom and I got the chicken roti and this was the BEST chicken roti I ever tasted in my life! Hands down the most delicious chicken roti in New York! The curry chicken was crafted with culinary excellence and the roti was nice and flaky! Cooked to perfection!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieDdYMnlBRRAB",
            "text": "love this restaurant, but the rice/ peas were a little dry and small portion this time. kept it at a 5 since the service was really great. Otherwise- the yams, collard greens & other sides were well seasoned and cooked to perfection. It’s a small place with ambience and mostly intended for small parties/ pick up orders."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicUkyeEpBEAE",
            "text": "I just ordered from UberEats, and I was thoroughly disappointed. The chickpea curry was fine. The candied yams were okay. However, the mac and cheese was gross. I unfortunately had two orders of it because they were out of collared greens, so it made up half of my order. It had a slimy texture and a weird smell and aftertaste. I've had mac and cheese that was bland or dry, but this is the first time I've had some that actually tasted bad enough that I just couldn't finish it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaXJMVkN3EAE",
            "text": "I called in for a party of 4 and when I arrived there was seating right at the door so I assumed it was the waiting area but unfortunately that was the  area for dining! I was extremely shocked. My family was not happy with the seating arrangements! so we decided to leave but I will say that the food smelled amazing, and if I was alone I may have sat down to eat but I would have been right in the entryway. So basically if a lot of people came in to order they would be on your back! No exaggeration but The positive part was The owners mom she was so polite and such a beautiful person she apologized and went above and beyond with explaining the reason for the setup. They have a nice store front so maybe some outdoor seating would work! And the inside can be transformed into a seating area for a pick up/take out station. Maybe I’ll try another time"
        }
    ],
    "reviews_count": 72
}