{
    "name": "BLVD Bistro NY",
    "place_id": "ChIJd9WGjg32wokRD-tzqpGQTSY",
    "grid": "MN11",
    "address": "2149 Frederick Douglass Blvd, New York, NY 10026, USA",
    "rating": 4.3,
    "user_ratings_total": 2663,
    "phone_number": "(212) 678-6200",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM05uSk5PV2N4TW5aaVVraG9ZUzFJTjBOT1UzYxAB",
            "text": "Went there on a Sunday, arrived only a few minutes after opening and there was already a huge line to be seated. We barely got a spot at the bar so I definitely recommend making a reservation. The service was a bit slow but I assume that's just because of how packed they were and I really can't complain because the food was phenomenal and worth the wait. The biscuits and gravy and their chicken and pancakes were insanely good"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWVpucG9ZbFpwWm01TWNEaDZkRU0yWVMxZllWRRAB",
            "text": "I went to  brunch after church @ the BLVD  few weeks ago in Harlem.👍🏾👍🏾\nThe food and service was great, especially the corn bread.\nPleasant  music nice vibes as well a great atmosphere. Kudos 💯 to the BLVD an enjoyable place to go   for gatherings and laughter, just enjoyable!! Thanks BLVD💙"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVJHZDZjMFF3WTNWNE0wMXBjRUl0WjAxc1QxRRAB",
            "text": "Sunday brunch: The food was very good, we had to wait a bit, even though we had a reservation. It’s very loud very busy but the music was good and the service was on par."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVWVXWmtabkZmZDNwaGExQjJSblE1V1dWSmJGRRAB",
            "text": "Yes sir, a must go for Gooood soul food and drinks,\nand boom delicious desserts, if you’re in the area you can’t go wrong.We went on sing along night so it was loud music,but our group had a good time 😁"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUE4xRkhSVVY2ZEd4TGFrcHBUSG8wZDFsMFIyYxAB",
            "text": "Love the food drinks and atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cmIxQkRZVGN5TTI1Q1FVeDFSMWxWWDNGTk0wRRAB",
            "text": "Overall good food and love the pictures. Thanks Zae!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MloySmFabGsyY0VGRVRsOWhkREUzYW1wWloxRRAB",
            "text": "Great service alwayssss!!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2a2VEZFVREAE",
            "text": "I ordered shrimp and grits , which is really good by the way. I placed my order to go. The gentleman went to place my order, when he came back I asked the price, he said \" $ 42, I said \"for shrimps and grits, he said the order us $32 , but I also have to charge you gratuity, I said my order is to go. He said ' either way I have to charge gratuity. So I told him to cancel that order. So is this what restaurants are now doing. I will make it my business to go over my receipt when I order in or out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVdtY3liVUpsV0V4dFltTm1VVEJETjB0SGMzYxAB",
            "text": "I’m not sure where to begin. I went to Blvd Bistro for what was supposed to be lunch, or perhaps dinner. The restaurant was short-staffed that day, which is understandable I guess things do happen. The waiter was very friendly, but we waited a long time for our food. I ordered lamb chops with broccoli and mashed potatoes, but I don’t understand the hype about this place. The music was good, and the atmosphere was nice, but the food was disappointing. The mashed potatoes tasted like instant box mix, my lamb chop was greasy, and the broccoli looked a bit brown. Will I return? Probably not, unless it’s just for drinks and to enjoy the music."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzM1duWlplbEJUZUVOeFZUWnpPR1l5Y1RKTVowRRAB",
            "text": "Food was good portion is just small. The tables are to close together. I had to get up from table to allow another two customers to sit down. Just to small!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdGFtUnNlVzk2VTJGck1rUTRSMnRCZUVocWQxRRAB",
            "text": "A total experience you must try!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdGRrNXlhakJTVjFGWmNIUnFTbEI0ZWpSYVoxRRAB",
            "text": "Service was good but very slow. 30 minutes before they take our drink order...not a good thing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNE9VdG9XVmM0YkRCT1J6VlBVVmd6VVZJMWIzYxAB",
            "text": "Blvd was an absolute 10/10! From the food to the vibes and the music , everything was on point. We even ended up having a mini photoshoot right at our table! Huge shout-out to the photographer, Zae, for capturing the moment and making the night even more special. Thank you for an amazing experience …I’ll definitely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRVJ6QmxZVzVGTTNoR1VUZE1SREozWlhBd05sRRAB",
            "text": "I ordered the chicken gravy and biscuits. It was okay but love that it was piping hot! The DJ is a vibe, I didn’t skip one song while singing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM2JWTXdZMk0wWkVKQ1oycFlVVXQ0TVROelNrRRAB",
            "text": "The staff is on point. The atmosphere is fun, and the location is convenient with great parking (a win already!). The food was good, but the collard greens were a miss for me. They were too salty and sweet, together it was a no for me. The staff was definitely willing to substitute I appreciated that\nOverall, it was a good experience with great service and vibes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFkxVkVaV3RxV2pkT09YZG5SMVl5U2xrNVowRRAB",
            "text": "Went on a busy Saturday evening, Drinks were on point , Food was great ,- it did come out cold but our waitress Niyah was a pleasure - she was busy but was always readily available and checked in on us. The music is very loud , you will not be able to hear your conversation. Felt inside exactly how it felt outside. I had a good time other than one older lady with a white shirt made a remark “where’s your clothes” that was very off putting considering I wasn’t in violation of the establishments dress code. That made me feel judged & patronized before I was even seated. I didn’t think she worked there bc that would obviously be unprofessional- unfortunately she did. Most likely won’t return here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNmVtVk5WblJZVkVWNFJrWXRkRXRJTURkQ2EwRRAB",
            "text": "My brother passed away in January so we came for brunch to celebrate what would have been his 21st birthday yesterday. We had some late arrivals but the hostess was extremely accommodating and patient. As well as whoever coordinated my large party. There were no hiccups and on top of that, the food was amazing. Thank you again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eE1XRnBNUzF0V0hoUlZrdDNaRkZGUTNKUWRHYxAB",
            "text": "BLVD B NY ALWAYS A VIBE !!!!!! 🎤 BRING YOUR VOCALS"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFVFMXFWRkZVWTBWTFJ6aFNRVWxPWTNobVNFRRAB",
            "text": "This place is AMAZING. We came from North NJ and Philly, party of 6. No regrets. Service and vibes on 100. Loved every moment. This is NOT a place for a quiet intimate meal on a Saturday night. The food... my goodness. The drinks....unmatched. We ate, drank, and danced in our seats. My compliments to the chef, front end and floor team.\nShrimp and grits A+\nCatfish and greens A+\nStuffed salmon A+\nShort Ribs A+"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNVpIcDFWa3BuTmsxNE1qZzFUbGcyTlhSaFkyYxAB",
            "text": "I throughly enjoyed everything at the restaurant. My highlight of the night was the photographer, Napoleon. He kind, patience, and very detail. He took the perfect picture for my mom’s birthday."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdmF6Tm9WRkJVTlhSNFluRTVabFZtTlhWRlJtYxAB",
            "text": "Napoleon the photographer was great!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NWRVNXZORlJXT1RseFNIZEhWV1l4VjB3MGFWRRAB",
            "text": "I happened to be in NYC so we (4) took in a brunch. We did not have a reservation and were happy to get a seat. I thought the host was very honest and upfront when before offering a table telling me the table time was a 90 minute limit. I thought this was actually perfect as I had to be to LGA for my flight. As we were seated we were enjoying family conversation when we realized, we had not even been offered water yet? Which begged the question, when does the timer start. Finally our waitress \"Mia\" did greet us  and we were served water. She took our full order including 2 catfish dishes, 2 shrimp and grits dishes, 4 cocktails and a coffee. Cocktails came out first, nice and very tasty, very enjoyable for all. The issue here is the coffee, being the absolute easiest task to achieve not coming out even after asking a second time when the drinks came out. When asked, Mia stated she is the one that serves/makes the coffee. So where is the coffee even after seemingly an additional 8 minutes? Unfortunately, as the coffee arrived we were already well into our drinks and had to turn it away. Our food arrived and the shrimp and grits 4/5 were very good, the dishes seem small for the price but they are packed and we both were full, the home fries 4/5 I found to be very good as well, seasoned well with the onions and peppers were a plus. The two catfish dishes 3/5 were lackluster and dry, not at all flaky and really not seasoned. It lacked that fresh out of the fryer look and taste. We all agreed that the biscuits were the freshest and fluffiest thing we had this afternoon. During our meal Mia did check on us once and I appreciated that although some in my party questioned it, we did also have to request more water after having empty water glasses for 12 minutes (after the coffee, i did wonder how long that would take), perhaps investing in carafes for each table is best or at least checking in with tables and if the water is empty, refill them. We did enjoy an additional round of drinks, very good drinks and we enjoyed them. It's the small things, get those right, and at these prices then is no excuse for not executing those, we also requested salt and pepper, did not come until our meals were half done, why? There is an automatic 20% Gratuity added on to your bill. The service level we received today was not deserving of 20%, and I tip extra most everywhere I dine. This meal did not command a $56 tip in any way. It serves as a gimme for the wait staff and doesn't promote good practices, why demonstrate excellence when I already know this party is at least $40+ with limited effort. I don't care about the price of any meal, when I'm out with family, it is what it is for me. As a Manager/Business Owner with 23+ years of experience I do have an issue with small executable issues, it's the small things that tanked this review."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twa1VrOXhWM2h3T1VvdFFsRTFha3RDUkdGRlptYxAB",
            "text": "food is excellent! Host and Dj are amazing!!! But I had to give three stars because the lady at the bar is absolutely disgusting!! I’ve visited twice and she was the bartender both times, her attitude was very unapproachable and she treated me like a nuisance. The first time I figured she was just having a bad time but the second time raised a red flag and may be the reason I will never visit this establishment again. I sat at the bar for 25 mins without being acknowledged so I let the host know and the bartender seemed mad that I spoke up because she bought my drinks to me and slammed them on the table. 30 mins into sitting I still had no water or menu and I began to complain out loud. She told me that I can get away from her bar and have a good night. As a black woman people like her make it hard to support black owned establishments because there was absolutely no cooth present…."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVdtaHFlV2xEVnpCWGF6Qm5UbTFNZDJ0bldrRRAB",
            "text": "I went here on a  date and I actually had a nice time.  The ambiance was  nice and calm with music that was not overpowering playing in the background. The lights were dim and the place looked clean. We had a nice booth in the corner and the seat was pretty comfortable. The drink was good too not too sweet. My partner enjoyed his drink as well. He ordered the smothered biscuits and he enjoyed it although I think the salt level might have been a little high for his liking. Will try other foods next time. We mainly went for the drinks this time.  Parking was surprisingly not too bad. Best time in my opinion to give more parking options is 7pm and beyond due to some parking restrictions. There was also a parking garage around the corner if you don't have patience or go earlier.\nWill definitely go back here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbmMzbG5kM2hGYldWd1FsWjNORGx5YXpod00wRRAB",
            "text": "Hello! My friends and I went to this restaurant after the harlem parade and had a wonderful delicious time. The photographer there was great and captured the night with me and the girls! 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M1ZESk5OSEpUVEc5V09FTnVXV05HTTFsZk4wRRAB",
            "text": "I had the turkey meat loaf with garlic wash potatoes was amazing delicious 😋 will be coming back also took the mother of my daughter and she had the Caesar salad and 1 drinks and she really enjoyed it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWlVuWkdkakZxUVdWMlJFd3RiV1l4Ulc5NmFrRRAB",
            "text": "I reached out to this restaurant, The last week of August inquiring about having a party for September 27 for 40 people. I received the email immediately back with a prefix menu with seven entrées and was told to pick 5 entrees from the menu for drinks. The prefix menu is $65 per person and the drinks was $60 for two hours per person open bar. I said OK I do not mind. Moving forward, the person who handles the events was not responding to none of my Emails or phone calls. I was stoping by  the restaurant to acquire about the menu had picked and  to pay upfront for everything which would've been about $6,000.  I got a email the first week of September asking do  I still want the spot and they only accepting 34 people , I said yes, they email me back asking me again Do I want the drink menu? I told them yes, I stated that previously they never responded back they never emailed me back. I emailed them the Back and told them can someone please tell me by September 12 if I'm gonna be able to get the location because I have people traveling from different states and I have elderly people that's coming to the event so I need to know if I'm still gonna be able to have the party there, no one  responded  to my emails nor my phone calls.  the who ever handles the event coordinating is very inconsistent and unprofessional with handling the situation. No one never respond. September 16 I get an email from whoever's answering the email saying they apologize for the inconsistency and for the lateness and not responding to me ,but I can still get the venue and they sent me a receipt showing how much I will have to pay for 34 people just for the food would've been $2,210.00 for 34ppl  I said OK. A payment link was immediately sent ask her for deposit of $294.34. I paid the deposit and emailed the person right after inquiring about the drinks menu and what happen with that they never responded the next day. I emailed the venue back and told them about the Unprofessionalism the inconsistent not responding and did the owners know that they treat people that's trying to book their venue like that and having the restaurant to look bad. All I wanted to do was have a dinner for 5 hours which would've cost me $6000 and I did not mind paying upfront because of their services and I would no longer like to book with their venue. I got an email back stating  and they will keep that in future mind and they apologize and I will get my refund back. I got a refund back of 235.99 not the full 290.00 deposit I paid. What was the $55.25 taken out for???? My time and patience was good I stay diligent about trying to reach out at the last minute when I received the invoice I was willing to pay and because of the unprofessionalism of this venue it cost me $55 for what ???? anyone that's looking to have a big function at this venue, you have to be very careful unless you were well know celebrity or politician. I was going to let the situation go because I truly did not care I got a restaurant  which cost a little bit more but the service was awesome the  people was awesome. And whoever that restaurant event planner was on top of their game, very professional professional. I get an invoice yesterday. The money from Blvd bistro has been returned and money is taken out for what for wasting my time for being unprofessional for what?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeVdIZzNWMVV0ZWtZelRqTmpTRkpCYW5jNFpsRRAB",
            "text": "I enjoyed Myself it's my 44th birthday 🎂 🥳 food was good the workers were very pleasant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVNWWlZPV3Q1TkdKeVZsQmliblZPYjNONmFYYxAB",
            "text": "I shared the crab cake.  The grits with eggs and fish were delicious. Owner was very nice and observant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214R2JqQmpOVUkyTldZME0wSktWSGxqUlZwck5VRRAB",
            "text": "From entering the door the chefs were very welcoming ! The host Keisha was so attentive and sweet! She was helping servers, helping guest, and when I called over the phone she was very polite. Our Server MIA !! Was great, she was concise, sweet, and knowing her stuff. I commend her for her swiftness and personable approach. Our drinks was superb, we had two of the frozen cocktails , one marg and the wine one. We also had a green tea drink which was lovely. Last but not least the food deliverer and the drink deliverer. Danny was very nice and swift while running our food, he was also helpful when asking for boxes and other whatnots. Abdoulalye, our water runner was perfecto, anytime my water was an inch low. He was there.\n\nOur food was 10/10. Coming from South Carolina our grits are amazing but these grits were crafted by GOD. Thanks to the kitchen.\n\nWe had 2 shrimp and grits (one without jalapeños)\nA Caesar salad - 10/10 that dressing is so good\nPancakes- 10/10 light and fluffy - sweet\nBiscuits - 10000/10\n\nThank you for welcoming us and sharing your experience and culture with us.\nAnnual cousins link up approved ✅"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aVkyeGxXazVrUm5KUFpuTndNR1ZxU0RWV2RtYxAB",
            "text": "I had an amazing experience here with my best friend.  Our server Nailah went above and beyond to provide us stellar service.  I am so grateful that she convinced us to try the cornbread because arguably it is the best cornbread I may have ever had.  The rest of the food was also good.  I am glad I had a great experience here and will definitely be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYWNFcDRYMmRWZURGVWNYbFFOV1JQYkU4d2FXYxAB",
            "text": "Food was immaculate. Never had cornbread like that before - so soft and fluffy. And shout out to my server Nailah W. She made the experience so enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFJYVkJZM1pwUkd0TllqZE5SRmMyTjNkNlJXYxAB",
            "text": "We were in town and made reservations for a group here. I knew I wasn't gonna be able to eat a lot so I got the lobster crab cakes and a side of mac and cheese.  Y'all... I knew when I should have stopped eating but I just couldn't.  It was all so good! I'm usually not impressed with lobster or crab cakes because of how bready it usually is but these were full of lobster and crab and flavor!\nOur server and the DJ were awesome. It was a fabulous experience!  I'll be back when I come to New York again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2JrVkxjMEpJVWkxSVpWcFhlRWxsTTJGSk4yYxAB",
            "text": "Came here to celebrate my friend's birthday because she wanted to do the singalong brunch. It was so fun. The food was delicious and the vibes were everything! Planning to come back again but definitely will be taking the train. I was highly blessed to get a parking spot but parking around there is not the greatest."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFZsSm9iekJsTjA1WU1raHhiMVkwTTJNd1ZWRRAB",
            "text": "The experience today was wonderful ZAE took beautiful picures. He was very professional, he was charismatic, professional, and he made me feel comfortable. I recommend him for all your events. Please book him!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFRtMHdjMWRSYUVSMGRGQm1hVWhUZEY5NVZXYxAB",
            "text": "Lobster crab cakes…. Man oh man. They were hittin!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WM2NsVnNOVTlDVUhaT1RtMTRNM1JZVFVKQmNFRRAB",
            "text": "My first time here. Enjoyed the environment and the food was good and hot! ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaFJEbGZSR3hmT1ZwRVVYVmZZbXRyYmpCV1dsRRAB",
            "text": "We were told if our entire group wasn't on time our reservations would be canceled eventhough 5 of the 6 were present. That's nuts!!! The host needs better training.  We all arrived on time and we then had to wait 20 minutes to be seated, though the whole back of the restaurant was empty and table settings there. Minus the initial interaction,  I will say the bartender (forgot her name) and waiter Marcos were exceptional.  They apologized for the wait, explained they were understaffed that day and asked for our patience. We had no problem with that as long as there was communication. The drinks and food were phenomenal. Therefore my overall rating of this place was high. They just need a little tweaking on host problem solving skills."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbGNuVTNPRVExU1RCRFRqbHVXbnBLUlZkaWVWRRAB",
            "text": "People expect perfection unreasonably. The dining experience is remarkable!!! Workers here are consistently approachable and warm. The servings are neither too much nor too little. Even with many dining options, I suggest this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTVJYbFpOR0puTmtWd1JtMVBMWEF0VjFoVWJFRRAB",
            "text": "Went on a Sunday for brunch and it was a vibe from start to finish. The atmosphere was dope, the energy was great, and the drink selection was elite. Every dish we had was on point. It was cooked perfectly, seasoned just right and full of flavor. Definitely one of those spots you want to lock in a reservation. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNVdWQnJiR1pVY1hadlJHbG5NV3hGZW5KVVYxRRAB",
            "text": "Food was amazing - vibes was everything i needed on a Sunday. However, Zae the photographer was the highlight! Very interactive, handsome, and made me feel super comfortable while taking pics."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTmNESTRjbmxHVGpoQk4xUnpaVmxMT0VGeFdVRRAB",
            "text": "The only positive thing about our experience was that we didn’t have to pay for the food — and honestly, that says it all. The service was extremely slow and unorganized, the staff seemed unbothered, and the food itself was disappointing. I had high hopes, but the entire visit was frustrating from start to finish. While I appreciate that they comped the meal, I would have much rather had a pleasant dining experience worth paying for. Unfortunately, I won’t be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNVQxbHRiSFZGZFVaSVF6ZzVlVEpXVVU5SVJrRRAB",
            "text": "I had been to the previous BLVD Bistro location many times.  For years, I told my husband about BLVD's amazing biscuits and honey butter.\n\nFinally, we managed to get to BLVD together (I'd always previously gone there with girlfriends) and it did not disappoint.  The biscuits and honey butter were yummy.  The chicken and catfish were both incredibly tender.  The grits were dreamy!\n\nIf memory serves, Marcus, was our waiter's name. He was very sweet and actually checked with an older employee when I mentioned the previous BLVD location on 122/Malcolm X Blvd."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdE4wWk1WRTlJYzBSeWMyRlpWVlpzWlZwUmRXYxAB",
            "text": "We had been eagerly anticipating our visit to Blvd for quite some time and finally found the perfect opportunity to go. We made a reservation for two on a Friday at 8:30 PM. However, even with a reservation, the wait time was extremely long—a clear red flag from the start. Despite this, the atmosphere was vibrant and enjoyable.\n\nOnce the hostess finally seated us, we quickly browsed the menu to kick off our experience. We started with the biscuit basket, which came with maple butter and jam. Unfortunately, the biscuits were barely warm, the butter was cold, and the jam was rather underwhelming. We also ordered the Uptown and the Sistah-Rita cocktails. I found them enjoyable and strong, which may have helped me keep my cool throughout the experience.\n\nFor appetizers, we chose the lobster and crab cakes, but they took so long to arrive that they ended up being served alongside our main course: the fried chicken dinner with greens and fries. By then, my patience had worn thin. Although the crab cakes were fresh and tasty, the hour long wait was excessive. The chicken was cold, and the entire plate seemed like it had been sitting in the kitchen for quite a while. We finally received our food around 10:40 PM, and during the entire evening, no one checked in with us, despite us asking our server twice about the status of our meals. My husband inquired about the peach cobbler for dessert and was told that the kitchen was closed. We left hungry and disappointed, as we paid our bill and just left.\n\nOverall, I was extremely disappointed with both the service and the food. The only highlights of the night were listening to Jared and the band.Can't forget Phillip the BUCKET, and the appearance of Sherri Shepherd and Kandi Burruss."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVVkzSkpZbUZCZDNGUFRUaDVaVzlNZVZCTUxYYxAB",
            "text": "If you visit BLVD Bistro, know that you’re going for the vibes and nothing else. The food is okay but the prices are ridiculous. (Pro Tip: buy the grits, eggs and catfish individually instead of the breakfast as advertised on the menu)\nWe had a reservation for a set time and over 1.5 hours later… we were seated. I know what you’re thinking “why didn’t you leave?”… We sat outside,  the breeze was blowing, the people going in and out became our entertainment. Plus we really wanted to give  Sunday Brunch a try.\nOkay, we made it in… the DJ and host announced there would be a sing-a-long! Dope! Maybe this thing can be turned around. Water was poured, we declined since there were floaters in the water.\nI purchased bottled waters instead. Our table host came to take our order, nice enough guy but really not built for the position, yet. The food took damn near an hour to come out, the appetizers were served with the meals, one order was wrong and the other was missing. At that point no amount of singing could save this experience. We asked for to-go containers without really touching our food.\nOver all - the entertainment is cool but the service is slumped.\nBTW- it’s not a big space."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT01sRlRVbnA0YWxGaWRVeE1SV3B2VkdWVFFWRRAB",
            "text": "A great vibe! Atmosphere and music is inviting. Service was excellent for our party of 8. And the food...good portions, flavor and presentation were good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcmRVOVliRXhoVkhSTFEyaEhMVzFGY25Vd1dFRRAB",
            "text": "I return to this place more than any other restaurant. The plating showed skill, but the seasoning showed excess. They keep things looking nice and meeting health standards. Workers combined warmth with prompt assistance. The employees take pride in customer satisfaction."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMloyWjZVRWx0UlY5cU1sRk5WMjFQVXpCdVpXYxAB",
            "text": "Got sick from shrimp"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR2VWWTVTR2g0UW1SaVpEUnJWV3QyT0V0V2RWRRAB",
            "text": "Zae the photographer took some great pictures of me and my home girls 10/10 highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeWFVNXpTekJLVjFkRVlWUnhTV0pLZG5oWlluYxAB",
            "text": "Great place great music"
        },
        {
            "date": "수정일: 6달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveFozcFBnEAE",
            "text": "어릴때 밥에 버터나 마가린 좀 비벼먹어본 아재들이라면 모두 친숙한 맛. 새우가 왕 크고 느끼한 맛은 할라피뇨와 베이컨 조각들이 잡아줌. 한사발에 32불이라는 고가(?)만 아니면 다시 오고싶음."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkamMzZEZORjlTTVVzd2RYcHFkRGRwWjIxUVprRRAB",
            "text": "I heard many great things about Blvd Bistro and was looking forward to this visit. The staff was great and very pleasant. And the atmosphere was dope. It wasn’t busy at 2pm on a Monday. Drinks were tasty. But the food!!!! Sadly it was not what I expected. Crab cakes were Devine as well as the catfish and the greens were okay. The menu items I didn’t like was the fried chicken and the fax and cheese my two favorite dishes. There was no seasoning on the chicken and the Mac was just noodles and cheese no flavor.\nAfter this experience I would give this restaurant another try and change what I order to try mor items. Give it a try and let me know what you think!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa2JscFFXVFpaYmxaamJ6ZG9WSFZ5YzA1S2VuYxAB",
            "text": "I love it here!!! The Staff is welcoming,very professional. The Energy & Vibe of the restaurant is like being at Your Family Reunion. The Food is so Good everyone is Happy,Dancing,singing. It doesn't get Any better than that!! Hats off the the Owners/Cooks/Servers/Dishwashers,Etc.......Keep Up the Good Work."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUlNVWjZiMTk1Tlc1c1pEaFVUMGgyTW1WRWEzYxAB",
            "text": "This was my first time dining at this location.  I loved the vibes delivered by the people and entertainment for the night. The food was delish! I had the stuffed salmon with whipped potatoes and broccoli. Make reservations. My only down side was that it was hot inside. The windows were open and the door kept opening and closing.  It was a busy Friday night. Bring your patience with you. However, overall, it was a good time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNcWxfUFdacTZieTlBRRAB",
            "text": "They had live music when I went. Very lively atmosphere. The service was good and so was the food although it took some time to get it. Drinks were a little pricey."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZlJGTk9lbkJxVEcweU0wRklRVEV4UWxOWmVIYxAB",
            "text": "we went this past Monday on the first day of the heat wave after my son's graduation so it was a lot of us. I made reservations online Thursday night and I had to wait for a confirmation that I never got but that's my fault because I waited to make a reservation but I went anyway being optimistic. We went at 12 or a little after 12 when they opened, and although I didn't have a confirmed reservation, they still made room for us and to sit together that was awesome. The atmosphere was cool. The music was nice not too loud and the food was amazing. I definitely would go back with my children or as a date or with a girlfriend.\nThe staff was very patient and nice and attentive"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUlVEY3pVbWxEYVU0NU0ySTNhSEpFUW1oWlltYxAB",
            "text": "As we walked in, Immediately  I regretted making a reservation.The music is too loud to even have a conversation. You walk in and everyone is yelling over the music. The space is tight.  The food is good and the server was polite and kept checking in . I wouldn’t visit again but if you’re looking for a loud weekend brunch\nThis is the spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdldWSlZURWt6U2tkRk1HbE9PVzlEUkhsamFXYxAB",
            "text": "I’ve been a loyal customer of BLVD since they were located in the basement of the brownstone. However, I must admit that their food quality has slightly declined in my opinion. My collard greens were not particularly good, and my daughter’s mac and cheese was equally underwhelming. We barely touched them. The collard greens had a burnt taste, and my daughter described the cheesy as “liquid,” suggesting that it should have been baked longer. The sides were also disappointing. On the bright side, the catfish is delicious. The weight just tried she offered us a poundcake and lieu of the sides."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbXQtcUN3EAE",
            "text": "This place was amazing!!!! Food was a reminder of home and I’m from Louisiana so yeah they are official!!!! The Short Rib was super tender the greens were on point, the fried chicken was good to the bone!!! Don’t let me start on the cornbread I think the lord himself was in the kitchen because the fig preserve mixed with that crispy crunch top and super soft inside and then that butter!!! When you put it together Heavenly is all I can say. We had a great time and even met the owner and she’s been at it for a minute true entrepreneur!!! God bless this place and if you get the chance stop by if you’re in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNTdPcERBEAE",
            "text": "Incredible dining experience and top tier customer service at Harlem's #1 Soul Food Spot. I had a mid-week dinner with my brothers and nephews and the music, the food, drinks and ambience were amazing. The GM James and Owner Carlos and the staff were very accommodating and the food and portions abd flavor speak for themselves. Wow so good!  A must when in NYC and the perfect spot to enjoy the new Harlem Renaissance in 2025. Living in México I miss this vibe so much but every quarter I'm stopping here to get my fit. Cheers!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3VDcWp3RRAB",
            "text": "I recently visited Blvd Bistro for a friend's birthday brunch and had an amazing time! The atmosphere was lively, with great music, delicious drinks, and an overall fantastic vibe. Our hostess, Chynah, was an absolute gem—so sweet and accommodating. The food was excellent, with everyone at our table ordering something different and enjoying their meals. The service was attentive and friendly, making the experience even better. While it was crowded, it added to the energy rather than feeling overwhelming. I’d definitely recommend making a reservation. The bar was also a whole vibe on its own. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNHFuNjVBRRAB",
            "text": "After spending majority of our anniversary in and around Times Square, my wife and I finally got into one of the boroughs to try an authentic local spot. We pulled up to BLVD Bistro NY in Harlem. Let me say that we're from Atlanta so we have certain tastes when it comes to lounges and good food. Happy to say that this place would right in back home. Upon walking up to the establishment, you can hear the music blasting and folks in there having a great time. When we arrived they had karaoke going and we enjoyed that. Our server Savannah was attentive and helpful with recommending dishes to us. She also gave us some late night spots in Astoria to try. My wife had the salmon plate while I had the catfish with mashed potatoes and greens. The sides were A1 and my wife loved the salmon. My only complaint is that the catfish was softer than I prefer and it also was a little oily. This perhaps could have been avoided had I mentioned my preferences so not the biggest deal in the world but certainly want to notate it. Lastly, this is a black owned business so expect great r&b and hip-hop vibes once inside. They also have large flat screens for the sports fans to check out the current games. If you in NY and looking for a good urban spot, I recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaEk3QW1nRRAB",
            "text": "I was visiting in NY. I have been to quite a few of these types of restaurants with this vibe and atmosphere. We had reservations but we waited a long time to be sitted. I  guess if you know the owner or a frequent patron, you get special treatment. We waited in the doorway, which was very tight and narrow. I just don't like being on top of people like that and people twerking all around me. Once we were at our table, the service was good, and the food and drinks were excellent."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dnREUjFBRRAB",
            "text": "Updated: I retunred to the resturant in July and August 2025.  The menu has changed and it's not what's reflected on the website.  I was quite disappointed.  There are new dishes that were added but I was looking forward to my meatloaf.  Both times I went the collard greens were to salty.   The chicken and pancakes were good.\n\nI visited Blvd Bistro in October 2023.  Be sure to make a reservation as this place was packed when we arrived.  I noticed people standing and waiting for hours who didn’t have a reservation.  Upon entry I was greeted by the host and we were seated within minutes.  The place has a great vibe to it.  I love the decor in the place.  The DJ was on point kept people up on their feet dancing.  Our waitress was Destiny.  She was very friendly.  There is a QR code on the table in which you use to view the menu.  We ordered the lamb chops with mashed potatoes and stuffed salmon.   It took forever for our food to come out but when it did it was piping hot and delicious.   I was skeptical of order the lamb chops as I feared it wouldn’t be seasoned or cook well.  Let me tell you I’m glad I was proven wrong.  The lamb chops were so delicious. As I’m writing this review, I’m reminiscing over the taste.  I also tried the lemon cake and ice cream which was also delicious.  The restaurant just needs to improve their wait time.  Give this place a try. It’s also accessible via public transportation.  I can’t wait to get back here to taste more entrees."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMkJoN0N5Z05XcHpBRRAB",
            "text": "Thoroughly enjoyed dining at BLVD Bistro NY. Every dish came quickly and the food was hot and delicious. Special mention for their biscuits and lemon pound cake. Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvekw3Sjl3RRAB",
            "text": "Collards Greens were too Salty. Either ot was over seasoned or the saltiness from the Smoked Turkey caused it to have a Salty taste. The Potato Salad was too sweet and the price was way too expensive for the items we had.....But it was a good experience 👍🏽!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcnU2VzJRRRAB",
            "text": "Had reservations at 3:15 on a Sunday for brunch with 8 friends to celebrate a birthday. It was busy but the hostess was ready to seat our entire party (only if everyone is there at the time), one of us was late so we were only able to get a table for 8 but one of us is tiny so we made it work when the last person arrived.\n\nMusic was okay, there isn’t a DJ but they play some classic hip hop music, it is loud but we were seated in a way where we could at least hear those across and next to us. I was surprised to see we weren’t offered a beverage package because I saw it on their website, but we did order 4 carafes which was plenty (each has 4 servings). The person next to me and I shared the 114 or 116 I believe, it was one of the flavored moonshine beverage.\n\nOriginally I wanted the chicken and biscuit entree, but I was told from the waiter that it’s a regular biscuit, I would’ve only picked that option if it were a cheddar biscuit. So, I opted for fried chicken and the blueberry pancakes (there are other fruit options). The food was great, there were a lot of people complimenting me on how good my chicken looked. It tasted as great as it looked, everything you’d want in a great piece of fried chicken. The pancakes were rich, fluffy and tasty as well. The syrup offered wasn’t the best quality, that’s my only complaint. I was also looking at the shrimp and grits as an option.\n\nNot including the birthday girl, what we paid per person was surpassingly cheap. I’d return if in the area. The subway station is literally in front of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcjZqVWtBRRAB",
            "text": "The salmon dish I ordered was delicious.  I had to send it back for a little more cooking for my preference, but when I ate it with the mashed potatoes and other sides it was yummy & tasted fresh. I also had African tea with honey to drink. The service was mediocre and a little slower than my liking. It seemed as if it may have been less staff than needed or perhaps our waitress just didn't like us that much, lol."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdGZmNHBBRRAB",
            "text": "I'll start with the good things 🤩: the staff is really professional and kind.\nThe atmosphere is pleasant and the music is great.\nThe most delicious food I have eaten, the dishes are rich in flavors.\nI give five stars because it was a pleasant and tasty evening.\nThe prices are a bit high.\nThank you very much friends for a good experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmIyWUFnEAE",
            "text": "Having come all the way from South Carolina to visit NYC, I had my reservations about ordering shrimp and grits at this restaurant. But wow, was I wrong! This place blew me away. I'll absolutely be a repeat customer."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbDktc2dnRRAB",
            "text": "Is this a restaurant or a club, because I can't tell anymore. And trust me, I'm all for a good time but not at the expense of my food suffering. I got the crab cakes that came out looking like hockey pucks. My sister's  po boy had three overly breaded / battered shrimp. They didn't even look like shrimp. So the 2nd crab cake was better, not great, I just mixed it in with the salad. Don't wanna say I'm done with BLVD. cause I've been here before and had good food. The server was good, only reason for the stars earned. Maybe I need to stick to coming earlier in the day when the sober chefs are on duty.🤣🤣🤣"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ODViTmZ3EAE",
            "text": "Visiting here for my birthday was an absolutely great choice for food. Everything was absolutely delicious! I mean absolutely delicious! Me and my birthday twin had an amazing dinner. We ordered the southern meal with the fried chicken, the short ribs with collard greens and yams, steak and eggs and french toast. For the appetizers we ordered the fried okra and the wings. The waitress surprised us with birthday drinks which were the most tasty 😋. It was not that crowded when we first arrived but it started to get crowded as the band was setting up. A young man was there taking photos with he iPad which we took lots of pics. He air drops them to you for $30. Besides us being asked in not a great way to get up because we need this table, we had a nice time. Customer service is key in any industry and we left as demanded. I'm glad we visited but highly doubt we'll return. Nonetheless, if you do go just be prepared there is a 90 minute seating. But you will definitely enjoy the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeFpFMTBVRmxvTVVkR1ZWWkVaM1ZZV1hoTmJVRRAB",
            "text": "The food was different temps the fish was hot the greens and Mac were warm they had no frozen drinks. The waiters and the music were great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMkhnYWE3d2RhUmxBRRAB",
            "text": "Loved it. The food was really good. I had the fried chicken dinner. Slammin.😘"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndU1YS25BRRAB",
            "text": "My travel companion and I came here on a chilly Thursday evening in on February. After waiting at an empty host station behind a party of 4 for 5 minutes with no acknowledgement, it was clear that they were understaffed.\n\nWhen we were greeted and seated, we waited patiently and had the pleasure of being served by the most wonderful waitress who let us know she was the only person serving this evening. Grateful for the acknowledgment and forewarning, we let her know we would absolutely extend grace and understanding.\n\nVibe:\nThe vibe and ambience is fun, warm, and inviting. Soul, R&B, and hip hop classics play loud enough on speakers to invite you to tap your foot, hum, or even sing along—igniting memories with each “oldie but goodie.” My date called it a perfect  homage to your favorite  worldly auntie’s playlist (Saturday night pre-game, not Sunday morning).\n\nOur order\nPeach Sidecar 8.5/10\nAlmost there, but missing a little something—maybe mint, flamed dried orange, or bitters—to bring a little extra flare and balance.\n\nDrinks\nRum it Up 9/10\n\nBiscuit basket 6.5/10\nDry. Think reheated KFC consistency—Not quite that bad, but not far from it. And the amount of butter and jelly was so minimal, there was no saving them.\n\nCesar salad 9/10\nMissing crushed black pepper\n\nPear and goat cheese salad 8.5/10\nMissing crushed black pepper. Also, could’ve used crushed walnuts rather than halves. That said, the flavors paired nicely.\n\nBARBECUE SHORT RIBS\nFor the sides:\nGreens 9.9/10.\nIncredible balance of heat, smoke, sweet, and acid.\n\nYams 8/10\nTastes slightly moderate microwaved/reheated. If they were fresh, 10/10.\n\nShort ribs 9.25/10\nDelicious.  Smoked and barbecue forward without being drenched in sauce. Being from Texas, I like my meat just a tad bit juicier. But I would absolutely order this again.\n\nSalmon 10/10\nNo notes. Even the broccoli was delicious! The salmon was covered perfectly and the lobster and crab stuffed inside were seasoned to perfection."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM0lHSFh3EAE",
            "text": "Food was delicious! I had some ginger glazed wings with there 7 cheese Mac and cheese , I’m still thinking about there yams and collards greens . I also had some delicious frozen strawberry and mango margaritas , place is a 10/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMklMdUVBEAE",
            "text": "Black owned establishment, which is always filled with beautiful black people!\nThe great vibes are contagious, the food is delicious, and the drinks are perfect!\nThe stuffed salmon entree was scrumptious!\nFresh and flavorful!\nThere’s something for everyone on the menu!\nCheck for special events!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMnM3NXR3RRAB",
            "text": "Really great experience here! The staff is great but the food is delicious. I had the chicken and, the steak and eggs and lobster + crab cakes. Let me tell you, I think of it all the time. The vibes are truly so good, the music was on point and this place is truly worthy of a few visits."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMc0x2bjNnRRAB",
            "text": "Okay so I've always wanted to try this place since it's such a hot topic of Harlem. Yes I'd like to try them again. Our server was such a sweetheart he checked on us as much as possible. The drinks were good. However the food took an hour & 1/2 to come out & was not really that for me the stuffed salmon seemed rushed it was such straight pepper no other seasoning. The mash potatoes & broccoli was really good though. The mac & cheese was very oily & salty it was a BIG NO for me. But I'll give it one more chance"
        }
    ],
    "reviews_count": 79
}