{
    "name": "El Paso Mexican Restaurant Mezcal & Tequila Bar",
    "place_id": "ChIJUa619ZD3wokRkg5D55la7U8",
    "grid": "MN11",
    "address": "123 E 110th St, New York, NY 10029, USA",
    "rating": 4.1,
    "user_ratings_total": 553,
    "phone_number": "(212) 831-9831",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKYWRVOTJUVXRuYlZoMlJVTlFWbDlJVWkxV1oxRRAB",
            "text": "Amazing food, amazing drinks. I have loved this place for years and it never disappoints!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaGRUa3ljbkJMVTNWMlptRkhaMUZFTnkxNk0wRRAB",
            "text": "Nice Resturant, nice ambience and music. It was taco Tuesday when we went and it had regular tacos for $3 each, achicken, carnitas and so on, minimum two of the same tacos per order, but it usually comes in an order of 3 of the same tacos.\n\nSo if you order chicken it has to be at least an order of 2 chicken tacos, you weren’t allowed to mix and match. I don’t understand the point of this, what if I order a taco and don’t like it, I’ll have another two or one of the same taco that I didn’t like and have to eat, other wise throw it away along with my money.\n\nThankfully I ordered the Birria tacos in an order of 3, at $6 a taco, at that price I should be able to mix and match my order, the other meats amongst that price point were asado and shrimp, which I would have loved to have tried, but wasn’t able to because of the silly rule.\n\nIf I’m being charged individually for a single taco, why should I be forced to put in an order of  3, minimum 2 of the same tacos. I usually cry when I have to pay $5 for a taco, but I paid $6 and couldn’t mix and match my order on taco Tuesday.\n\nThankfully at first bite the Birria tacos were juicy, flavorful, small, but filled with meat. It also had cheese in it which made it better. I traded my taco for an asada taco with my friend and didn’t really enjoy the asada taco, it was ok at best, it had a cooked on a gas grill flavor.\n\nThe red sauce was ok, was told it was spicy and it wasn’t, but thankfully the green sauce that wasn’t suppose to be spicy had some kick to it.\n\nIt also came with a small little shot of the beef brew it’s cooked in where I was able to dip the tacos. It had a nice chile de árbol in there which gave it some kick.\n\nThe food was great but the policy of minimum 3-2 tacos an order of the same taco is silly if I’m paying for each taco individually. Like for specialty tacos like birria and shrimp, I understand that an order of 3 should come at a fixed price. But this wasn’t the case lol.\n\nI feel like I should have paid $15 instead of $18, but they were pretty good and flavorful, not every Resturant gets the Birria taco recipe right, but they make them pretty good here in my opinion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaFlVMTNSa3RqYm1aRFpUUmlYM2g2WDB4eVRXYxAB",
            "text": "Cozy authentic spot!\nThey have mole!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVWVrZExRVk4xWldacmJWaEVaRWhTZVRSeVRFRRAB",
            "text": "Que delicia de auténtica comida mexicana el mixiote hidalguense exquisito Dios una verdadera delicia y los tacos gobernadores sabrosos, muy buenas atenciones siempre estuvieron pendientes de nuestra mesa, 100% recomendados tienen música en vivo lo que hace el ambiente más agradable perfecto para estar en familia."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGclNrdFVYekZsVFVKVk4yVjVUWG80YjJsUU1sRRAB",
            "text": "This was my second visit to this restaurant and once again I was very impressed. The food was excellent, the drinks were outstanding, and the service was truly exceptional. I look forward to returning soon to enjoy more great cocktails and the wonderful service provided by Luis."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSclRIUm9VbFUzZFdkZldHSnVjMk5rVW5Wb1gwRRAB",
            "text": "The restaurant has a very family-friendly atmosphere and feels truly Mexican. I loved the drinks they offer, and the food tastes very homemade, just like a home-cooked meal. The service was great, especially thanks to Luis, who was very attentive and made my visit even better.\n\nI went on a Taco Tuesday and the food was super affordable — I ate and drink a lot and ended up paying very little. I also found out that on weekends they have karaoke and late nights, which I think is awesome since I’m from the area and it’s a great plan to go out.\n\nOverall, I highly recommend it: great food, great prices, authentic vibe, and excellent service. 🌮🍹🎶"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeWVERk5jMEoxZEU1c1pFaEVVbGszWkhkWlltYxAB",
            "text": "La comida en El Paso Restaurante Mexicano es excelente, auténtica, con sabores que te transportan directamente a México. Los tacos al pastor, las enchiladas, los burritos y las quesadillas tienen mucho sazón, muy bien cocidos, y las porciones son generosas. Además, los chips con salsa y guacamole están perfectos: crujientes y frescos.\n\nLa atención es espectacular: Luis nos trató a mis amigas y a mí como si fuéramos reinas, siempre pendiente, amable y haciendo que todo se sintiera especial. Un lugar que definitivamente recomiendo si quieres comer algo auténtico, sabroso, con buena vibra y servicio de primera"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc2IzWkpiRVZyVlZreGJqTnJSalZmVHpGUVFXYxAB",
            "text": "Authentic Mexican Food with Authentic Mexican Drinks\n\n5 stars"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VM1pVcDRjbXh4UlhSek4yMXNMVVYzWm1aTllsRRAB",
            "text": "Food and alcohol were good.\nHowever\nI and my friend asked for double espresso, and were served (guess what?) Regular coffee (in big cups) which tasted like (surprise surprise) Regular coffee.\nI asked our server if it was indeed double espresso and he nodded and said \"No no, it's double espresso, this is double espresso\"\nAnd they charged us $8 dollars each, although there was another friend of ours who ordered regular coffee (which looked exactly like our \"double espresso\") who was charged $4.\nI know this problem sounds too trivial, but the issue is that nothing similar happened to me in New York, ever. Everyone knows what double espresso looks and tastes like, and it was quite upsetting that we were overcharged and served something we didn't order 😕"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVGJIZFpTRFF0WlZSd1lWbHNhSEJUY0V3MFQzYxAB",
            "text": "Food was great the drinks were also great until a roach crawled towards us on the bar…. And the bartender was not surprised. Nor did he try to make things better. Very disappointing and Disgusting. Made us pay full price for things after that as well which is just crazy."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NUxUWXlNa3ByU1Zkek1YRnZNbmRSUVRoNVltYxAB",
            "text": "La comida 8 de 10 el servicio muy mal 👎👎👎👎👎👎👎👎👎"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2FYcHBXR0Y0TlVwRll6Um1aVGwzYWxsVFVsRRAB",
            "text": "Good happy hour!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNanJvb2ZzdlBqRjB3RRAB",
            "text": "My wife and I visited El Paso Mexican Restaurant Mezcal & Tequila Bar on 110th St in Manhattan, expecting a great meal but left feeling frustrated and completely underwhelmed.\n\nWe ordered a salmon dish, a pork dish, and an appetizer to share, totaling around $65. The food? Disappointing. The dishes were mostly steamed vegetables with tiny, anemic portions of meat—and what little meat was there was mostly fat. My wife didn’t enjoy her dish at all, and frankly, neither of us felt like we got our money’s worth.\n\nBut what really turned the night sour was the dishonest and aggressive tipping scheme. The bill came with a forced gratuity of $15, plus suggested tip amounts for 18%, 20%, and 22%—but the calculations were wildly off. The so-called 18% tip was actually $45, and if we’d followed their 22% suggestion, we would have tipped 100% of the meal cost.\n\nIt didn’t feel like a suggestion—it felt like a scam disguised as good service. I chose not to leave an additional tip beyond the forced gratuity because of how misleading and unethical the tipping structure was.\n\nIf you’re considering eating here, be warned. Not only was the food mediocre and overpriced, but the tipping practices felt downright deceptive. Ask about gratuity before you order, or better yet—spend your money somewhere more honest."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQZjF1N0RqcjczYWJREAE",
            "text": "Very stiff meat"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeXYyUWJREAE",
            "text": "Five 🌟 great food great alcoholic beverage great service great atmosphere"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aXR1RkZREAE",
            "text": "Happy hour worth the price. Food is good service was also good. It was a weird smell inside the store but all the rest was ok."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReExiV1dBEAE",
            "text": "Such a gem of a place!  Every dish we’ve had here has been superb, from appetizers straight thru dessert.  In a city with a millions Mexican restaurants, El Paso stands out.  Highly recommended for everything from a date night to birthday’s and even happy hour."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbDkyaDFnRRAB",
            "text": "Food here is delicious we came here for a school trip and the service was amazing. Servers were very respectful and attentive. Great music in the background and the decorations were beautiful. Would definitely recommend coming here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXZ2Ny13RRAB",
            "text": "Honestly a hidden gem in Harlem is the only thing that comes to mind. Their chilaquiles verdes with arrachera and eggs were to die for and their drinks did not disappoint!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNnF6eXlnRRAB",
            "text": "Omg this is the best restaurant, the drinks are the best I recommend the lychee martini !!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcTh6czFRRRAB",
            "text": "Tacos was delicious and the Atmosphere was inviting and very welcoming"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM1BTQUhBEAE",
            "text": "What a hidden gem. Everything dish was yummy. I love their mole selection.  Mole cocktails,  salmon mole with white chocolate and roses 🌹,  mole lava cake. Everything dtink was a bit. Great bartenders.  Beautiful decor and murals. Fun place. Went back for chicken mole and chorizo sopes. Epic and phenomenal."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNVlfMTV3RRAB",
            "text": "Muy agradable lugar y los tragos de mescal super ricos .."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdHFUY0lBEAE",
            "text": "They dont make Dinner Burrito anymore :( , like the one with tomato, beans  on the sides"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYck5pN2xnRRAB",
            "text": "Excellent service and the food taste so delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM2JpeWlnRRAB",
            "text": "A gem of a restaurant right next to the subway well worth a visit! We are staying next door so enjoyed some margaritas during the happy hour and then came back again tonight for a meal and loved it, don’t skip on the churros for desert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OTkydTZRRRAB",
            "text": "I would’ve given it 5 stars but my husband’s  drink was watered down. I had sangria and it was delicious so was the quesadillas and the tacos! I’ll go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emU3Smp3RRAB",
            "text": "Delicious drinks, great food and customer service. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN2NIQXJBRRAB",
            "text": "Good burger good tacos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUa3REYTZRRRAB",
            "text": "Went to celebrate 5 de Mayo with my friends and we were welcomed with a complimentary margarita! Great food! The host Claudia was so much fun. The music did start off a bit late but I would definitely go again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ3FTZUJBEAE",
            "text": "Here for a date and a great time excellent food and excellent drinks, you can start with a romantic stroll along the waterfront. After enjoying the scenic views, head to a cozy restaurant known for its delectable cuisine. Indulge in a variety of mouthwatering dishes, from succulent steaks to flavorful seafood. Pair your meal with a selection of fine wines or handcrafted cocktails. As the evening progresses, let the ambiance and company create a memorable experience that will leave you wanting to come back for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdmNlYnlnRRAB",
            "text": "Food was absolutely delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURObmVuZHhnRRAB",
            "text": "Waste of money spent 27$ on a quesadilla food was cold and nasty first and last time ordering from this restaurant very poor customer service and quality of food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGeDduSGlBRRAB",
            "text": "Buen servicio la comida una auténtica delicia y los tragos lo máximo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnN6UzhnRRAB",
            "text": "This is a neighborhood gem that may be overlooked. It is a find in East Harlem- fresh, well prepared food and great service in a beautiful space with lovely patio in back.  We will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa0lLYmJBEAE",
            "text": "A cute restaurant with great service, food and drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMktuWUVBEAE",
            "text": "El paso would make Texas proud of the reputation this eatery has built upon themselves. Friendly staff, accomadateable seating too"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMTZyMU1REAE",
            "text": "An iconic representation of formal Mexican cuisine, and selected spirits, all curated by the owner himself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNXVqTTdnRRAB",
            "text": "A great place with great people. We recommend and we will come back."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN05POG9BRRAB",
            "text": "buen lugar de comida mexicana y la amabilidad del personal indiscutible"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcGVlR1p3EAE",
            "text": "The food is amazing, so are the drinks. The staff is so friendly, and the food comes out quite quickly. Love this restaurant ⭐⭐⭐⭐⭐"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNGZHTnZBRRAB",
            "text": "The place is welcoming,  beautiful, the service and the food are 💯"
        },
        {
            "date": "2년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM01Xd1FBEAE",
            "text": "Excelente restaurante Mexicano em NY. Vale muito a pena conhecer. Tudo muito bem preparado, porções excelentes e muito saborosas. Fantástica experiência!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcllDV2N3EAE",
            "text": "Fantastic"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dGFPc3ZnRRAB",
            "text": "Very good food, friendly staff."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3ZTTjN3RRAB",
            "text": "Absolutely incredible food, me and my girlfriend have a great time every single time we come to El Paso! We love the margaritas and the flan :)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNTVUeU1BEAE",
            "text": "Really great birria tacos as well as carnitas michuacana. Having grown up in the southwest, it's hard to find great Mexican food in NYC. This place is pretty decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Ni1xUEh3EAE",
            "text": "The food is not bad.\nThe drinks are good.\nThe atmosphere was bad yesterday when a friend and I went.\nIt's not our 1st time going there, but it was the 1st time we sow a roach crawling on the bar top. Gross! My girlfriend killed it with a tissue and handed it over to the bartender. We brought this to the managers attention and he said that he would take care of our bill. He and the bartender also mentioned that it is in fact NYC (whatever that means)\nI wasn't expecting a free meal but I was thinking at least he could have cut our bill down to half of the original amount. Nope!\nInstead he gave me one free drink and my girlfriend and I two free shots of tequila. Smh!\nShe and I will never be going back there. An East Harlem resident of 21 years!!!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0eHVIZWRnEAE",
            "text": "The experience was wonderful. It was warm and friendly when greeted upon entering the restaurant. We were so glad that we accidentally found this well decorated, authentic Mexican restaurant. Rogelio, our waiter was so informative and so…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bF8zVV9BRRAB",
            "text": "The food, service, and atmosphere were all fantastic! We had a great time here! Authentic and delicious, highly recommend it! Ceviche was my favorite!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLU1mczVRRRAB",
            "text": "I liked this place a lot because it was so family oriented. The owner is very involved and attentive always asking if everything’s ok.\nThe aesthetic of the pace is pretty nice, I like the outside set up and it’s pretty up to date and clean\n\nI had the 3 birria tacos with a margarita and it was good. I really enjoyed the mariachi they had with the lead singer singing directly to you, making time stop for a whole song of your choice.  I loved it, he sang “amor eterno” by rocio durcal amazing performance that was"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eUl6T193RRAB",
            "text": "This place is definitely worth stopping in. The Quesadilla Flor de Calabaza is spectacular. This is the only restaurant that I know makes this entree. The guacamole and margaritas are amazing. Although when you ask for spicy guac, it is just regular guac....\n\nThe ambiance and decor make me feel as if I was transported to my Mexican grandma’s house! Love it!!\n\nComing back to edit my original post - seems the owner read my post and my guac was spicy haha I’m in love now."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0MXF1VTZRRRAB",
            "text": "The guacamole is so delicious.  I also tried their steak nachos.  Wow. And I love their drinks.   Especially the Tamarind margarita."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPekotb2VREAE",
            "text": "The chicken has no taste and it’s all poorly made. I also waited an hour for my order of simple chicken tacos while everyone else ate first. I am certainly never coming back to this vile place after I seen a roach behind a picture and I’d advise you not to come either"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaklEQzBnRRAB",
            "text": "Great atmosphere for getting together with friends. Great drink selection. Food portions are small. The tacos are good but small and only serves two tacos with out sides.  Rice and beans must be added to order. Guacamole was delicious! For larger portions order do not order from the taco menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5M1AtXzNRRRAB",
            "text": "Amazing experience and awesome. This was above and beyond. The dishes were decadent and palate complimenting. Words cannot express how.good every dish was.. wr tried it all and new things and they hit the mark...... wow.. thank you.. The…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcDRINFB3EAE",
            "text": "I tried the sopes for brunch!! Really good and original tasting; also de mole from this place is Puebla’s tasting. I definitely recommend this place.\nNeed more customer service but they are doing well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGRHTEJ3EAE",
            "text": "First of all I Love Mexican food been to Cancun as a kid and I love Mexicans had Mexican friends etc So when I say this place right here in the Heart of New York Harlem is the Spot to be I mean It food so fresh you feel like Our ancestors bless the food being that I'm afro-Latina my heart feels happy and the music is great the people are warm and inviting Staff are beautiful inside and out 😉 I had the guacamole with queso I went easy with a couple Brewcziwes lol and a Live Mariachi band you can't go wrong one of  My favorite spots . You yes you got to go .. Viva la Mexico!!!!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdGNYNEh3EAE",
            "text": "My Favorite Place For Brunch On A Sunday. The Drag Queen Show Is Fabulous and Always Entertaining.💜 #Mademoiselle_Sekhmet #GodIsMyAnchor⚓️…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa3E2UlRREAE",
            "text": "Great lunch burritos. I used to get these and food coma right after because they were so filing and tasted absolutely amazing.\nI feel that dinner is not as good, imo, portions are smaller."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMk96dy1BRRAB",
            "text": "Place was cozy & had great food! Waiter was nice & super attentive. Wine was also good. Would definitely go again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDc0ozdXFRRRAB",
            "text": "Amazing food and amazing service would absolutely recommend"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNcTVET3pnRRAB",
            "text": "This might just be the best Mexican restaurant I have ever been to in terms of the authenticity of the food. It has that real full bodied taste of Mexico!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMGZMaUVREAE",
            "text": "I always come here for lunch... lunch specials are very good! must try the Ceviche de Camaron, the baja tacos and the enchiladas!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPekstSEZ3EAE",
            "text": "The chicken is unseasoned. The serving are super small the meat taste undercooked the food came out cold the staff walk right pass you while your trying to get their attention this is truly a horrible restaurant don’t ever come here"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0MXRiY3d3RRAB",
            "text": "Wow! I have so many great things to say about this place, I honestly don’t know where to start. My husband and I have come here quite a few times. Every time it was a great experience! Our favorite spot to come to just to talk and enjoy great drinks and Mexican food. Our favorite server is Cesar. We trust him with all his suggestions and the night specials because the food we have tried was absolutely delicious! He provides great customer service, and all the food is made fresh. He can explain the flavors and dish as a story and individually. We love the scenery, a romantic vibe. We will never get tired of this place. I have 0 complaints. All the food, service and drinks so far has been nothing less than amazing! We want to try everything on the menu, and we would definitely recommend this place to anyone. We will continue to invest in this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNTU2M3BBRRAB",
            "text": "My overall experience was good. Tacos are kids size but it still fill me up since it comes in three on a plate. I wish they had more toppings on the tacos. It's just cilantro and onions. They do add a surcharge if you pay by card. This…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNFBEazNBRRAB",
            "text": "El Paso moved & I think the location is hurting their business.  It's a shame as the old place was bustling.\n\nThe new restaurant is also well decorated.  The cocktails are as good as ever & honestly they were always the draw for me.\n\nThe food is suffering I think from slower business so choose carefully & if the waiter has recommendations take them.\n\nLast night they had mussels & I was wary but the waiter recommended & we ordered. They were best mussels I have ever had, incredibly fresh with wonderful sauce.\n\nMy entree on the other hand was not so great. The beans & sauce were delicious but the meat was clearly twice cooked leftover."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrX003S2Z3EAE",
            "text": "Legit top notch Mexican food. Classics but with that touch of character that only passionate chefs can provide. Service is fine, it's a local joint and the staff is appropriately casual but attentive. They have an outdoor space which is nice. But this is in residential NYC, so I was delicately encouraged not to sit outside around dusk(which I stubbornly ignored) and after night fell I knew why, the local rats came out. But from my other experiences it's a wonderful place for sunny outdoor margaritas and snacks during the day time. Overall a legit place for excellent traditional Mexican food. They do everything they can with what they got and more. Worth the trip just for the blue corn calamari."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0MXBYY1ZREAE",
            "text": "The restaurant looks very nice and inviting.  We arrived at 3:50pm for Brunch and when the waiter came over to us he was rude and advised Brunch was over at 4pm.  I told him twice it's not 4pm yet and he rudely ignored me.  So we order at 3:59pm and Happy Hour starts at 4pm.  Guess what our drinks were not charged at Happy Hour price.  The waiter would ignore us when we would try to get his attention.  Our food was served on one plate as an appetizer and we ordered 3 separate meals. I'll admit the food was good.  At the end the waiters changed shift.  The new waiter was much more attentive and polite but it was too late as we were done and ready to leave.  Not sure I'll visit again."
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncnVyQV9nRRAB",
            "text": "Excellent margarita's, delicious guacamole. Tacos and enchiladas are also certainly worth ordering."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCazdHckdREAE",
            "text": "Food is good but their service and availability…. Put an order through their site a day ahead, big order.  The day of I decide to call to confirm, no answer.  Multiple calls the number on their site went nowhere.  Finally, two hours past the time the food was supposed to arrive I made the trip there.  The guy is there in an empty restaurant chatting on the phone.  I tell him we are waiting for the order and that I called.  He nonchalantly tells me that it’s out of service.  Then tells me he didn’t get the notification of the order, a day ahead.  No apology, no offer of discount or anything else, just “do you want your food now”?   My job usually places large orders to local restaurants to support.  Not sure if we will give El Paso another chance."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0LXBuVklBEAE",
            "text": "The decor is great! The staff was nice and friendly. I give them 2 stars because they did not offer any info about happy hour. I had my meal and drinks, got my bill and I then asked about happy hour. Apparently, I had to sit at the bar to…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0aHIzdGVREAE",
            "text": "Great experience.  Food was fantastic.  Expect smaller tacos but fantastic taste if you get tacos only.  Friendly waitstaff.   The Rollitos dessert (banana) we ordered took a long time and we were not aware when we ordered it.  Once we…"
        }
    ],
    "reviews_count": 74
}