{
    "name": "Lighthouse Fish Market",
    "place_id": "ChIJwRC7hl71wokRlORk3BvaTA0",
    "grid": "MN11",
    "address": "508 E 117th St, New York, NY 10035, USA",
    "rating": 4,
    "user_ratings_total": 754,
    "phone_number": "(212) 320-8894",
    "reviews": [
        {
            "date": "수정일: 9시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZmRGcFZOVEp4Y2pCdFVqbHpSVVp0VFZWd01FRRAB",
            "text": "The food lack flavor the  mac salad old and tasted sour. I wasn't asked if I wanted to dine in or out and the difference in price to sit in and eat is crazy. Our food would've been 92$ as a take out order, just because we decided to dine in it was 140$.  Won't return! I rather go to the one on 8th ave and 131st street. Can't sit in but your food will taste good. They received 3 🌟 because staff was nice"
        },
        {
            "date": "19시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRU9VUXlUMmxyZHpsTWRHbHZVM0pWZW1jek9YYxAB",
            "text": "Had a wonderful Halloween 🎃 night there with great food and drinks 🍸 😋"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RVVWWlViRWRSZVZadlJFSmtNVmR5WWxGR05VRRAB",
            "text": "I celebrated my birthday there and got the works the host was great they all did there thing 10 stars across the board!!!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbFQyVkJaVXBpWVhkbFIzTk1XV1EzZFZSbU0zYxAB",
            "text": "Went there today and ordered two fish dinners to go.  When I got home and opened the dinners the fish must of been cooked in burnt grease. They were coated in almost black flour. Never had a problem with this establishment before. I am very disappointed and will think twice before going there again."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVowcFFZMUJ2TkhCUVptMW1SV1ZrUWkxM2EyYxAB",
            "text": "A Hidden Gem in Harlem – Lighthouse Seafood is Pure Perfection!\n\nWow. Just wow. Lighthouse Seafood in Harlem completely blew us away! The moment they took us through to the back to be seated, we were stunned — it’s a total hidden gem inside. The ambiance is cozy, unexpected, and absolutely beautiful — like stepping into a secret tropical retreat right in the heart of Harlem.\n\nNow, the food… unreal. The crab legs were the freshest, sweetest, most succulent we’ve ever had — pure ocean bliss. The Rasta Pasta was bursting with flavor, creamy, and perfectly spiced. The mac and cheese was rich and comforting, and the cabbage was seasoned to perfection — every dish felt made with genuine love.\n\nAnd the Lighthouse Punch? A total showstopper — tropical, smooth, and dangerously good. One sip and you’re instantly on island time.\n\nAlso, don’t listen to the negative reviews — this place is the real deal. Yes, it’s cash only, but who cares? They’ve got an ATM right up front. Easy.\n\nFrom start to finish, everything was impeccable — the food, the service, the vibe. Lighthouse Seafood is a true Harlem treasure that deserves all the love. We’re already counting down the days until we go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V1ZsZGFRbk5OYVROeVFVNTFXbkoyTjFOdFRVRRAB",
            "text": "Collards were way to salty, fish,shrimp too. Hbp patient. Please greatly reduce salt then everything will be just fine."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Vk5XOHdOWHBQUmxaTWN6RnZMVGRYTVdodFNFRRAB",
            "text": "The drinks are phenomenal, especially the Raspberry Lemonade!!! The Baked Mac reminds me of grannys love. The Honey Garlic Wings are flavorful & cooked perfectly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS1NXUkxUV3RyT1c1V1ZWZHJNRlJQY3pVemIzYxAB",
            "text": "First time trying Food is good we ordered a bunch of things from the menu , everything was pretty good I love there batter .Thank you"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRmJsaHFjWHBsY0V0cFUyVldiMDR3YW1Ob2MyYxAB",
            "text": "I was there today with some of my coworkers trying to eat some food and have chill vibes. The ambiance is nice I love how they set up the decorations however, we came in at 3:20pm ordered our food by 3:35pm and didn’t get our food until over an hour later. (It’s not happy hour it wasn’t packed). Our waitress came over and told  us she made a mistake and forgot to put our order in and had just put it in about 10 mins ago. Mind you we had been waiting for an hour already before she came and told us this. She had a nasty attitude because my boss asked for a discount due to the inconvenience of the wait. Her attitude really made the situation worse. The food was mid because they tried to rush to get it to us after we had been waiting for over an hour. 3 of us had the cat fish and shrimp dinner and the fish could’ve been cooked about two minutes longer. I feel like if the waitress had shown a better attitude the situation would’ve been much different."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a2ExZzRiRGN6WkdkeE5IaG9Za3hoYkRWemNWRRAB",
            "text": "This is a must visit anytime you're in the city."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVdVNTZWbHBuTlZSQ1NtSjRjbTFETURGeU5HYxAB",
            "text": "Every time I go here, its always a good vibe"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kYWJuazJTR3d5WVhaQ2IwWnVRVUozYlVWSWVsRRAB",
            "text": "Food is good just a little pricey"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSGNWcHJMVUo1VlZnMmJVYzFSbFpWZHpSQ1MwRRAB",
            "text": "Very rude and discriminatory towards my daughter. We buy food from here all the time. My daughter tried to use my card and they lied and said they don’t accept cc when we have and ppl. come in and use their cards all the time. Didn’t like how they lied and treated a child or a recurring customer. It was very profiled and strategic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1psZGZlVzlGYkd0MVlsOXVhWEpHUVVKc09YYxAB",
            "text": "The food was amazing. Me and mt family had a great time there. We enjoyed every dish. They vibe of this place is just so family friendly. I will be returning soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlFqbERkVTFZVDFJMVRVNUJVRXRhUldOaVoyYxAB",
            "text": "As a group with 9 we had to reserve."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeU5rcGpXazVhVGpKRExUSlhTMVUwY1ZWU1YxRRAB",
            "text": "Not real catfish, basic Mac n cheese wasn't great, the Henry Mac was good, lamb chops tuff, greens and mashed potatoes good, rasta pasta needed a different base, they serve on Dixie plates and plastic containers for $40 plates if food. Drinks were good, seever was decent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcE1VdzRkemgwVUZKRlZtazJiMDVCVjJaa1IwRRAB",
            "text": "I ate here for my birthday! The atmosphere was calm & welcoming! The food was really good, seasoned to perfection. The service was prompt & thoughtful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlNGUklVek5aZFhoUGEyRnpiWGd6Y0hOb2VtYxAB",
            "text": "Pretty decent spot. The food was good and service was spot on. Accommodating of a good sized party. But as shown in the attached picture, the payment options are not as extensive, they only accept cash which imo they need to be transparent about."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRGRVczRNaTFEVG5WNFpsZDZZVWR3VVU5V1drRRAB",
            "text": "Great place to eat! Food was amazing (I got jerk Mac) and the service was wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd1pXTlpNMU15Y3pVMmMxbFhhVXROTTAxT1dFRRAB",
            "text": "Omgg the BEST BEST soul food I've brought in nyc. I'm a southern girl and that catfish taste like it was fried in the back of my grandma house.  They had a live dj that was so so good.  The only thing I didn't like was they had hookah. I hate smoke when I'm eating.  I feel like that should be left for the clubs and lounges not sit down restaurants."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNE9HUnFZbnBRVlV4aVFVUkVZbkJuYVZRMmVYYxAB",
            "text": "Loved this place my friends visit from Texas and we had a ball! The DJ was banging ! Will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeGFFVm1lRkI2VERaZlkyZG9Obk4wYVhSWVoxRRAB",
            "text": "This place right here is all the way on point,soooo delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndE1tTmFZems0U0dWcVVqaDBVMjFYYkRKc1YxRRAB",
            "text": "I loved everything about this place will be back slot ! And my waitress ruby was great courteous kind and does everything with perfection  loved the dj too music was 🔥"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSWFEZFhSVVpCU1hCVlZETjNjRTR6T1hJMWFXYxAB",
            "text": "FOOD WAS EVERYTHING…20/20\nFIRST TIME WAS THE BEST EXPERIENCE I HAD!\nFAMILY LOVED EVERY BITE!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSaFNWWmFVR296YW5CWlIzZzFTMVZmTTBVNGVXYxAB",
            "text": "When you walk in the host set at the table and yelled we only take cash and then proceed to yell for us to follow her no your going to get up and greet us in the right way\nThen the server (Jonathan) to be exact walked up and go you ready no Introduction and for him to be the server he did nothing the man that brought out the food did everything we ordered and the food comes it’s no utensils on the table some of the food was cold and the crab Alfredo was not good it seemed like it was old and was put in the microwave and for 40$ that’s just disappointing over all the experience was 1/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTVlsVkxNMlpmU1VWRVZDMXNUamRZUzNSS09IYxAB",
            "text": "Jonathan was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlF6Rk1XRlZSWWtoZlRYTnROM1ZUU1VSMkxXYxAB",
            "text": "Great food great drinks great service by Johnathan\n100% recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd2FYaFRXbkUzVkRNNU5ta3RNbmd6T0VaNVQxRRAB",
            "text": "it was great and a fun space!!!!! jonathan served and he was great!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaWVGQjBUakJvZWpadlFVaDRZMEZCZFVWc1YwRRAB",
            "text": "The food is really the star,this place has SAZON!! everything tastes intense! No time for blandness.service prompt  efficient and polite.the atmosphere is ok.but for the quality if the food, I imagined it was a restaurant for rich people. Prices very very reasonable.they also have a truck in Harlem, equally good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1JWSjJhM3A0ZFhGZlIyeFVjRlU1WlZSMFlXYxAB",
            "text": "10/10 recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelQxUk1iVzB0Tm5WRVZUQlNja1I0TVdGVldWRRAB",
            "text": "Drinks was amazing , food was amazing, nice place loved 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZlpEaGZNRWhWWWpWUlVtVndlVFYzTUVwcFRHYxAB",
            "text": "It’s a nice place to come for a 1st date I had a good time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRFdERlhkalUwYmw5UE5GWXlSV0puYTJOeVVIYxAB",
            "text": "This place is such a vibe I love it here 💕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNGJVVnFhbFpzV0RSRlFtdGxTbk5qYkdoVFRuYxAB",
            "text": "Johnathan was an amazing server"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYVZWaGlVVEZ1ZURSRlRVeE1Na3N5WlZCQ1YzYxAB",
            "text": "🔥 Made a Saturday day trip from Brooklyn to East Harlem just to try Lighthouse Market—a soulfood seafood gem—and YES, it was worth every bite!\n\n🍤 I had the fish & shrimp with cabbage, potato salad (SO good), collard greens (🔥), yams, and mac & cheese (REAL cheddar, no fake sauce). Everything was seasoned perfectly and served HOT—not lukewarm!\n\n🎉 The vibe? Upbeat and welcoming. Busy takeout counter in front, full-service dining in back. It’s a bit off the train line but super easy via the M15 SBS—hop off at 116th & walk 1 block.\n\n♿️ Fully accessible with a roll-in glass entrance, spacious layout, and staff who went above and beyond to pack everything just right when they saw I use a wheelchair.\n\n💸 Prices lean high, but the flavor and portions are 💯 worth it. Lighthouse Market is now at the top of my go-to list!\n\n#LighthouseMarketNYC #SoulfoodSeafood #EastHarlemEats #AccessibleDining #NYCFoodie #BlackOwnedBusiness #WorthTheTrip #FoodieFind"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21remFHdFBiREY2TTFoa2VrUkxlbU15UkVwallrRRAB",
            "text": "Best vibes......."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUFIxaEhSblZaYVdoMlpsVkpRelJhV0Vwd1ptYxAB",
            "text": "Worth Every Bite!\n\nI had the absolute pleasure of visiting Lighthouse Fish Market with my daughter, and let me tell you, this place is a true gem. From the moment we arrived, the atmosphere was peaceful and inviting. It’s a quiet spot, perfect for enjoying some high-quality seafood without all the noise and fuss.\n\nBut let’s get to the best part: the food. The seafood here is top-notch, fresh, flavorful, and cooked to perfection. Every bite was a burst of flavor, and we were genuinely impressed by the quality and taste. You can tell they take pride in what they serve.\n\nThe staff was super friendly and made us feel right at home. We left full, happy, and already planning our next visit. Just a heads-up: they don’t accept credit cards, so make sure to bring some cash.\n\nWhether you're looking to have a fun outing or just want a delicious meal in a calm, beautiful setting, Lighthouse Fish Market is definitely the place to go. Highly recom"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSE5sRmlkR05zYWkxelNHWjRhVWhPWm5ocldWRRAB",
            "text": "Food was delicious like always."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNGIxQlVkR05YWkZOTlgyUjVTakJLWVdRMVRYYxAB",
            "text": "Mac was on point. Catfish was enormous. Greens were really, really good. My only complaint is they have no diet soda at all. Besides that the vibe is a vibe. Really enjoyed our time there and will be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNFUzbFNVSEkwY1V3dFoxa3daVzVtWmpKck1uYxAB",
            "text": "I will never eat out of this place again the  Customer service suck I came this  think this nice place to. No never ever again I drive from up town Bronx 223 waste my time and  gas."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV2NVa3pSVmhJV2poVloycDRjMUpIVGpsWVIzYxAB",
            "text": "So, I went to the Lighthouse Fish house, I saw the review on TikTok! The food was delicious! I had the shrimp and catfish, with Collard greens and Mac n cheese. Sorry no pics I ate it all!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUFdIZG1NM0IzVWpNemVIWk9jbkZRT0ZOSVkwRRAB",
            "text": "Just no!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS1VtTlJTbEpyU25SdlNHSnVhRXR4ZUV3elRHYxAB",
            "text": "I like lighthouse, they chicken & yams go crazy. I wish they delivered"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweVN6aHdiMUk1UkRGbVJDMXZia3Q2TVdNeVkzYxAB",
            "text": "Good food, delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclVtaEJlRTl5WmpoaFJEZzRiVTVWYUVKMVJHYxAB",
            "text": "I just went there the Rasta pasta salty so I was able to substitute for fried whiting which were yummy. The greens and yams tasted like grandma's. The server Jonathan was very very customer service oriented he was good. But what I didn't understand is you had to pay cash get the money from the ATM because they're POS system was down? Because they had no internet but the same thing should apply to the ATM machine no?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQlQxUk5VVmM0YW5wNVdUYzJNVzU0Vm5VeFRGRRAB",
            "text": "Absolutely worth the hype! I ordered the seafood platter and was blown away—everything was seasoned to perfection, from the shrimp and mussels to the crab legs and lobster tail. The sides? Next level. The mac & cheese and collard greens were so good I almost forgot about the main dish 😅.\n\nThe portions are huge for the price, and the food came out hot and fresh. You can tell they put love into every plate. Staff was friendly and the vibe inside was chill and welcoming.\n\nIf you’re craving flavorful, soulful seafood—this spot is it. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd2RGaGxWWE5LZEZacVUxbHRSMFZLZUdoNWJrRRAB",
            "text": "Food is good. Fried Lobster Tail was delicious. A lil pricey. This particular restaurant really needs to work on their service. One server one hostess."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMmRFc3paSHBHUVVaVGEzRXpUV0ZSVDJSWGFrRRAB",
            "text": "Shrimp"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRWNEZzJNMkl0YmxZeGJuUk5Sa1Y0YUdaVVNHYxAB",
            "text": "The fish was okay, mac and cheese was good and yams are also good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodFFUUmphbDlpZFdKeFVXZHNPR2hrZURGVlptYxAB",
            "text": "It's a great place to have a gathering with family and friends lovely atmosphere and the staff are welcoming 🙏"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NElUMWdBRRAB",
            "text": "The food was tasty. I would avoid going during their busy time which is late evenings, you need cash they don't take cards which is something they need to tell you. They ask if you want smoking or a non-smoking area and they have an upstairs and atm inside as well, but I would recommend bringing cash with you. Definitely recommend making reservations or the wait can be a bit. Let the hostess know you have a reservation so you don't stand online you just sit and wait to be called. They offer tap and bottled water for a fee. DJ is great, a lot of food varieties, staff checks in, and if busy they switch off but explain what's going on if you get another server or waitress or waiter there informative. Gratuity was added to my evening party of three it was 20%."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUlXRkxREAE",
            "text": "The food at the lighthouse was not great. The salmon stuffed crab was cooked well but didn't have any flavor. The crab had a fried crust on top and placed on the salmon. The lobster fries were just ok. The shrimp was fried well. They were the best of the meal. The service never asked if we needed any more water or drinks. The gratitude was added to the bill for little to no service. If you are looking for a place for great pics and drinks. This is the place for you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOFpqWEh3EAE",
            "text": "MY FIRST TIME AT THE LOUNGE AREA.. I work around the corner and I will be coming often. Wish they had happy hour though ! I had DON SUNRISE 10/10 I was a little blasted . My co workers ordered shrimp & salmon bites I didn’t order any appetizers because I’ve had majority of the stuff from the last location 131. Jonathan was very sweet and kind and checked on us more than once. He also brought out the hookah for us cause the hookah guy took a little while I’m assuming he was busy.  Food upgraded a lot here compared to before I will say. Calm vibes came around 4-6p not packed ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbzhpMk9BEAE",
            "text": "*Do Not dine here! Unaware of this establishment being CASH ONLY until we received the $239 bill for 2. Extra fees and Automatic gratuity added to bill with the least service provided. Found long black Hair in collard greens. Spoke to management about removing gratuity (which she agreed to) then sent back the server to explain he would only be taking off the price of the greens.  Long wait for food. Wings and Drinks were ok. Nice seating area.but lights could be changed to see the food better. It was my moms birthday.. no one sung happy birthday. Not worth the price AT ALL! Orlando was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbmVXYWpRRRAB",
            "text": "Came here because of a post I saw on IG. Atmosphere in the back was cute, with the balloons in the ceiling and the wall lighting. We came here for a birthday celebration and I must say the lay out is a little weird. The front was takeout and for that reason had me question what the dine in section would look like. Our server was nice who stated he was the assistant manager. Not sure if that was true because he wasn't well equipped to describe the items on the menu. The food was good, but not great. I liked the loaded lobster fries, the lobster Mac, (well seasoned) and the fried fish. The calamari was also good.  The drink I ordered was strong and for me the prices were reasonable as one plate can be shared in my opinion. They are a CASH only establishment. When I ask why they said because people are not honest and order a lot of food then call their card company and say it wasn't them. Also don't expect a quiet, classy dining experience.  This is not that kind of place. My drinks came in a plastic cup. Over all the visit wasn't bad. Just not my atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNmZxZlVnEAE",
            "text": "I love the lighthouse! To good is always on point! The drinks are mid sometimes. But it you tell them to make your drink a certain way, they will. The service is a 3/5, but they are polite, so it's not bad. Overall, its a great place to hang out and eat! The atmosphere and decor are always so nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINXNMRVN3EAE",
            "text": "I just visited this location for the first time. My mom has been mentioning this place to me for sometime. She decided to host an event here so i finally got to experience it for myself.\n\nThis place is GREAT. The staff is nothing short of amazing. Jonathan is one of the waiters and he was extremely accommodating and nice.\n\nFrom the front, this place is quite deceiving. You think its a traditional seafood market but in the back, its a full restaurant, with an amazing ambiance. The decor is beautiful. The space in the back is quite spacious. It also looks like they have an event room that you can potentially book for a private party which is awesome. What i appreciate most about this place is that its a casual spot. You can dress up or down. It's such a laid back vibe.\n\nThe DJ was on point. We visited on a Wednesday and the music was lit. He put on so many jams, my mom and her friends were so happy. I can see multiple age groups loving the vibe here, anyone from 25 to 70.\n\nThe menu is pretty large and caters to alot of people. Since my mom was hosting a party, she opted for the $60 per person menu. It included a appetizer and entree. The food was on point. I have nothing bad to say here. We had a mix of items but they included, shrimp empanadas, chicken empanadas, chicken wings, salmon, shrimp, fried fish, collard greens, mac and cheese, candied yams and cabbage. Literally everything was delicious. The greens were so flavorful and did include smoked meat. The mac was creamy and cheesy. The empanadas were delicious, especially the shrimp one. The fish and shrimp were fried to perfection and tasty. The salmon was nice big filets, it was juicy and tasty. When the meals came, everyone was silent. The food stole the show for those few minutes. We brought our own cake which the staff in the restaurant was aokay with. They provided us with extra plates to serve it. They use plastic plates, cups and utensils here. Honestly, im not mad at it. It keeps there food prices lower and helps keep the service faster. I am not mad at it. My mom preordered two containers of shirley temple and one pitcher of tequila punch, it was blue. The pitchers are the WORST. That was my only complaint. We spilled most of the drink, trying to fill a cup. They need to put the drinks into different containers, those pitchers are not it.\n\nAfter cutting the cake, the staff surprised my mom with sparklers, a sign that said \"shine the light on em\", a bottle of champagne. They did a phenomenal job of making her feel amazing. Since my mom visits there often, they knew her and know she just survived open heart surgery. They made it their business to make this event special for her. I am beyond appreciative of them for this gesture. She cried for like 10 minutes. This was a beautiful surprise to end the evening.\n\nOverall this place is amazing. My family and i are already discussing the next event we will be hosting here. I cannot wait. If you havent come here, make it your business to stop by and dine IN. Ask for Jonathan."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS1hpYW15Z19QTlVBEAE",
            "text": "A great way to enjoy my time New York for the start of Gemini season.  The food was amazing, great portion sizes, and the service was on point."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybWVXYzBBRRAB",
            "text": "Great food! Everything was exceptional! We had fried catfish, salmon croquetes, collard greens and mac&cheese. They were as good as we've had at any venue both uptown or in Brooklyn!\nThere was a nice atmosphere, with a DJ providing the music.\nThey have take-out in front and a dining room in the rear. The dining room appears to double as a party venue.\nA good time was had by all in attendance.\n***They don't take credit cards. They add a 20% service charge to the bill (so your tip is covered)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdko3SkJnEAE",
            "text": "Great food! Great service! Great music! I had the Rasta shrimp pasta and jerk wings! My husband had the jerk chicken Mac n cheese! Yum! We are from New Orleans, so we know good food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbWVpR1FnEAE",
            "text": "I’ve been waiting to get here for some years and finally had the chance to go over Valentine’s day weekend.\n\nFor starters when first walking in to be seated the hosts was very polite…(thank you) and the decor was beautiful. Now I can’t say the same about our waitress she seemed very annoyed and every time I asked a question she kept using this hand gesture as if she wanted me to speed up my question so she can move on which I thought was a lil rude…I wish I knew her name but she never introduced herself when she came to our table she just didn’t have a good attitude.\n\nSo, moving on to the food it wasn’t the best I’ve had it was ok…we ordered the $15 6pc wing appetizer but for some reason they brought out 4 🤔 not sure why bc no where on the menu it said 4 wings but anyway the waiter fixed it and came out with 2 more wings…my collards tasted burnt and my mac n chz was nothing to rave about it wasn’t seasoned it was just a bunch of black pepper and a lot of Gouda chz simple mac I guess with no taste (my opinion)… but that drank my drink was good I had the rum punch and it was surprisingly good. Last but not least the DJ he had me moving and grooving so that kinda took away from the rude service and bland mac n chz.\n\nMy first impression wasn’t what I was expecting of this place but that’s not going to stop me from going back I’ve seen a few other things on the menu I wanted to try so I’ll be definitely going back and hopefully I’ll have a better update soon."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOE4zc1N3EAE",
            "text": "I recently visited lighthouse fish market, hoping for a pleasant dining experience, but unfortunately, it turned into a nightmare. The wait time was excessively long, which initially tested my patience. However, the real issues arose when it came time to settle the bill. Despite their signage indicating that they accept cards, I was informed that I could only pay in cash. This felt like a scam, especially since I had noticed other customers paying with cards without any issue. When I asked for clarification, the waiter I dealt with was not only unhelpful but downright rude. His dismissive attitude embarrassed me in front of other diners, making me feel belittled.\nThings escalated further when I requested to step out to get cash from a nearby ATM. The security personnel intervened and threatened me, creating a hostile environment that no diner should have to endure. I felt unsafe and harassed, rather than welcomed and catered to.\nOverall, my experience was deeply disappointing. The combination of long waits, questionable payment practices, rude staff, and aggressive security left a bitter taste that overshadowed any potential enjoyment of the meal. I cannot recommend this establishment to anyone looking for a pleasant dining experience. Please be aware of the waiter added in the photo. His name is Jonathan S 580E 117th st New York 10035."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0M3JITGpBRRAB",
            "text": "One thing that I really liked was that the seating area gave me lounge vibes. I visited around 12:30 PM and it was pretty empty on a Saturday. I appreciated that because I really didn't wanna be around a crowd. We ordered so much food! My favorite was definitely the Rasta pasta. I would definitely recommend this because it was the right level of spicy and creamy. The portion size is huge so much that we ended up having to share it. The lobster mac & cheese and fried shrimp were also pretty good. For drinks, I would recommend the rum punch and the margarita. If you like a strong margarita on the rocks, this is the right choice for you. You can choose different flavors like passionfruit and mango. You can also request for the drinks to not be super strong and it'll still taste good. The music is on point and the waiters were attentive and helpful. Definitely a great seafood spot to check out for drinks, food and vibes. I want to go on a Friday night to see what the energy is like."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeVBuUzVBRRAB",
            "text": "My first time here and the place looks clean. Decorations are nice and pleasant to look at. The food was delicious. They also have fruit punch and different flavors. They also have a space for a birthday/accomplishment celebration with reservations. Update 2024: The kitchen makes this business. The food is delicious if you don't need fancy plates and utensils, plastic utensils, and fingers are fine. Staff are also attentive to customers. Cash Only, they have an ATM machine at the front of the restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUU1VSklOMHd6WVdKV1JEQlVSMWRKYlRsUlNuYxAB",
            "text": "The food was excellent.  The service was great.  The atmosphere was not so good. It was too cold where we were seated. Next time l go, I will request seats in a warmer section. Oh, and they only take cash. Not good.   l had to use the ATM, which is something I would prefer not to do."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1N3J6NjRBRRAB",
            "text": "Surprisingly the food here is Amazing, and the layout was lovely and fun. The ballon’s on the ceiling and the wall signage were a nice touch. However the service was poor. Meals and drinks were mixed up or forgotten despite multiple asks and reminders, and the food took almost an hour to come out. Tasting the meals it was worth the wait though. The prices were a bit high and the drink menu limited. Reminiscent of a little dive bar. Also it’s worth it to point out they do not take credit cards; for those prices this breeds an air of sketchiness. Overall our little celebration turned out ok in the end and they did try and as stated the food was Amazing!\nI think this place would do well with a bit of staff training and some touch up. Regardless I would definitely recommend this restaurant/lounge to anyone looking for a tasty bite to eat and I will definitely be returning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndWZuTTBnRRAB",
            "text": "Went after work on a Tuesday. Was basically empty. This place is a dine in or take out. It has party rooms. The main dining area had abt 8 booths for seating. Each booth seats 4-5 comfortably. 5 tables seating two comfortably. And a small bar with abt 4 stools. I believe they usually have a DJ playing music but not today. Food was delicious. Yams, shrimps, cat fish, wings were all SLAMMIN! The mac n cheese was MEEEEHHH at best. Their cake was MEEEHHHH at best. Overall good place. I would recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoa2RyUFR3EAE",
            "text": "We discovered this treasure in Harlem pre-Covid, but always ordered to go. After dining in for the Seafood Platter, a public review was the next, most logical step. Take it from a Floridian Peach... this place is the truth!!! I found myself almost speechless, hugging nearly everyone involved in the preparation of our meal.\n\nOur personal favorites are the crab cake dinner w/cabbage & mac, fried catfish dinner w/collard greens & mash, honey zing wingettes, loaded lobster fries, potato salad and our new favorite, the Seafood Platter! The prices are totally reasonable, especially considering how much food you get!\n\nIn addition to the amazing food, there is a dining area in the back, leading to a beautiful room next door for special events. The owner is kind and hands-on, ensuring everyone has a great time.\n\nIt would be a mistake to pass by and not try. True, different cooks and staff on different days make for different experiences, but there has been more consistency lately, and we are always warmly greeted. Any mistakes with our orders were rectified, with an apology.\n\nIf you haven't tried Lighthouse more than once, you are TRULY missing out! My only regret is not trying it sooner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLWQtbEhnEAE",
            "text": "The food was delicious (catfish was a little dry).  But everything else was good.   The servers were very courteous and welcoming.   The way things were served, I wasn't too happy with.   They do things differently there.  You order your food, get a number, and find a table.   Sounds simple enough, right?    But it's not, a few times, there brought someone else food to our table.  During these times (Covid), that wasn't cool.    I had to ask a few times for stuff that was missing from my order.   So in all, as I said before, the food was delicious, and the service needs adjustments."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaDl2T21RRRAB",
            "text": "I was greeted at the entrance door by a club looking security guard at Lighthouse Fish Market on East 117th St. in Harlem.\nI was quickly ask to go or dine in. As I said I will dine in I was guided towards the back of Lighthouse The gentleman also informed me the restaurant is cash only and pointed behind to the ATM machine. Information is so very important. As I walk to be seated I see the bar on the far back wall with 3 patrons sitting at the bar counter and watching the 3 big screen tv's above the bar back wall watching several NBA games having drinks and smoking hookah enjoying there evening. I was seated on the left was at a 4 person table in front of the bar right before the opened door way to another room which sounded like the party room with the music playing that sounded like a live DJ was in there and he was rocking. So this is a fact about myself I do not touch food with my hands. A project man since the 80's I am strictly knife & fork. So I did not order crab legs or any other seafood I would have to pickup. I went with the boneless flounder fried and laid to the side, sweet potatoes, macaroni salad. It was deeeeeeeelicious.\nAnd I washed it down with a glass of fresh ice water. I was served and assisted by more than just my very pretty waitress. Here comes the stand out part of the evening for me I simply drank all the water in my glass. I asked pretty for a refill of my water she walk by the bar told my request to bartender and walked into the party room. I continued to enjoy my dinner and the bartender comes to my table when with a slim maybe 1 liter glass bottle of water and fills my glass of water and leaves the bottle on my table for the win.\nLighthouse Fish Market served me top to bottom I will definitely be going back in 2024."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmJTRVFREAE",
            "text": "My first time there and the vybe was perfect. Calm yet lively. The customer service was the best I've experienced in a while from the moment we walked in and I frequent different restaurants. Servers were happy to serve, cooks all had smiles. Music was great, not too loud where you can't hear yourself speak but loud enough to truly enjoy! And the best part was the food. OMG!!! FROM THE LOBSTER MACNCHEESE TO THE CATFISH... PERFECTLY COOKED AND AMAZING!!! I will definitely be back. Sooner than later!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbjREa0lBEAE",
            "text": "The food here was absolutely superb. The server, Shavonne, was friendly professional and got our order perfect. The food was seasoned to perfection. Just the right amount of crispiness. Ummm ummm ummm. I will travel from Florida to eat here…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ODZTN29nRRAB",
            "text": "Customer service 2/10: My husband and I ordered wings and was not offered/given any plates. I asked the waitress for blue cheese and never received it. However, one of the other staff members bought us ONE single blue cheese for 10 pcs…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z05yM2RnEAE",
            "text": "*COLLARD GREENS!!!**\nI stopped by Lighthouse after a Costco run and ordered catfish strips, mac and cheese, potato salad, and collard greens. I took a chance on the collard greens, despite usually hating when restaurants leave too much stem just to stretch the product. Luckily, this wasn’t the case here!\n\nNormally, I only get the fish sandwich (cue Rahkim’s voice: \"Fish, which is my favorite dish!\") but during my last visit, I saw a woman order several sides of collard greens. She mentioned that whenever she's in town, she stocks up and freezes them. Now, I totally get it! The earthy texture and the flavor of the pot liquor are divine. I wish I had a piece of cornbread to go with it!\n\nThe potato salad was just as delicious, with a perfect hint of sweetness. And combined with the creamy mac and cheese and a generous serving of catfish, I’m over here doing my happy dance. This meal truly hit the spot! 💜💃"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa3BtV09BEAE",
            "text": "What can I say?? This place has it all!!! Seafood AND soul food all in one spot is everything to me!!!\nI tried the seafood empanadas for the first time and I am so glad I did !! They were crispy on the outside but moist and steaming hot inside with mucho flavor !!!\nOf course I came for the humongous crab legs shrimp and scallops but was surprised to see the Henny Mac and cheese advertised and knew I had to try it !!\nSo glad I did! I got to choose between shrimp or chicken. Of course I chose shrimp. It was amazing. It was enough for an entrée alone. It had just the right cake of Hennessy flavor. I would love to have the recipe lol.\nof course, the seafood was perfection as usual, and I believe they have the best collar greens in town. As some other restaurants are a little too salty. These are just right. .\nThey are homemade iced tea is also perfection and I tried the banana pudding cake for the first time I will be back for more one of the pluses of this place is that you can park in the plaza parking lot next-door at the plaza and it’s very affordable. I love it here !! Its a must visit for anyone that loves seafood or soul food or both!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOFlDZHFBRRAB",
            "text": "Had an amazing night at this spot! The vibe was perfect—chill lighting, great music, and an overall welcoming atmosphere. The drinks were strong and well-made, and the hookah was smooth with a nice variety of flavors to choose from.\n\nWhat really made the experience stand out was our server, Jonathan. He was super attentive, friendly, and made sure we had everything we needed without ever being overbearing. You can tell he genuinely cares about giving great service, and his recommendations were on point!\n\nDefinitely coming back soon—this place is a whole vibe, and Jonathan made it even better. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbE1ISkRWVlZHVkU5eFEyMHRZV1p3VTFsZlUwRRAB",
            "text": "With reservations, there was still a 35 minute wait in a tiny a tiny waiting area, that doubles as a take-out counter. Once seated, the server was slow to come and things seemed a bit unorganized initially. With that being said, EVERYTHING ELSE -from the drinks, to the food, to the DJ,  and Hookah were on point! The portions were a good size and the snapper and shrimp, collard greens, macaroni and cheese was absolutely delicious! Harlem Lighthouse Fish Market, you did that! When I come back to New York, I'll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmZYRjBnRRAB",
            "text": "Little bit of a wait, but worth it. The food was amazing, the shrimp were crispy and crunchy but not over seasoned and cooked perfectly. The Mac and Cheese was cheesy and seasoned to perfection. I also had the jerk wings which were crunchy and juicy, while having a lot of sauce, the candied yams tasted like someone’s grandma made them. A birthday well spent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycXV2aXB3RRAB",
            "text": "I just recently went to this restaurant for my best friend’s birthday party. The food was good; however, I was unable to enjoy the dining experience. I was given plastic forks and knives to eat with. When asked about why I was given plastic forks and knife’s, the waiter/Server/manager gave me a poor excuse… The vibes was okay, there’s really no one in the restaurant on a Friday night. Overall, I would give this establishment 3.5. The food is good, but I had to enjoy it in my house. I would not recommend this spot if I have to pay a gratuity/service fee and I am not even eating with silverware. Based off vibe and representation, it was a vibe that I could have created myself in the house. Nothing Spectacular!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LXFEQWJnEAE",
            "text": "We came for mother's day dinner. The food was fresh and amazing. The service was wonderful. Drinks are strong. For a Monday night they had a DJ and fun vibe. They have plenty of sitting. And fun decor. My only complaint was the music was so…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzc0pyUXBRRRAB",
            "text": "Do not go here!!! Please save your time and money and go somewhere.\n\nThe music is way too loud and they will turn it up louder and louder. It was already really loud when we came in and we were trying to have a conversation. We asked if it could be turned down a little bit and the server said there are some people who want it turned up. The whole time he would wait on us and he couldn’t hear us and kept saying huh. There was a DJ on the other side of the restaurant\n\nWhen we went they were only taking cash and automatically added in gratuity for 3 people. The service wasn’t worth it at all. Then at the end the guy asked if we wanted our change despite already having charged us a dine in fee. The bill came and it was under $100. Then they charged us the fee along with tax which brought the bill over $100. Mind you it’s 3 people and we only got entrees and non alcoholic drinks.\n\nThe server gave me the wrong sides and when I asked for the correct one he looked at me and asked if I wanted to order an additional side. He got an attitude when I asked for what I ordered.\n\nThe food was not worth ANYTHING. Earlier in the year when my friends when everything was cheaper. Everything has increased drastically. The fish still had the fins and everything. When I asked the server why he said it’s mainly for presentation. That doesn’t explain having fins when it’s supposed to be a fried fillet. The fish was hollow too.\n\nNone of the people in my party of 3 were satisfied with anything and it was honestly a subpar experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNMZ3JkUBAB",
            "text": "The Shrimp Patty from Lighthouse Fish Market Harlem is an absolute delight. During a quick visit, I had limited time to sit down and eat. However, my friend kindly bought me a piping hot shrimp patty straight from the bustling kitchen. Despite wearing silk, I couldn't resist taking a bite and relishing its exquisite flavors. Even though it squirted onto my clothes, I didn't mind. My priority was to fully enjoy the patty before it cooled down."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVJrMUhjVzUzYjBaaFZXdFBhWFZVYjNoU2VIYxAB",
            "text": "Came here for my sisters grad dinner. We had the pleasure of having Jonathan take care of us. Was super nice and funny. Food was great and portions were pretty large. Would def return!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OVBmOTRnRRAB",
            "text": "So I came here for my Birthday on March 10th, 2024 with my significant other, ONLY because I kept seeing the advertisement on Instagram. I thought that everything looked great from the photos and videos I saw, but honestly it was straight up false advertising. When we first entered, there were so many people waiting around, so I was confused on waiting as well or going in further. I later found out that they were waiting for take out. Then they tried it when they wanted to put us in an aisle seat, I was like definitely not, so they gave us the seat in the back with one wobbley table, but none the less that did not bother me too much since the room had \"Happy Birthday\" on the walls and it was my Birthday.\n\nThey brought the water out in PLASTIC cups and I immediately thought to myself that the drinks are also going to be in plastic cups as well, andd they were. Not to forget that they gave us plastic forks as well with our meal (smh). I have never gone to a restaurant where they serve with plastic utensils and cups. We ordered the henny colada which was not bad. We got the seared lobster which tasted really great because it was well seasoned, we also got the snow crab legs which was extremely salty, I could not eat it, and yellow rice which was good too.\n\nIn order to get \"Happy Birthday\" sang to me (like EVERY OTHER RESTAURANT DOES) we were told we would have to PAY $60 #SMH. There was a live DJ in the same room close to our seat, which was extremely loud that the waiters could not even hear what you wanted to order and vice versa. They are a CASH ONLY restaurant, no cards. The bill was about $100+ but then with the included gratuity, it was well over $200+. Usually when we go to restaurants, for a bill like that we receive a lot of food and our table is always full.\n\nLastly, I was really disappointed because it was my Birthday and I am usually on point when choosing restaurants. My significant other and I dressed up only to find out that the restaurant was nowhere near upscale, we felt out of place there and contemplated to cancel the food we ordered and go elsewhere. It is a black owned restaurant (I think) and some of us try to support and not stereotype, but when there are so many red flags, you can't help but NOT to support."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUE1XY3pOMFJxTTI1NGVqZEljelUyYW0xSE9GRRAB",
            "text": "I made a reservation for 9pm, they did not tell me it would be a $100 per person pre fixed menu. That’s the first issue. Someone in our party had a shellfish allergy and they said they will give her the $60 pre fixed menu that had other options on it, that never happened and then they claimed to not have said it.\nFast forward to 9:10pm they said our table was ready and had been ready since before w even got there but we were waiting on 3 more ppl to arrive so they made us stand in the front.\nAbout 9:17 the remaining 3 people arrived and we were guided through the entire place to a top floor with no music, no chairs, just a couch and a low floor table, when asked how were we supposed to eat like that they said we can have a table downstairs. So they take us back downstairs to the table that was supposedly for us originally but the table was dirty, they said give them 2 minutes to clean it and they stood us in the middle of the restaurant where the servers were constantly trying to pass to be able to serve the guest. Around 9:45pm still no table so they gave us a complementary shot. By 10:15ish they had a table for us, but the table didn’t accommodate the size of my party and it also was dirty, the guy Johnathan starts cleaning the time while we stand there and I said how is it that the 2 minute wait to clean out table turn into almost an hour and the table still wasn’t clean, he responded in just trying to get you guys a seat if you want I can put yall back over there and yall can continue to wait. I stated there was no need to be rude or nasty at all especially when it’s not our fault. Then there was a table that one lady said we can sit at that would accommodate us because that table didn’t but a guy told us we couldn’t (he claimed he was the manager) . Then they offer us the table behind us because they were making the people that were sitting there move to a back table since they were only drinking and smoking. Once they were fully moved Johnathan proceeds to sit a different group of people at the table they just told us was ours. So the lady from the front came and was like what are you doing I told them these tables are for them, he then separates the tables and put us at the end portion. So now we are finally seated around 10:35/40. Apart of the $100 per person was 90 minutes unlimited punches, we at one point I ask Jonathan to fill our drinks bottles because they were empty and his response was well y’all still have drinks in yall cups that are in the table, I asked what that had to do with anything, it’s 90 minutes unlimited punches so regardless what’s in our cups the bottles are empty. He had an attitude but then he went to fill up one of them instead of both. Now it’s 11:00 and we haven’t gotten any food any appetizers nothing.\nSo we start asking about our food, finally 11:15 appetizers come out. Then they start to bring our food out at 11:35 with to go boxes talking about they are closing, and that they stayed extra time to accommodate us!\nHow did they accommodate us when they made us wait for so long, change our seat 4 times, and then bought our food out and kicked us out at the same time.\nAnd we still paid in full when we shouldn’t have paid shit because we weren’t even sitting for 90 minutes to eat, drink and enjoy our time !\nI really do not recommend this place at all, they are rude, they lie and no one takes accountability. They messed up big time! I would never again go to this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdjhMOWlRRRAB",
            "text": "My Friend had her 44th Birthday party here in the far back party room 8/11 The space was dark and also housed the DJ. There was a older man with braids seated next to the DJ booth with his sneaker off cat calling flirting and yelling loudly for about an hour trying to engage with us, a party of 16 women. It was horrible.\n\nThe waiter messed up just about every order.  I'm allergic to seafood and told the waiter and they bought my chicken to me with shrimp, I Immediately went through my purse to make sure I had my epipen. They took the food away and replaced it but by then I was scared.\n\nWe had to go out to find staff for napkins. Service was terrible, they forgot appetizers, it took an hour to get the drinks we ordered. My friend made the best of her party, she's a queen and handled all the party issues gracefully with a smile."
        }
    ],
    "reviews_count": 86
}