{
    "name": "Bangklyn East Harlem",
    "place_id": "ChIJTyJcPgL2wokRUDyFSCn0xag",
    "grid": "MN11",
    "address": "2051 2nd Ave, New York, NY 10029, USA",
    "rating": 4.7,
    "user_ratings_total": 276,
    "phone_number": "(646) 429-8128",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd1IwRkZTbkI1V2s5WWREZDBTa3N3UjBoMGIxRRAB",
            "text": "Best Thai food I've ever had! One man, Pat, does it all: the cooking, bussing, cashiering... This man knows how to combine flavors!! He also plays great music and sells from a small collection of uncommon vintage clothing.  There are only four tables, making Bangklyn a true hidden gem."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVFsZDRWVzh3TW1obmFXVm5jMjFCV0RCRE1HYxAB",
            "text": "Simply the best. Trust Pat's recommendations."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRWFGOUViVTVsVFdaUWJUbEdTV2RzVjJsNWIxRRAB",
            "text": "I got the fried chicken pad Thai. The fried chicken tasted incredible!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWVgyTm1iWGhXU0RsWlpXbHlWMDh3YW0xbWRHYxAB",
            "text": "Bangklyn is one of Harlems’s quiet gems - casual, intimate and creative space. The spring rolls were crisp and golden, chicken was tender and marinated with intention. Pad Thai was well balanced, crushed peanuts give it the perfect texture. Highly recommend ✅"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NlYzWnpja0Z6UVV0RFlYSlJZbnByVnpkbFUwRRAB",
            "text": "Incredible depth of flavor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeGQycG9RVlZoVmsxdFJHbEhXbEpOU1ZocFIxRRAB",
            "text": "Great food, great venue, great music"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTlN5MU1VMGR3U1dwUlFYcFRhekU1Y1hkWGFHYxAB",
            "text": "Absolutely phenomenal, will be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONlZFNVBUVGx2YjI1M1lXYzJkRXhUYkhaRVZVRRAB",
            "text": "This place is my fav Thai restaurant in town it was my first visit and can’t wait to come back beats every other place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1RFWnJTblZUVlhSR1EzWlRNbVJvZVRaMk5uYxAB",
            "text": "Bangklyn is a breath of fresh air in a city full of fast casual pop ups.\n\nOther have commented how authentic the food is. I am neither Thai, nor have I ever been to Thailand, but the food here tastes like what I imagine a home cooked meal would be like. I had the morning noodles and they were fantastic!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFVFUkhUbk52VUhodWNVcGhkbms1WW1sU2FuYxAB",
            "text": "I know  when you see this place you'll be ready to walk out lol but trust the reviews the food is really good. My fav is the curry tamarind noodles super good. You won't be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmJtSlpMVUpYVW1vdFpqaEpZWHB2VWxobldGRRAB",
            "text": "This Thai spot is consistently amazing. The food comes out super fast, and it’s always packed with flavor.\nThere’s only one chef running the whole place—he handles both the kitchen and front of house. He looks pretty serious, and I swear new customers always get a little intimidated by him 😅\nMy friends and I jokingly call him “the angry Thai chef” —but honestly, his cooking is beyond legit.\n\nThe dishes have real wok hei (that delicious smoky stir-fry flavor!), and everything is absolutely spot-on.\nSitting inside the restaurant felt like I was instantly transported back to Bangkok—same taste, same music, same vibe.\nThe decor is kind of retro, and you can tell the chef put a lot of heart into the place. He seems like someone with a lot of stories, quietly taking care of his little hidden gem.\n\nYou have to give this place a try. Don’t be scared off by his serious face—he’s a genius in the kitchen.\n\nHighly recommend the chicken rice bowl—it comes with a side of soup too.\nJust a heads-up: the Thai iced tea doesn’t come with milk and is super sweet, so order with caution 😄\nBut overall, this place is full of charm. If you take your time and really savor the food, it’s basically like taking a quick trip to Bangkok without leaving town 🇹🇭💛"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc1YxSkdTa2xXWVhwcVVERnRjbll3ZUdnd2QxRRAB",
            "text": "Sunday evening 6.15pm, traveled all the way to the restaurant just to find that it’s closed when the info on the website and google says it’s open. I was rlly looking forward but this ruined my day. Very unprofessional and wasted of my time. Truly disappointing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN3Q3dW5aZ2EzS3lnRRAB",
            "text": "Absolutely try this place! It’s a one-man show, so you will need to seat yourself and grab menus, but the food is mind-blowing! We tried the Kari with crab meat, morning market noodles with chicken, and fried spring rolls, and everything was flavorful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbFRHTlFUVGwxU0dnMmIxTjJlSE4xWDA5dlduYxAB",
            "text": "Good food, good chef,  very satisfied enjoy myself 👍 affordable and lots of bang for your buck"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJalQ4N25OMV9xT0ZREAE",
            "text": "One of the few genuinely cool and interesting casual spots in the neighborhood with good food. Recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNV0dxLVR2cXNpMUdREAE",
            "text": "This is some good Thai food. It’s not going to taste like your average Thai spot because this guy is serious about his ingredients. Can’t wait to eat again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSDY3dld5akliUHdnRRAB",
            "text": "Great food run by a local Thai with an authentic feel. Price is incredible, I recommend eating there as opposed to the to-go option."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdW83aHlBRRAB",
            "text": "The best."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvczhMWmRnEAE",
            "text": "Lovely food and a small, cute interior! Definitely recommend the tofu morning market noodles"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURJbC1FTxAB",
            "text": "I almost don't want to review this place because it's so good and I don't want it to be packed every time I go but it's honestly too good not to give it the five stars it deserves. The food is exceptional (Great vegan options like tofu steak/tofu pad Thai) and the vibe of the place is great. (Good music/art on the walls)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJek5idW9BRRAB",
            "text": "We decided to try this place since it is ranked #13 restaurants in East Harlem.  We are pleasantly surprised to eat an authentic flavorful Thai food. We had shrimp pad Thai, crab meat pad Thai and spring rolls. They are full of large shrimps and crab meats.\n\nWe will definitely come again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeU96RlJREAE",
            "text": "10/10 one of the best restaurants in New York City. Great vegan options too. The khao mun and coconut tamarind noodles are so delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncDUzZWV3EAE",
            "text": "From the decor to the food itself this was one of the best dining experiences I’ve ever had in NYC."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3BiVzl3RRAB",
            "text": "WOW—last night, I had to have some Thai.  My body was craving for some Green Curry. Some Papaya salad.  I had the need… 😌\n\nGoogle said Bangklyn, 🤔. I never heard of it before. I checked the reviews—authentic, bold, truly Thai. That’s all the review I needed\n\nYummmmm, It was 😊. Absolutely amazing.\n🔥 Incredible chef-owner\n🔥 Huge plates, even bigger flavors\n🔥 Green curry with crab meat 🦀\n🔥 Som Tam with fresh papaya 🥗\n\nThis place is a must-visit. A true hidden gem 💎"
        },
        {
            "date": "8달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc0ticFBBEAE",
            "text": "Très bons pad Thai. Un délice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdEwzV0V3EAE",
            "text": "Amazing!!! If you love Thailand and Thai food this place is the best. I got the shrimp pad Thai and it was fantastic"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ2ZIODV3RRAB",
            "text": "One man show. The owner is the chef, server and cashier. Authentic Thai dishes. Great vibe. The type of place you want to do business with."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeTkzRGdBRRAB",
            "text": "Impressed my friends from Asia. Needless to say how good it was!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc2V5UWV3EAE",
            "text": "I’ve been following this restaurant for a while and reading the rave reviews here and in other food blogs. Finally made a trip, not too far from our place in UES. We happen to be the only party of four there, as the restaurant opened a short while back. Not describing the quirky character of the place; already well-described here. Besides the amazing food, what’s most striking to me is the absolute devotion of the chef to the art of cooking. Since the place was empty, we struck a bit of a conversation. All I heard from him is that he has been cooking alone for the past seven years for the simple reason that he gives his all to make the best possible food he can, and no hired help can / will do that. In the cut-throat world of New York restaurants where clicks and social media influence and more locations are everything, I’m glad that someone is still devoted to the old-fashioned principle of just cooking for the love of it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbktQLXR3RRAB",
            "text": "Food was excellent. Very cute experience. Nice and intimate. Only a few tables, come with a friend or date and you won’t regret it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OXFlV01BEAE",
            "text": "Came in, ordered, ate some delicious morning soup, paid, and kept coming back for other items on the menu. Top."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeS1LV2FREAE",
            "text": "As someone who grew up in Thailand, this place feels like a local corner diner with varieties of comfort food. The owner is really intentional about everything he does and offer the highest quality of meals without msg. Will def be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGFET1dnEAE",
            "text": "I always bring my friends who visit me. If I feel cold, I order the Khai Mun Gai or the Tamarind Coconut Milk Noodles. If I need something filling, I go for the pad thai or mild spicy basil fried rice with the best fried chicken and chili plum sauce. My late night go-to drink is hot black tea with condensed milk.\n\nMy friends always come back here and always adds it to their fave resto list. And thank you Pat, who runs the place, who always welcomes me and my friends with the best stories!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcV9tVDNnRRAB",
            "text": "My favorite restaurant!  I take everyone who visits me here!   The food is indescribable, real Thai food!  I have never had a bad meal at  Bangklyn.  Prices are more than reasonable, too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczhYS0RBEAE",
            "text": "Delicious and no frills!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIal9ma1VREAE",
            "text": "I loved the pad thai and tofu steak! I will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdVBlNjVBRRAB",
            "text": "What a weird, wonderful place. You feel like the guy cooking behind the counter must kind of hate you, but that's all part of the experience. The food is so flavorful and delicious, everything was high quality and done just right. I saw him behind the counter with a mortar and pestle and some lemongrass and other delicious things. He does things right. The fried chicken, like everyone says, is so yummy. I got to sample the morning noodles with tofu, the basil fried rice, and the red curry, and they were all so delicious. Definitely come here if you can, don't expect it quick or friendly but that's okay because it's how it is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X3ZqT0xREAE",
            "text": "Love this place!! Food is always amazing!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3a3NEcVN3EAE",
            "text": "food, service, atmosphere.. everything was amazing, and the vintage clothing selection is also worth the detour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cUxXbDRnRRAB",
            "text": "I can’t believe that this restaurant has existed the food and the vibe here make me feel miss my small town in Thailand feel like I’m home, All foods make through by chef inspiration and his passion is so strong and taste so good same as like your mom did. You must come and try, I try mushroom morning soup, fried cabbage, Kari Crab meat, Fried chicken also crab fried rice. Will definitely coming back and try everything on the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNia2FHLUdnEAE",
            "text": "order at the counter"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLV9QUmh3RRAB",
            "text": "the basil fried rice with fried chicken is so good get it extra spicy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydk9YRTFRRRAB",
            "text": "The food here is excellent!!! Flavors are terrific and the presentation is very good. Portions are decent. The prices are very reasonable for the quality. Definitely going back here and will take out on a regular basis."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycEsyRUt3EAE",
            "text": "loved the place and loved the food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeU9lNFlBEAE",
            "text": "Wow blown away best Thai food in the city for sure. Super quirky spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6b3A3Zy1RRRAB",
            "text": "Amazing fried chicken. Did not expect it in this unassuming Thai place"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjb0lEb3h3RRAB",
            "text": "Excellent food. Try it. Period.\n\nPost-pandemic now and the food is soooo good. Especially the pad Thai."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMk96bTNBRRAB",
            "text": "Food here is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaGR6ZU93EAE",
            "text": "wish i had some now"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bDZ1MFpREAE",
            "text": "They have the best fried chicken. I used to live in harlem, just went back today after 3 years and it's still the same. Cool decoration too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdkotX1NnEAE",
            "text": "Don’t expect a warm welcome when coming to this establishment but do expect banging food.\n\nIf you're looking for a restaurant that's pretty dope and kinda resembles a 3 bedroom walk up in Williamsburg where the residents are hipsters, this is it. A Southeast Asian comfort food joint called Bangklyn. This place looks like it's been plucked straight out of a hipster's brain - it's small, it's repurposed, and it's pretty cool.\n\nBut let's talk about the food.  The southern-style fried chicken is crispy, juicy, and nicely flavored. You'll want to write a love song to this chicken after just one bite. And the pad Thai? It's so on the money and delicious you’ll have a hard time not scarfing it down.\n\nBut perhaps the star of the show is the fried rice. I'm not sure what kind of black magic they use to make it taste so damn good, but I wouldn't be surprised if it involved sacrificing a few chickens to the culinary gods.\n\nOverall, Bangklyn is a gem of a restaurant. It's the kind of place you'll want to keep coming back to, even if it means risking getting trapped in a conversation with the resident hipster who's poetic about artisanal pickles. Trust me, it's worth it for the food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyd09URFVnEAE",
            "text": "Delicious home-made style Thai cuisine! The chef was a bit curt, but because he was busy with cooking and taking orders. Food was good and price was reasonable. Satisfying experience overall!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMzRINm1RRRAB",
            "text": "Amazing Thai food experience! The Pad Thai was delicious.\nTotally worth a visit if you're in east harlem and looking for something good and cheap to eat"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNy1TWk5nEAE",
            "text": "I don’t want anyone to know about this wonderful restaurant, because I fear once discovered I won’t be able to get in. All dishes prepared with soul and genius of experience. Decor is best of what people mean by eclectic, one of the tables…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdU5hYUxREAE",
            "text": "This is not your typical thai food. If you're interested in trying a different type of thai food, give this a try. The interior is not too big and brings an intimate setting.\n\nWe ordered the following:\n\nTeemeriand coconut milk noodle with crab meat. This was served with bowl of noodles and thin rice noodles and you pour your coconut milk with crab meat over the noodles. This was a good dish. I'm more a fan of the thicker rice noodles and not as much a fan of the larger noodles. The chef stop to us and said he can make the dishes to our liking. Next time I come back, I may ask if I can have a thicker noodle with the dish\n\nKhao Mun Gai - this is fresh chicken meat over rice. This is a simple dish. If you like rice and chicken give it a try. The rice was very good, and you have a few pieces of chicken to go with it.\n\nGreen curry - with eggplant, bamboo shoot basil, shrimp. This dish served with a bowl of curry and rice. Its your typical green curry.\n\nThis is a nice place, I'll definitely come back to try the other dishes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxNk5mSzBRRRAB",
            "text": "🍗 @bangklyn is East Harlem’s go-to Thai restaurant and vintage store. A modern interpretation of classic dishes by the coolest man in all of El Barrio, author of a fried chicken that always hits and owner of many, many fly fits. 10/10…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNWZ5TnNRRRAB",
            "text": "Was a bit skeptical about going in, but I’m sure glad I did. This place has amazing food with great decor, Pat is an awesome guy and an even better style ambassador/ chef.... I’ve made this place a go to and I surely recommend this place to anyone who’s looking for authentic Thai food or is looking for dope vintage clothing!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3d0wzOXRRRRAB",
            "text": "Sooo good! So authentic (per my friends that have been to Thailand). Get this: ONE cook/server/store owner/clothing store salesman (you’ll get it when you see inside) who cooked for our group of SEVEN in less than 15 minutes for lunch. Delicious, fast, cheap. We’ll be back! Can’t wait!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdG9XcGNREAE",
            "text": "Ordered takeout so hard to say how it might compare to dining in. The Pad Thai was good, if a little compartmentalized. The real winner is the fried chicken. Oh my goodness, that was tasty."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N3VQbEtnEAE",
            "text": "Streaming loud Thai/Khmer music, lots of spicy aromas, SE Asian logo'd clothings, mismatched furniture pieces, somewhat grumpy but helpful cook. Brings me back to Cambodia or Thailand! Lots of comfort foods you'd get at street / market stalls. Food is very spicy (heat and flavor) and not sugar-heavy like many Thai restaurants unfortunately like to do. Love the market noodle (a bit more greasy than I like but it's good) and the Khao Mun Gai (chicken rice). Thai iced tea is wonderful. As of Aug 2022, skip the Vietnamese coffee. I really love this place!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3cG9EbmF3EAE",
            "text": "Very small venue where they kitchen is the restaurant. They are clearly a young business still looking for an identity but the food is really worth a try. Many of their noodle dishes are served cold with a warm coconut milky broth added right before you begin eating."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVaHFHanZnRRAB",
            "text": "Baby cockroach!! Won’t come back, although the food was ok and the couple were very friendly. The place was small with only 4 tables, 2 big and 2 small. There was no service as the couple had to work in the kitchen, which I totally…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcjVqVURBEAE",
            "text": "Small place with nice vibe. Interestingly bangklyn is Bangkok + Brooklyn. As the caption says, it's no nonsense and easy food.  Pad Thai was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXN2VienVnRRAB",
            "text": "I love their vegan morning market noodle (mushrooms topped) it’s flavorful, savory and warm. Everyone I took to Bangklyn loves the dish as much as I do!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHX3MzNlRBEAE",
            "text": "My favorite Thai food in Harlem. The tamarind coconut milk noodles is amazing. If you like crab get it!! It's amazing with crab🦀…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKc1AzRWZnEAE",
            "text": "The little nook of a restaurant, the food is delicious and Pat, the cook, is very attentive to your specific orders. This restaurant inside is not big but this little nook of a restaurant is wonderful in food and service. Just to mention that inside the restaurant that are jackets and clothing with designs that artists have contributed to display"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5a3NQaHd3RRAB",
            "text": "Bangklyn is without a doubt one of the tastiest and most unique restaurants in the city. The food is amazing and fresh, especially the fried chicken. The owner/cook/busboy is awesome and even though he won't say much, he is kind when he does talk and he works really hard to serve the customer. As for the decor, is it a thrift shop? Is it just decoration? It's difficult to tell, but either way it's cool. Highly recommend."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNmNTanB3RRAB",
            "text": "Amazing food! Everything from the time we entered to when we left lived up to our expectations. Can't thank the owners enough for creating a great experience and we will be back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1amVlODZ3RRAB",
            "text": "Sitting at Bangklyn always makes me miss sitting at any number of stalls in Southeast Asia. The atmosphere, and flavors, bring so many pleasant memories rushing back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONHBhN2lnRRAB",
            "text": "I was really excited to try this from all the positive reviews, but ultimately found it pretty disappointing and unsanitary. The chef/owner never even said hi when entered, it was awkward, and I saw him handling the food with bare hands and dirt under fingernails… it grossed me out. The place could use a good cleaning overall. The fried chicken was good, but the pad thai was not flavorful enough in my opinion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGX295X3RBRRAB",
            "text": "This is some of the best Thai food I've ever had, and I've been to Thailand (and lived in Sydney, where the Thai food is insanely good!). This is a one man show - he cooks everything from scratch. If you're ordering delivery, expect a bit of a wait because of this. It will be well worth the wait - fresh, authentic and delicious."
        }
    ],
    "reviews_count": 71
}