{
    "name": "La Cocina de Mama",
    "place_id": "ChIJ6UWRZgn3wokR8HO61UCwZBQ",
    "grid": "MN11",
    "address": "154 E 109th St, New York, NY 10029, USA",
    "rating": 4.7,
    "user_ratings_total": 186,
    "phone_number": "(212) 348-3619",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeFZFMDFaV2xYU2tjeU1VOHhjVmRQUkdNeFJsRRAB",
            "text": "Nice staff and good food. I recommend ☺️"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNVYyOWFiVkJUVTJGcGVXVlpOMjFXUjJVME0zYxAB",
            "text": "One of my favorite places for Taco and quesadilla."
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dk9XTmZlVTh3UlZSMFVYZE1ZMlJaZERWRVNVRRAB",
            "text": "Cuisine très bonne mais très épicé 🌶️ !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNE5UVTFlVWhmTm1WelJuUnlTSFE1VUVWMk5rRRAB",
            "text": "Corn flour is hand processed into tortillas or tlacoyos. Carnitas are nicely cooked and balanced with different pieces of pork. Horchata is natural and home made. Bonus for having Boing (Mexican pulp beverages)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKclluY3piVVpZVFRobU1tTkZPRzVOU0dobFFVRRAB",
            "text": "Very Delicious Food\nVery Friendly  Service\n5 Stars Hi Recomend 👌💯"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyM05YdkN3EAE",
            "text": "Hands down the best cantina style Mexican food in Harlem! No frills, just rustic, authentic eats, the way it should be! The owner always welcomes guests with a loving motherly attitude, the space is well kept & clean and it's very easy to settle in for a satisfying meal. I've had a variety of tacos, burritos & tortas and have never left disappointed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST1UyZElibGxpVURWa2RtOWxXR05pU2sxYU9GRRAB",
            "text": "Pricy(Dry Birrias tacos and Salty) not recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weWNEZE5Za3g2Vm14NE0xOU5VbWxJWkVSMU1tYxAB",
            "text": "Paid $16.33 for 3 steak tacos. The meat was bland. Not worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV05UUjJTMkY2WTFobWJrZE5PVVZRWldKVk9VRRAB",
            "text": "Literally the worst burrito ive ever had in my life. So dry. No taste. And so expensive. The tres leches wasn’t that bad. But the actual food was terrible. I would never recommend to anyone"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdjhtbUhnEAE",
            "text": "Even tho the torta was really good, it was really small and I got taxed a bit, meh spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbWMzbFRPV2g0VlRKSlNrbHBXVGMzTkVsMFRuYxAB",
            "text": "Great service, great food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UE4yazBYMlF3Y0RadU4wbzRSSGxIUjJsblVrRRAB",
            "text": "I highly recommend this restaurant. The guacamole and queso is some of the best around. The servers were also super friendly and helpful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPU0EwNVNNMjZDNTZ3RRAB",
            "text": "Incredibly good food. The elote (street corn) was marvelous. So friendly, too!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VON2hnWlc4bGVQUHl3RRAB",
            "text": "Ven te lo recomiendo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQNkNnTXlMcVlMTVF3EAE",
            "text": "The lamb quesadilla was lacking a bit of flavor, perhaps adding tomato or more seasoning would help. The torta also lacked any distinct bold flavor aside from the jalapenos. Other than that the food was alright and service was great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdkp6S1FBEAE",
            "text": "Delicious food, quickly done  and fairly priced"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdU82OWhnRRAB",
            "text": "Extraordinary Mexican food for New York.  I had carnitas tacos and was very pleased.  Then I spoke to the lady who cooks (I assume the owner) and learned she is from Mexico City, which explains why the food is so good and authentic (she adds a secret ingredient to make the carnitas richer).  This place is very small with only a counter for eating in.  We were served by a very friendly and accommodating young man.  My wife was pleased with her enchiladas verdes.  Next time I'll try the barbacoa."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX2ZqcC1RRRAB",
            "text": "Las gorditas de chicharrón perfecto"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMDZhQzF3RRAB",
            "text": "hit or miss and a little pricey but good service and a cute atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOG9YRzB3RRAB",
            "text": "The food has good taste but the carnita has too much fat and one or two little bones.  Good portions"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbDlEWjBnRRAB",
            "text": "You can’t go wrong here. I live in the neighborhood and eat a couple times a week. Food is fantastic, and the chicken tinga quesadilla is world class. Service is great too. Support this great East Harlem family-owned business!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcEtYZFVnEAE",
            "text": "Very good restaurant! I recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a3VUQlZBEAE",
            "text": "Had the birria tacos and they were delicious!! Can’t wait to come back again and again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdThDWFdBEAE",
            "text": "I love eating here. The food and service is great."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb2VfVEVBEAE",
            "text": "This place is a very warm, friendly, and welcoming restaurant. The food is definitely worth the price and I would personally recommend the Quesadillas."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NFBEbzRRRRAB",
            "text": "The food was excellent I really enjoyed it,The service was really fast I recommend it 10/10"
        },
        {
            "date": "11달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNXZQYlFnEAE",
            "text": "Petit restaurant très chaleureux avec une ambiance mexicaine\nnachos au poulet, tacos aux crevettes excellent\nPersonnel sympathique et disponible"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeXRlRU9BEAE",
            "text": "This place overcharges regularly. It was supposed to be $10.88 with tax and I was charged $11.98. Their portion sizes have gotten a lot smaller too. Rip off."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtczh5aGxBRRAB",
            "text": "This is a family restaurant, the staff are very friendly, they play good music, they always are welcoming. The place is neat!\n\nHappy Halloween blippi\n\n👻✍🏾👄👥👩🏽👦🏻👱🏻‍♀️🧕🏼👮🏾‍♂️👮🏽🧛‍♂️🥷🏻🧜🏾‍♂️👼🏼🙅🏽🙆🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYODhxTHlBRRAB",
            "text": "Small restaurant with just seating at the bar. Excellent food. Excellent service. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdGNHNUFREAE",
            "text": "Lots of delicious options!  Affordable as well/"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcGNpODNnRRAB",
            "text": "I needed a quick lunch, so I tried this place. I had a chorizo taco and a tinga de pollo quesadilla. The taco was awesome! The sausage was cut into tiny cubes and grilled, not soaked in oil and grease like some places. And the tinga was excellent, not dry, and had that great tangy flavor I love. Everything was fresh, and the prices were very reasonable. If I'm in the neighborhood again, I'll definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmY2dHFBRRAB",
            "text": "Don’t pay attention to the bad reviews. It’s just people without tastebuds or people who just had a bad experience, we are humans and don’t always feel 100%!!!! Don’t judge it until you give it another try if you didn’t like it. Because I LOVED it. The tings quesadilla is definitely one of my favorites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud0lMRzdBRRAB",
            "text": "probably  sone of the best Mexican food I’ve had in nyc . Pls don’t shit on East Harlem Mexican food bc this spot slapped . The spot is small with Bench like seating and the people running the spot were so kind and attentive . The fist and al pastor tacos were amazing . Al pastor tacos usually don’t have the right seasoning but this one was perfect . The fish taco has a good amount of fish and seasoned well . We also had the sope . Definitely coming back and glad this place is in my neighborhood ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIX19fSFpBEAE",
            "text": "Pedi unas quesadillas me llegaron frias peroo estaban ricas..si ellos le dijeran a los clientes q tienen de especiales como el pozole y otras cosas mas estaria muy bien ambiente tranquilo para comer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdC12Vmd3RRAB",
            "text": "To hot the place no AC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc2NpVFR3EAE",
            "text": "When you search for “best tres leches cake” on Google this is the place that comes up. My wife and I schlepped a mile to get just the cake and it’s seriously amazing."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ay16LUJREAE",
            "text": "Es triste como se vende la comida mexicana  tan exagerada mente cara y ni siquiera sabe buena pedí unos tacos dorados y literalmente solo eran 4 tacos con lechuga y queso no traían ni frijoles $14 dólares una gorda de chicharrón que estaba…"
        },
        {
            "date": "1년 전",
            "language": "ca",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NC1hemRnEAE",
            "text": "La qualitat-preu del que serveixen és excelent. Els dos plats que vam provar estaven molt bons. El local és petit, però s'hi pot menjar còmodament. El servei molt agradable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Mzh1OWJREAE",
            "text": "Birria tacos, fresh corn chips and queso. All 3 were incredible. Food came in less than 10 minutes after ordering and the guy behind the counter was doing it all. I’ve never left a review before and I had to after this. Cant wait to go back every day I’m here."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cWNyRER3EAE",
            "text": "Tout petit restaurant avec cuisine typique mexicaine. Équipe souriante et sympathique. On a commandé les burritos aux légumes (très bons) et les quasadillas au poulet (excellents). N'hésitez pas à goûter leurs sodas et boissons typiques. Une petite pépite dans Harlem."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURickpxbEhnEAE",
            "text": "Délicieux"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMS1XVXB3RRAB",
            "text": "Cozy little Mexican restaurant in East Harlem. Close to the train. Al pastor tacos were great and bistec tortas were flavorful. Fresh hibiscus and taminars drinks were perfect for summer. Staff are super nice. Planning to go back to try more off the menu. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybDV1WmtBRRAB",
            "text": "Delicious tacos + super friendly staff. Forgot my bag and the man working there ran for a block after us to bring it back to us. Most people wouldn’t do that!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyazhqRmx3RRAB",
            "text": "Love the street corn😜and nachos…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydlltdHlBRRAB",
            "text": "Best Mexican experience ever!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaFAzT3p3RRAB",
            "text": "Wow, this is one of my favorite Mexican food places ever. The owner is so kind she reminds me of such a loving mother. The food is as wonderful as her. So flavorful and so yummy I usually get the torta or the mom rice bowls. They are just so delicious really should keep this place, but it is just so amazing. It’s a small cozy place, but so worth the travel all the way uptown really would recommend!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbnRiWnF3RRAB",
            "text": "Vivo en la Ciudad de México y vengo muy seguido a los Estados Unidos, encontrar buena comida mexicana siempre ha sido muy difícil hasta que llegué aquí, ufffff probé los tacos y estaban buenísimo s pero lo que nos voló la cabeza a mi esposa y a mi fue la hamburguesa con huitlacoche 🤤 una verdadera maravilla ya queremos regresar y comerlas de nuevo, felicidades a Juan y a su familia que lo apoyan en este proyecto"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMVpmN09BEAE",
            "text": "Absolutely best Mexican food I’ve had! Delicious, fresh, handmade tortillas. Tasteful fun music and decor. Small, but omg WORTH IT! I had sopes, elote and my husband had al pastor tacos. — Mexican traveler from Arizona!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6LTh1SjhBRRAB",
            "text": "Lo.mejor.de lo.mejor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3FxVjNBRRAB",
            "text": "I've only been here twice but everything has been great here. I got tacos (shrimp, carnitas and chorizo) and chips with salsa & guacamole - all excellent!\n\nIt is a small space so I would not recommend it for large groups (over 10 people at a time), but great space otherwise. The bathroom is also small but very clean and neat."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOFpTSWN3EAE",
            "text": "Super rica y deliciosa 😋 comida.\nEl servicio fue increíblemente rápido, atento, alegre y amistoso.\n\nEl local esta limpio y organizado,  el baño tiene una decoración de plantas muy padres.\n\nLos precios son razonables."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPal91Zm1BRRAB",
            "text": "1000/10! Stumbled upon this place looking for a bite to eat and it was probably the best Mexican food I’ve ever had. Would definitely always recommend. Restaurant was very clean and the staff were super friendly. Prices were fair, too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2Zhc1RBEAE",
            "text": "BEST MEXICAN FOOD in NYC! Authentic flavor and wonderful service. Extensive menu and they are very flexible with orders (I ask for a Birria burrito every time (not on the menu) and they’re always happy to accommodate!) Give this small business a try, you will not regret it!!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGOGV6djh3RRAB",
            "text": "Muy rico todo.\n\nMi hamburguesa con huitlacoche tenía un sabor único, toda la comida es fresca; incluyendo las patatas fritas.\n\nMe queda lejos de casa, si no vendría al menos 4 veces al mes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MXQyX3hRRRAB",
            "text": "Might be best tacos in Manhattan. So far had Al pastor, fish and barbacoa and it’s all amazing. Everything fresh and great quality and the taste only has you wishing you ordered more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd2NLMDRnRRAB",
            "text": "I ordered two steak quesadillas for take out. I’m highly disappointed to see that there was only a little bit of meat on both. They were very stingy with the meat, just little pieces of it. Im literally having bites of Lettuce and cheese, barely any meat on it. The “ meals” were just about $20. It was a waste of money, where I could have gotten more for it.\n\nI gave 2 stars because it tasted good but barely any meat."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1czZYejlBRRAB",
            "text": "Delicious fresh food! At fair prices. I had the steak Torta with salsa verde and was very pleased. Strongly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdmNqOXFBRRAB",
            "text": "Incredible!! I happened to be in East Harlem, walked past La Cocina de Mama, and, on a whim, went in for a quick bite. It was honestly so random, but I’m definitely coming back up here with my partner. I got the happy hour deal (a burrito with a can of soda for $12.49). You might think I’m being dramatic (I love food), but I truly cherished every bite of my al pastor burrito from beginning to end.\n\nFYI, the inside is a little small with limited seating; it’s bar-style seating with 6 stools."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M2VpaFJ3EAE",
            "text": "El trato es amable y los nachos estaban muy ricos: tienes la sensación de estar comiendo comida y no Doritos con cosas por encima recien salidas de una lata. Lo único malo es que tienes que recorrer los cien metros desde el metro al restaurante y es probable que te atraquen en ese trayecto.\nAdemás es el único sitio de NY donde puedes no dejar propina sin que te persiga un camarero chino por la calle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcjdiU293RRAB",
            "text": "This place is amazing! I’m shocked there’s not more reviews raving about it. I started working in the area recently and although there’s taco spots on every block, I make the 10 minute walk here every day with no problem. The food is amazing, the meat tender and not dry. And the staff is extremely kind and welcoming. The lady makes my food with love every time and I feel at home. Thank you guys so much for your hospitality. Will be coming here forever :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX01IdGJnEAE",
            "text": "Delicious fresh mexican food and friendly staff. Quesadillas were amazing. Definitely worth a trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbTRYSTd3RRAB",
            "text": "Went here with my husband on a whim for lunch. I’m so glad we chose here. We had been looking for an authentic local Mexican spot to call ours and we finally found it! The woman who was there did it all and was super sweet 🥰 Everything down to the tortillas are homemade. You definitely feel the love in every bite. I can’t wait to go back! 🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbXRLTWp3RRAB",
            "text": "I've been here twice and ordered takeaway. Absolutely amazing burritos and more Mexican food!\n\nI rate 4 for the atmosphere because it's a small place, more like to eat quickly and go, but I love the decorations of the place and the staff is super friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNka0lqcG13RRAB",
            "text": "The staff is very kind, the wait is always usually 10-15mins which is pretty good. The food is very good!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOXQyUnZnRRAB",
            "text": "Deluciosas quesadilla traditionales. La atencion al cliente  es exelente y la calidad de la comida es muy buena por el precio."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOa29QbFJnEAE",
            "text": "Amazing birria tacos and hamburguer with huitlacoche omg definitely the best"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMXFDay1BRRAB",
            "text": "Really delicious food I’ve ordered from here a couple of times, quick service and the prices are fair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObnVpTU1nEAE",
            "text": "Super tasty and friendly people working here. It’s for takeaway only and I arrived on a busy night so there were a few orders ahead of me and just one Mama cooking and another person working. But each order seems to be made with love and attention. I will probably order ahead next time and pickup."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aUpTMmpnRRAB",
            "text": "Nie wiem jak opisać słowami, będę najlepiej wspominał to miejsce.\nBurrito najlepsze jakie jadłem w życiu 🥰😍🤩\nAle oprócz jedzenia, całą atmosferę robi meksykańskie serce. Dziękuję za tą kulinarną podróż 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN18zZWdBRRAB",
            "text": "My new go-to neighborhood Mexican spot. I’ve ordered through seamless and pick up. They were both prepared quickly. Torta and tacos (fish, cecina, al pastor, and barbacoa) are all much better than the other places nearby.\n\nI have not eaten there so I cannot comment on atmosphere.\n\nHighly recommend trying."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbVlyY3hBRRAB",
            "text": "I was lucky to walk in front of this restaurant one day coming back from the nearby post office. It's become my absolute favorite take out/delivery restaurant in East Harlem. I've tried a few options and liked everything better than any other offering in the area. The tortas are my favorite pick. Highly recommended."
        }
    ],
    "reviews_count": 72
}