{
    "name": "Nocciola Ristorante",
    "place_id": "ChIJG3Ux0Af2wokRTVZ-phoptd8",
    "grid": "MN11",
    "address": "237 E 116th St, New York, NY 10029, USA",
    "rating": 4.5,
    "user_ratings_total": 409,
    "phone_number": "(646) 559-5304",
    "reviews": [
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeHNtS293RRAB",
            "text": "Top notch Italian. Chicken Parm was delicious along with Arancini apps."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1pXMXRlWGs1VUdwWlkwazJkVlJZUXpkdVpsRRAB",
            "text": "The staff is very attentive. My food tasted ok and the portion was reasonable.  My date loved his chicken marsala. We shared a tiramasu which we both agree didn't tasted fresh... maybe a few days old. Overall  a good experience. Wish they had more vegetarian options."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SVUwbEJaMkp6Ukc1TGMzZHFSM3BJZEVOVVkwRRAB",
            "text": "The food is always amazing and the service is always great. Definitely recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWGVFNXpVVUUwTTJ4SVJrdEtXSFoyUzFoTWQxRRAB",
            "text": "This restaurant is home away from home. The staff and owner are absolutely lovely 100% of the time (and I’ve been here more times than I could possibly count). I’ve tried almost every dish and they are all perfect. Nocciola is amazing and.. while it pains me slightly to reveal this secret of New York, I couldn’t recommend it enough."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVlFVMXlURkZmT1dGa2NHdFVOWEI0T0dwV1dsRRAB",
            "text": "I cannot pronounce the name for the life in me but the food is so good! The service is usually pleasant and attentive— this spot has become one of my favorites. Their prosciutto pizza is so good! I’ve gone elsewhere for prosciutto pizza, and I keep coming back here. Also, I’m not a fan of margaritas but this place has really good margaritas— I guess because they make it with fresh lemons!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVpVbGZOa1Z3YzFGNGJqaFhVVVJ0Y0RSemMxRRAB",
            "text": "It’s completely wonderful! That’s for the  two times we’ve gone. Expected to keep going. They are attentive, garlic bread is a must! the carbonara was delicious - heavenly. Beer is in a nice cold cup if you prefer it  like that.  it’s intimate, not too crowded at all. We love it and brought our friends the second time+ it was a birthday; as expected they didn’t disappoint. Most the plates were empty if not almost from being full - bread with pesto and burrata so tasty, the penne pasta. You won’t regret it at least we didn’t think so. Good local find"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RE4zUmhjWEpMUWxSbmFFUlZVRzFoVlZoalYxRRAB",
            "text": "I went with my family a the experience was really amazing.  The place is humble and elegant at the same time. I will come back and I recommend for yourself,  a date or as a family place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc1YyVk1XSFJLVDJobFMyTTBUelk0UVdkWFoyYxAB",
            "text": "Nice place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c2IydEhia0pUVXpZNVFreHdUVmhvVFZOUFEzYxAB",
            "text": "null"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVlFVOUlTV1pWV1dseWVGUXhNR0ZuY0c1R2IzYxAB",
            "text": "Every dish comes prepared with care in a spotless environment. Each offering improved upon what came before. The service was good and the staff member was observant. Thanks. As someone who just relocated nearby, this place is a great find. I'll be eating here often from now on."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1lqVXlYMGxOUzIxTWNUQXpaamhIUzBSVVpuYxAB",
            "text": "we had chicken parm & cavatelli al funghi & it was so so good. vegan friendly. all of the staff was sweet but most of all antonio was amazing!! the atmosphere as well as the music was great. a must try, will be back ✨"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVEExcXE5czgyeWNREAE",
            "text": "Came here for a post work dinner date on a Thursday evening, there was plenty of seating available and service was attentive & quick. Pasta and arancini were great, loved the complimentary focaccia and pesto sauce too. The pizza didn’t quite hit the mark (more flatbready) but was still good & flavor too. Still recommend for yummy Italian in East Harlem!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaWYtRkdBEAE",
            "text": "Really nice place with great vibes great energy 👌"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX052RWJnEAE",
            "text": "Our food was delicious. Server Antonio was on it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNGU2eGNnEAE",
            "text": "I can't say enough good things about this charming little restaurant! It’s such a pleasant find for incredible Italian food in the area. I truly loved the service, the food, and the beautiful decor. The atmosphere was warm and inviting, and everything was spotless. I highly recommend it to anyone looking for a fantastic dining experience. Absolutely worth a visit!\n\nThis version makes the review more polished while keeping it genuine and engaging!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb2M3Z0Z3EAE",
            "text": "I can't even begin to express how special this restaurant has been for me and my family! Over the years, we've celebrated some of the most important milestones of our lives here, from my bridal shower to my baby shower, my 40th birthday, and even my son's first birthday! Each time, the restaurant has gone above and beyond to make every event unforgettable.\n\nThe atmosphere is warm and inviting, with a perfect blend of old-world Italian charm and the vibrant energy of Harlem. The food? Absolutely divine! Every dish is crafted with so much care and flavor—whether it's a classic pasta or a modern twist on an Italian favorite, you can taste the passion and authenticity in every bite.\n\nThe staff is always so attentive, making sure every guest feels like family. It's clear that this restaurant isn't just about serving great food, but creating an experience that makes you feel at home.\n\nI’m so grateful for the memories we've created here, and I can't recommend this spot enough for any occasion. If you're in Harlem and craving delicious Italian cuisine with a side of love and hospitality, this is the place to be!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb2JMbDB3RRAB",
            "text": "East Harlem isn't really known for Italian food, and that's why Nocciola is a hidden gem in this neighborhood, and never disappoints. The service is really friendly and attentive. Lily and Antonio are always welcoming. My favorite appetizers are the burrata and the crispy calamari, but you can't go wrong when ordering a pizza. In entrees the chicken parm is a great portion, the carbonara is super creamy, and my friend loves how fluffy the gnocchi is. You have to save room for dessert and order the tiramisu or the panna cotta. Overall a comforting place, friendly service, fresh and affordable food. One of my favorite places in East Harlem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMnBtLWJnEAE",
            "text": "Unpleasant Experience – Dishonest & Poor Quality Food\n\nI had an incredibly disappointing experience at this restaurant. I ordered a Margherita pizza, but what arrived was a clearly pre-frozen pizza with pepperoni on it, a huge issue since my friend, who was visiting from out of town, is Jewish and doesn’t eat pork. When I pointed it out, the owner straight-up denied it, even as I pulled the pepperoni off right in front of them. No apology, no offer to make it right, just gaslighting and attitude. The food itself was low-quality, frozen, and absolutely not fresh like they claim. The lack of honesty and customer service made the whole experience even worse. We left feeling disrespected, upset, and with our meal completely ruined. Save yourself the trouble, I won’t be going back, and I wouldn’t recommend it to anyone."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaE1Xa1lnEAE",
            "text": "My son loves take-out from this place! I wish that this restaurant had its own delivery carriers instead of third party service for deliveries. This would ensure good service all around as unfortunately third party services don’t always provide the best experience. Unfortunately, we can’t always order take-out as much as we’d like due to exorbitant fees from GrubHub for example. We’d love to one day order more from here :)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGN2TzFnRRAB",
            "text": "We ordered the tiramisu and the chocolate cake through Uber Eats, and the flavor, richness, and depth were healing to my soul.\n\nBravo!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbUxfeUt3EAE",
            "text": "I dine in each time the food is deli… eggplant is the veeery best!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaVBMdVFBEAE",
            "text": "Van 3 veces que me hacen lo mismo, soy alérgica a los Beans, y hasta llamo para verificar que por favor no me lo pongan y como quiera lo hacen, ya no vuelvo a comprar más en este lugar ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeF8yeHV3RRAB",
            "text": "Food was tasty and service was excellent. Definitely recommend this place."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cElIdXdRRRAB",
            "text": "Estuve con unas amigas para celebrar nuestra cena navideña y la verdad la pasamos genial. El lugar es muy lindo y bastante acogedor, la comida y la atención 100/10."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NkstM3RBRRAB",
            "text": "Ayer tuve la oportunidad de visitar Nocciola Ristorante con mi grupo de amigas, y solo puedo decir que fue una experiencia espectacular. Desde el momento en que entramos, el ambiente acogedor y elegante nos hizo sentir como en casa.\n\nRecomendadisimo"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN2bUpRTRAB",
            "text": "Mi lugar favorito para italiana! Siempre que puedo lo recomiendo, nunca decepcionan! Si quedar bien con alguien, este lugar no decepciona jamás!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Nk0tYndnRRAB",
            "text": "Mi experiencia fue muy agradable! El\nLugar es chiquito molero muy acogedor. Me atendieron muy bien. Muy buen servicio y la comida me gustó mucho."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Nk5lbU9BEAE",
            "text": "Todo súper bueno! Lindo lugar"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cUp2dkNBEAE",
            "text": "Ame este lugar, la buena energia se siente desde que entras, the food was delicious y las atenciones excelentes..definitivamente volvere :)"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cVAybmRnEAE",
            "text": "1000/10 gran ambiente, excelente servicio, súper recomendado sin duda volveré."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2QzSnJnRRAB",
            "text": "Delicious and cozy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOTllTDdnRRAB",
            "text": "I happened on this place, and I can't believe it. If it were in Midtown or the Village or Bushwick, it would be getting reviewed by the Times, because this is some of the best Italian food I have ever had in NYC. Believe it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3VmV2FBEAE",
            "text": "Consistently one of the best restaurants in the city. The staff is wonderful, and the food is absolutely delicious. Personal faves: cavetelli al funghi, burrata, the holy grail that is their pesto, and the salmon with the grain mustard sauce. Everything is perfectly made, down to the Cesare salad’s dressing. Insane attention to detail in this menu. Hope to see many more years of Nocciola!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua3A2b1RBEAE",
            "text": "Your garlic bread doesn't match your photos at all. 2 small, thin pieces of bread for $7 when you order from uber eats is absurd. The pasta and portion was fine and cooked well but pretty bland, had to add our own seasoning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINnUzRFdBEAE",
            "text": "One of the best Alfredo pasta I've ever tried\nThe service is exceptional, very friendly and professional.\nthe atmosphere is pleasant\nI felt very good here, I recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbUw2NzdnRRAB",
            "text": "This is our(family) FAVORITE spot drinks,food is always delicious. We welcomed this 2024 over at Nocciola with my family  love this spot and the owners are amazing people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXZEOVZ3EAE",
            "text": "Worst “cannoli ever”\nNot even a cannoli"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieXFXcmFREAE",
            "text": "Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybFptMGJnEAE",
            "text": "Ordered on Uber eats. I  ordered the Penne alla vodka with chicken and shrimp, my shrimp & chicken was over cook, the pasta had no flavor. My asparagus was cook well but tasteless. This was my first time eating here, Perhaps you had an off day. It was not worth the money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybUppTFVREAE",
            "text": "The food was so delicious! Oh my god the food was rich! The sauce was saucing! Everything about it tasted divine and I was gobbling it up. Dare I say brought me back to life lowkey?!\n\nThe service was also great, everyone was so nice and attentive. They weren’t messing around. It was a longer wait for our food but that’s because the pasta was so fresh. So have patience!!!!\n\nThe ambiance was gorgeous! It’s a long hallway and feels very romantic and intimate. We had the back booth and it wanna lay claim to it. Can’t wait to come back! I had the fettuccine Alfredo and that’s all I could ever ask for is a good one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMDdEUnB3RRAB",
            "text": "Words can’t explain how delicious the food was. Omg !!! Adding that I love pasta, and here the past is delicious.\n\nI went to this place with my best friend, we are always looking for small cozy restaurants where we can talk and have a nice time.\n\nStarting with the bread and pesto sauce to the dessert.\nFood was 10/10 - I ordered spaghetti carbonara and added chicken. My best friend ordered Scampi spaghettis. The taste of the spaghetti was inexplicably delicious. We also had burrata and fried calamari as entries, drinks and chocolate cake with ice creams dessert.\n\nThe service was beyond expectations. We will definitely be going back to this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdGZPV1VBEAE",
            "text": "Had a retirement dinner for a co-worker..\nEverything was GREAT!\nwe had the back patio, and service for our guess for 50 ppl was great and  very friendly.. no complaints! My coworkers were very happy with our drinks and dinner package for the retirement.\nFOOD WAS DELICIOUS!!!!!\nLove the place Highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aThUOXV3RRAB",
            "text": "O lugar é ótimo e o nhoque servido é delicioso (dos melhores que já comi). Também experimentei a pizza de berinjela e abobrinha e estava super saborosa!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6amR1VE1REAE",
            "text": "Great services and great food.\nThanks guys."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeWR5Rk93EAE",
            "text": "Pedi una comida mi primera vez  pollo piccata está muy buena pero tenía un pelo de gato me di cuenta al y no terminé de comérmelo me dio asco  deberían tener mas precaución. Con esto aparte muy cara el pollo eran dos muestra de de lechuga al parecer bien fina no volveré a comprar más"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc1pUX3BnRRAB",
            "text": "Served nice and hot!!!"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdDRiaVF3EAE",
            "text": "Comida maravilhosa!! Pedi um spaghetti alla carbonara e estava sensacional. Vale a visita."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNTc3TUZ3EAE",
            "text": "The food was delicious and the service excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkc2RiQktnEAE",
            "text": "Nocciola is such a great restaurant! We live in the neighborhood and we never thought we would find this gem in the area. The food never disappoints and the servers and manager are always very attentive and accommodating. My bf and I choose a different plate when we go and have worked our way through the entire menu. Seriously, do yourself a favor and go so you can enjoy this family owned restaurant and see exactly why they have been around for a decade. You will not be disappointed. It’s our favorite date night local spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eWRfbXVnRRAB",
            "text": "Good eats and great atmosphere.  Cozy with a nice bar to share a meal with a new friend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMWRpT19BRRAB",
            "text": "This was a very unorthodox Italian place. My friends and I went for restaurant week around Harlem. They had a fixed menu with 3 courses for a great deal. The server was very informative and gave great drink recommendations. The music was different, a lot of 70s of all types of genres. There's also disco balls up top which was different. It didn't feel Italian but the prices were incredibly reasonable and the food was stellar so I will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdTVUM3FBRRAB",
            "text": "Came here on a Saturday night, restaurant was a bit busy, so took about 15min to get a table for party of 4 ready. Atmosphere was great, had a casual but semi-formal feel. A nice spot for dinner.\n\nFood was good - only complaint was the chicken that was added to our pasta was dry. Dinner was served with some garlic bread which was nice.\n\nFor appetizer we ordered the fried calamari which came with some shrimp. We ordered the Agnolotti di Formaggio, Spaghetti alla Carbonara, Linguini Frutti di Mare, Orecchiette Baresi. All of the pastas were cooked well and the sauces were all great. Finished with a tiramisu for dessert."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1b09LaEl3EAE",
            "text": "Cute spot with good service. Menus are on iPads with picture descriptions. Music playlist was on point. Their lemonade is so good. They give you focaccia and a pesto dip to start which is amazing. Food is good can’t really go wrong with any item."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdS1DTTRnRRAB",
            "text": "Super good food. Wonderful service!! I loved this place. I highly recommend. Go here.\nGet the fussili and mushroom dish. Such fun people. The environment here is…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0c0lTaXJ3RRAB",
            "text": "This is NOT commercial grade Italian food. This food does not come in prepacked plastic bags shipped in from someplace in New Jersey. This is real food folks. The atmosphere is cozy. The service personalized. The food ultra tasty! I had the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabjZubGVnEAE",
            "text": "Incredible! Linguine frutti di mare was to die for. Good wine selection and reasonably priced bottles. Attentive waitstaff, cozy vibe with tasteful music selection. Will definitely be back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBXzVyZm13RRAB",
            "text": "Amazing appetizers and entrees. The wine was really good also. Did not have enough room in my stomach for dessert. The wait service is attentive and friendly. The ambience is very nice. Will definitely be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd01MMXd3RRAB",
            "text": "Wow! The barbabietole salad is a must, and all good appetizer and pizza and pasta options. Tiramisu! Good service, We’ll be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMGZqYzZ3RRAB",
            "text": "Had such a great experience dining tonight with my partner. The service is fantastic and polite, atmosphere is very cozy and intimate.\n\nWe got the shrimp scampi, Margherita pizza, brussel sprouts, tiramisu and some wine! This is the best scampi I have ever had. The lemon butter garlic sauce was so silky and flavorful but bright and light. The pizza was good, nothing crazy but we loved the thin crust and fresh tomato sauce. Brussel sprouts were ok. We also got free garlic bread with a pesto sauce to dip and it was also really delicious. The ingredients all tasted fresh!\n\nTiramisu was also a hit, nice and creamy with the perfect balance of coffee flavor. Highly recommend this Harlem gem"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleU9tSUtnEAE",
            "text": "Have been coming here for a over a year and it’s the best Italian spot I’ve been too. Service is always great! The atmosphere is unmatched, makes you feel like you’re somewhere else. The food was really good last night, it was our first…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OC1TVHR3RRAB",
            "text": "What a gem! I rarely write reviews but this place deserves it. Tiny spot, easy to be overlooked up here in East Harlem. However, if you are into great service, perfectly prepared authentic Italian food, great wines and some jazz - stop right here. Would be a success even in Roma, Venice or Milano.  I had Caprese, Carbonara and a glas (well, actually two) of Montepulciano. Made my day. Glad that I found it. Gracie, Nocciola."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c2NmR3ZRRRAB",
            "text": "Nice Italian restaurant with beautiful atmosphere. Service is nice. Food is generally good but not everything is great. I liked the octopus and the calamari, but not so much the pasta and the arancini. Reasonable prices 10-20$ per plate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLVpyMXNnRRAB",
            "text": "What a nice place!!!! Food was on point ✔️ service was on point ✔️ beautiful environment ❤️ and the prices are very affordable… we definitely coming back 😄"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cWVEWi1nRRAB",
            "text": "Ame este lugar, la comida es espectacular, el servicio es bastante agradable, simplemente es un sitio que vale la pena visitar y por el cual escribir y tomarse el tiempo de escribir una opinión sobre este lugar 🫶🏽"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcU9yYzdnRRAB",
            "text": "Delicious food, amazing service, and reasonable prices. I solo dined at the bar & the staff made me feel incredibly comfortable. I will absolutely be back and highly recommend this restaurant to anyone!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNDhTVGhnRRAB",
            "text": "I love the food, I love the restaurant style, staff are amazing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFX3JpcjBRRRAB",
            "text": "Great service and yummy food. Was expecting red velvet pancakes (like I saw on OpenTable)but not a part of their brunch menu."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNHB1Y2FBEAE",
            "text": "Quaint Italian restaurant in the heart of East Harlem. Scrumptious food and great friendly staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNTYyVE1REAE",
            "text": "I love the food here! Great place to eat and relax."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbmFXZ1VREAE",
            "text": "The sounds of diners and workers is so loud that it is hard to relax.  Nothing muffles the noise. The food was freshly made but didn't have the intensity of flavor that is authentic Italian. The staff was lovely and professional."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeE9hVGFREAE",
            "text": "This is my family's favorite place in East Harlem. We have never had a meal there that was less than AMAZING. The staff is wonderful, the food is outrageously delicious, the ambiance is cozy, and the prices are always so reasonable. I cannot recommend Nocciola highly enough!!"
        }
    ],
    "reviews_count": 71
}