{
    "name": "Taco Mix",
    "place_id": "ChIJ2RB8ywf2wokRO5NQU16lvzY",
    "grid": "MN11",
    "address": "234 E 116th St #1, New York, NY 10029, USA",
    "rating": 4.2,
    "user_ratings_total": 1842,
    "phone_number": "(212) 289-2963",
    "reviews": [
        {
            "date": "20시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUVlVNUpNa1UzVUU1cVRWcHhjalJ1Y0hsVVkzYxAB",
            "text": "When ever i’m in the area this is my go too for some tacos or nachos very tasty fresh , friendly staff when placing order over phone"
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVlRFVnlhbGx2Tm1Oa2FqTTRkVGsyUmxOek5WRRAB",
            "text": "First their tacos began at $3.50 earlier this year, then it went up to $4.00 around the spring, then up to $5.00 in the summer, and now they are $6.00 PER TACO and the toppings START at $0.50 per topping. I ordered from here ALL THE TIME!…"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwck5scEJlamhxVkdSWlVtSkxMVEprYmtsMFUyYxAB",
            "text": "The most consistent Taco experience in Manhattan.  You can count on them 24/7.  Great for late night excursions!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eFFqSlFOMlI1TVcxcWJqRkZZbEpIVTNkcFRtYxAB",
            "text": "Be careful I bought food for my daughter and I. This was in her taco meat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TFRXNTBPRVJXWmpoWFZESklZVkV6U0dZM1pWRRAB",
            "text": "$22 for this very underwhelming burrito bowl. Steak was hard to chew. My food was ready in less than one minute when ordering in the store. Now I remember why I never come here anymore. A lot better options in the area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRGQzZDRUR2R4ZGxoS1RXZDVWRWR1VDJzd1dVRRAB",
            "text": "When I first started ordering from here about a year and a half ago the food was really good and became my go to for mexican. However the price went up my usual order that would cost $13 was $16 and the food also started to become a hit or miss. Sometimes it was good other times it was burnt or cold. Now the price is $17.50 for a burrito. Thats absolutely ridiculous and has become unaffordable for me to buy my usual from here. Who has nearly $18 to spend on a burrito?? If you want steak it’s an extra $1.50 thats almost $20 for a burrito…. Please be more considerate of your customers. I wish to keep being able to afford to eat here because when it’s good it’s really good but i cant justify spending that much anymore."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTlJWTTFhamxTYlRkTE1HODROWGMzTUY4eE9HYxAB",
            "text": "Tasted better when it was still cheap"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMlFXVlhkV3hwTjNCVmJWUkZSbU50VTNVNGVtYxAB",
            "text": "This was my go to spot on busy workdays but all of a sudden their prices skyrocketed. From $10 mulitas to now having to pay extra for more meat when the portion is already small on its own. You never really know what you’ll get nowadays because it really depends on the cook.\n\nDon’t get me wrong, the food is good but small portion for the price now.\n\nWon’t be ordering for a while unfortunately."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWk4xSnVWMVUxTFhNNE5rVXdUbDkyZFZOd1RFRRAB",
            "text": "Accommodating and always hits the spot. They have a professional attitude and respect their customers! Also very kind—At least the guy at the register was🙂"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6eWJpSmpnRRAB",
            "text": "$16 for a burrito. Come on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZellYbHJlV0ZEWDAweWNGbzRSRlJxTkVkTGFWRRAB",
            "text": "Had the breaded beef torta …juicy delicious and filling"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cE5Ia3dhVEZDTmpCYWRsOW5jVEpZTkZKVVVsRRAB",
            "text": "My favorite mexican spot in Industry City!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdmVuRlNOekpwUlc5SU1XSkxUa2d0YTFaR05sRRAB",
            "text": "Hicimos un orden para llevar al llegar a la casa no era lo que pedimos y tenía tanto líquido no se si la lechuga o la carne qué las quesadillas estaban desechas de lo aguadas , llame al lugar para reportar a lo que ella me pidió fotos pero…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMlVWZERNMVZrY25KU1pHNXlhMmxhVVZOelJYYxAB",
            "text": "Always a pleasure"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cU1IUjBaa281UmpFMmFtaElkamxpVmtScmFWRRAB",
            "text": "The food is delicious and the customer service is amazing!! I would recommend to everyone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFlsWjBTMkpqYzNaS00waEJUVEp6UVU5NU0yYxAB",
            "text": "Delicious street  tacos."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVRFaEROVTlxYW10aldYcHlUR2RTTUZOMWVsRRAB",
            "text": "Al pastor: enough said"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMFF6Z3hSR3RsTm0wMFlWSnBWekpSWkZOcGRtYxAB",
            "text": "Delicious delivery. Excellent late night spot."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M1UwNTVZams0TlZKVWIzaEZVMmRrUWtweWEwRRAB",
            "text": "7 años comiendo aquí y siempre es la mejor comida del area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRk5uaHZOR3B6WkRGT1lubHVUbkkzYUZaS2FWRRAB",
            "text": "Shrimp tacos blew my mind!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NU0wRnRPWEo1UlV0VGVGQTVlbTA1TjBoNGJFRRAB",
            "text": "When i say these nachos delivered baby they hit!!! 10 out of freaking 10 !!! Amazing my go to for now!!\nMind you it’s 3am on a Friday morning and this food is still delicious 🤤"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RlQwazNWMUkxTUZNNGJFaFlkRkI0WjB4d0xWRRAB",
            "text": "So i just order through Uber about a hour ago. I ordered 2 different tacos. One chorizo, one steak. I recieve 4 tortillas with the meat mixed as if I bought 1. I was highly upset at first because I had to scoop it up and make the 2 tacos that I bought, but after tasting the meat definitely looked past it. Those were honestly some of the best tacos I ever had. I also bought a quesadilla. I dont know what the hell that is but it's not no quesadilla"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZldtTjBWV2M1TkROS1pIcFlhVVZCUjA1RlNuYxAB",
            "text": "I order the tacos dorado from here AT LEAST once a week and I’m obsessed!!! And the hot sauce is amazing I cannot get enough. This is a staple in my home!!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaVdGUkNiWEZCTVVaSVFtZFNXWGsyTkhKMlJXYxAB",
            "text": "Todo lo que he comido aqui es delicioso, 4 estrellas por el consome le falta un poco de sazón se supone que al remojar mis tacos en el consome deben saber aun mejor pero solo sabe a agua."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bU9FNWxXR1p0WlhkSlpXRmZTbWhCVUdKNk5rRRAB",
            "text": "DELIVERED MY FOOD WET AND SOGGY!! Falling apart"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURta3VfbG1BRRAB",
            "text": "Lately there been getting worst.\nSmall space no attempt to organize the ordering process. Pretty sure the walkway is not even handicap accessible prob 25\" of walk space so cramped. The cashiers always seemed disorganized. Food is ok"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SalQwZHRjemh4UTBGVE5GY3pSWEJOTm1sSlluYxAB",
            "text": "After the disaster that was Dona Matey Tacos, walking into Taco Mix felt like stepping into an alternate universe — one where customers are actually treated like human beings.\n\nThe staff made eye contact (wild concept, I know), greeted me in clear English without judgment, and most importantly… they had steak. And it was good.\n\nNo attitude. No games. Just real service, real food, and real respect.\n\nTaco Mix reminded me that not every taco spot treats people differently based on who they are. I’ll be spending my money here from now on — and you should too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMFdUWjFkMGxXY201Wk9VMXFUbGR2VVRSeWEyYxAB",
            "text": "The food I ordered in shop was good quality and fresh. No fat or gristle but COMPLETELY unseasoned beef. Not even salt. Come on now. I ordered the Volcan with steak and extra cilantro/onions which cost almost $14. I'm a small woman without a huge appetite and I was still hungry after finishing it. It was quite good but for the portion size it was not worth the cost for me. The quesadilla for $10 was ok but also a small portion. It's a tiny run down hole in the wall so the rent can't be too crazy. Won't be back because I expect to be full for $14 from a take out joint."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMk5XOXZSVTVQUjB4SFdUVTJYMU42TFUxYWJrRRAB",
            "text": "A solid little taco shop with a good variety of tacos and other speciality items like huaraches. The meat is freshly made and hot. The tacos themselves are decent, a little messy, and I wish they had a little more seasoning and flavor. The salsa is good, the shop is a fun little late night spot."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWV5djRBRRAB",
            "text": "Update we tryed to give you guys another chance chicken was purposely put in a vegetarian burrito with a whole bunch of onions as I told my fiance never again never its no need I rather cook everyday than for you guys to disrespect us as I told him this time never again and I mean it never again you guys are so disrespectful I'm not even suppose to eat onion I could get sick what is wrong with you guys never again & I made sure my fiance & friends and the community and famalies also do not give money to taco mix\n\nInstructions were not followed we spent so much money and had family order from u guys on uber yesterday and now we order again tonight instructions were not followed on what not to put in the veggie burrito and there's a reason we couldn't have lettuce in that one I cook a lot and told my fiance I can make the tinga chicken because with all we spent for our relatives who order it isn't right also the rice had a burnt odor like it was recooked in one uber didn't want to refund but we paid extra for rice and the lettuce your mistake it said no lettuce they said the can't guarantee you guys will listen to the instructions terrible no longer customers we also have friends we've ordered with no more"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKdU9odm1WNS11bHh3RRAB",
            "text": "I had a burrito. It was delicious but it needed more rice inside. My friend loved his tacos. Very good customer service."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLbU5oWV9Hd3VxNmZ3EAE",
            "text": "Muy ricos los tacos pero poco espacio para poder comer ahí."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYWMycExBdDlIU0VnEAE",
            "text": "The food is amazing have been ordering from the for the past 2 years and half and I can’t say nothing bad about this amazing taco place even all the people that work there are amazing and I think where there amazing people there food comes out amazing love it recommend I wish I took pictures put when it comes all I think about is just eating it lmao so thank you taco mix"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdUFnT3k2dll1WGxnRRAB",
            "text": "Take out only - authentic good food by an awesome Latino crew!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeUxuZWp4bVBIbTBnRRAB",
            "text": "Los mejores tacos!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzLU9mWG9BRRAB",
            "text": "Si exelente lugar yo recomendaría los tacos árabes son mis favoritos"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMTDc4TVhmcXJ5MlpnEAE",
            "text": "I had a grilled chicken burrito from Taco Mix and overall it was pretty good. The chicken was flavorful and the portion size was satisfying. However, the sour cream was only on one side of the burrito, which made for an uneven bite, kind of disappointing. I also tried the verde tomatillo sauce, which was advertised as spicy, but it turned out to be just sour with no noticeable heat.\n\nPricing is fair if you order directly, but I noticed it's about $0.50 more expensive when ordering through Uber Eats."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ082c0x1NS1uOS13RRAB",
            "text": "Takeout only place. Food is amazing and its flavor, I could say the best of Mexican food. They also have delivery service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaWpxTnlacTh1YmVnEAE",
            "text": "Did a catering order for 35 people and it was great !! Everything was fresh and delicious ! They coordinated delivery and the staff was great to work with."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcV9uWFpnEAE",
            "text": "Really fantastic al pastor tacos, some of the best I've had in NYC. The suadero was also great. Really loved the salsa verde. Open up a spot in Jackson Heights, pleaseee 🙏\n\nThe price is a little high, though, at $5.44 for one taco."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd3VLbmdRRRAB",
            "text": "Tacos aren’t that great. I wouldn’t mind paying the 21.78 if they actually taste good. The tacos were very dry & small. Btw the sign outside says 4 tacos for 15, it’s actually 4 for 21.78. Everyone saying the food is good isn’t mexican lol"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb0xUb1FBEAE",
            "text": "Been coming here for months. Always open late and serving good portions."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdzhyVmxRRRAB",
            "text": "Conoci este lugar hace como 20 años si duda eran los mejores tacos de nyc pero ahora demasido caros y sin sabor"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeXFhUFFBEAE",
            "text": "This is the place for tacos. Tuesdays you get a great deal. Always busy so you know it's good. My consistent go-to for good tacos."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd01hd3ZBRRAB",
            "text": "Friendly service and great tasting food! I especially love the birria and steak tacos and nachos."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMGJEVTVBRRAB",
            "text": "One of the best taco stops. Service is quick."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNXJ5NDZnRRAB",
            "text": "Good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOUwtemVREAE",
            "text": "Over priced Mexican food. Have to eat it there because reheating the food is a big no no"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUxQaTJRRRAB",
            "text": "Despite the pricing, the double parking epidemic & tight space, this is the best mexican spot in harlem."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfam9EaXhnRRAB",
            "text": "Tried this place and I love it. Got me some steaks tacos came with a nice spicy sauce limes and radish. It was 12am and place still has clients and delivery drivers come in and out. Next time I come I'll try a few other things but this place is great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3elBTckxREAE",
            "text": "I found them on Uber eats, and now I walk to their restaurant and order my favorite Nacho Bowl it's the best ever to me. I would recommend trying it because you won't be disappointed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOXVXaUt3EAE",
            "text": "I didn’t get a chance to experience inside dining, and ordered via Uber eats. Delivery took longer than expected. I ordered 3 single steak tacos separately. Price was decent. Upon arrival, the food was a bit messy and cold. Meat was very flavorful, but a tab bit over cooked and my lemons was dry, I didn’t get much drops out of them.  5/10. I’ve had better. My coworkers ordered pork tacos, she said they SUCKED! I don’t think I’ll order again"
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cU02SlJBEAE",
            "text": "デリバリーで利用しています。\n\nGoogleマップで、口コミ数が多く評価も高いお店を探していたら見つかりました。\n\n最初はtacosだけ頼みましたが、最高に美味しかったので、翌週もデリバリーしました。\n\n2回目は、tacosに加えナチョスも頼みました。ナチョスも美味しいです。日本で食べるナチョスよりも具沢山です。\n日本ではナチョスってスナックってイメージでしたが、これなら食事になると思います。\n\nただ、ナチョスに入っているビーンズは合わなかったので、次回からは抜いてもらうつもりです。\n（日本人的には、ビーンズは甘いあんこ餅や甘納豆として食べたいので）\n\n場所が、イーストハーレムという点が、観光客や駐在員を躊躇させてしまうと思いますが、デリバリーもあるので要チェックです！\nデリバリーメニューのページも親切で分かりやすいです。\n\n私のオススメの具材は、ローストマリネポークです。\nソースは辛いものを選んだ方が、味に奥行きがでると思います。\n一緒についてくるサービスの胡瓜とラディッシュ、ライムも美味しいです。\n\nあれこれ頼んでも、1人前20ドル以下でした。\n目安の量は、tacos1人2個＋ナチョスを2人でシェア、又は、tacos1人3個。\n少食の女性ならtacos2個でお腹いっぱいになると思います。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdF9yNldBEAE",
            "text": "I hadn't been to Taco Mix in years. I grew up on 116 and use to come here way before the fancy reno. The tacos used to be $2 but now they are $4.50. I decided to stop by yesterday since i was in the area.\n\nThe restaurant had about four other people inside. After i looked at the menu outside and decided to step in, the people were already exiting. The service here is quick.\n\nUpon walking in, i was not greeted or immediately asked what i wanted. It took a while for someone to acknowledge me. I think they are use to people walking in and immediately screaming what they want.\n\nI ended up ordering the shrimp tacos, which they have a menu items with 3 of them. Surprisingly the tacos each had 5 shrimp. It was topped with cabbage, onions and cilantro. They also added a sauce on top. The salsa hot sauces are now in small plastic packaging like the Ketchup packets, really cool upgrade. The tacos were really good. I didnt feel overwhelmingly full or bloated after.\n\nI got the order pretty quickly too. Overall the service was not bad at all. Everyone was kind, respectful and nice. The tacos are expensive now BUT everything everywhere IS. I'm appreciative that this place is worth the additional cost. The quality and quantity is unmatched. I can't wait to be back. I highly recommend this place for a quick bite to work on the go. Btw, they do have outdoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMU5HUHB3RRAB",
            "text": "Tried 2 Al Pastor tacos.  Really appreciated the fact they cook this meat vertically with a fresh pineapple on top. This meant today that the pineapple was not overly sweet, as is the case with most other places which used canned pineapples.\nTaco was delicious, good amount of onions/cilantro/salsa given.  I would rate this place a 4.5 out of five, only because I do not think they make their own tortillas.  I was on a taco run today and visited Los Tacos no. 1, where they do make their own tortillas fresh, which makes a difference for me.\n\nStill overall, delicious Al-Pastor, would definitely go back if in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcHBxdDhBRRAB",
            "text": "Taco Mix is the restaurant I never knew I needed! My partner brought me over as we are both night owls with food cravings. We had gotten nachos with Al pastor meat. The chips had a wonderful crunch. The entire plate was layered throughout. All the delicious things a nachos platter should have, was in there! Their salsa Verde is very hot. I was too scared to try their salsa rojo or to add some pimientos on the side, lol. At least the options were available!\n10/10 would come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5enJyaVdnEAE",
            "text": "This sparse little taco counter punches well above its weight, offering a wide range of specialty tacos and other traditional foods from across Mexico. They do serve vegetarian options as well.\n\nThere is no place to sit inside, but they do offer a shed on the street.\n\nWe tried their Birria tacos, which were delicious. They come in an order of either three or four tacos; the cost is extra. We also tried the Taco Arabe, which is basically pork shawarma and cheese. And to round it all off, an order of chips and guacamole.\n\nEverything was delicious but rich, so you may want to lay down after."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNDlUazRnRRAB",
            "text": "Favorite taco place. Been coming here with my parents for years. We go late at night and my go to has always been the Al pastor. Lately I’ve been getting the birria tho and it’s SO good! Delicious and probably my favorite birria"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdnN6eW13RRAB",
            "text": "Me habían recomendado este lugar pero la calidad de los tacos y de la carne es muy pobre. La tortilla es muy mala y el sabor del pastor y lengua dan mucho que desear porque no es fresco.\n\nEl lugar que tienen afuera para sus clientes huele a humedad y se ve que no lo limpian con frecuencia, no dan ganas de comer a gusto ahí. No hay servicio al cliente, te dan los tacos servidos para llevar, la salsa en bolsas selladas que hacen pensar que no es salsa fresca tampoco.\n\nEspero que puedan mejorar."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldHM2eXhnRRAB",
            "text": "Yum! The Birria Burrito was amazing, the meat was fresh. There’s nice seating outside which was convenient. They had a lot of different sauces which we enjoyed thoroughly. Worth the visit"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX19Ya21nRRAB",
            "text": "You know the food is good when it makes you close your eyes! This place is as authentic and fresh as Mexican food gets. Saw this place trending online and I Highly recommend their Birria tacos and their chicken and steak quesadilla (yes you can have BOTH on a single quesadilla). Family owned and operated by great people. Place is always booming with business but totally worth the wait!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybkplbW1nRRAB",
            "text": "Not the cleanest nor most spacious of places. But flavors pack a punch, and though the tacos don’t look it, they are tasty! The green and red sauces on the side really help add some kick. If it’s your cup of tea the beef tongue is tender and flavorful. Guac and chips were are surprise highlight."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX3JlUm1BRRAB",
            "text": "I just bought 4 tacos de Suadero. I have to tell you that as a taco lover I have never been more disappointed and dissatisfied with. The limes were old and dry and tastes bitter and old. Radishes look like they are rotten. Really I think…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdDhXSUt3EAE",
            "text": "Small taco spot ideal for take out. Tacos are a little over $4. On the smaller end. Al pastor and chorizo are good. Chips are amazing. They take card. The carnitas was a little disappointing. It’s not shredded like I’m accustomed to from other local taco places in the area. It’s cubed and kinda dry."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdGNlT3RBRRAB",
            "text": "We ordered for delivery tacos Al Pastor\nWe received on the side a container with limes and cucumbers. I never take the time to write a review but this is an acceptable\nas a restaurant owner this is more than below quality standards and safety standards\nLimes were white on the outside meaning they have been out probably in the heat for a long time and cucumbers were completely slimy\nI hope the pork that we ingested was in good condition\nI will be reporting to the New York City Department of health because this is just dangerous\nI am sorry but after the new owners took this place is just going downhill in both flavor and quality"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbGEzdFBREAE",
            "text": "Taco Mix is an amazing taco spot! It’s not a restaurant by any means, but more like a hole in the wall that spits out delicious tacos. Workers who I dealt with were very polite, professional and seemed happy to be there and serve you. More…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHMzNWFnEAE",
            "text": "I ordered the Birria tacos with consume, the Al pastor tacos, and two jarritos. We waited about 10 minutes for our order and ate at their outdoor dining setup.\n\nThe Birria tacos were great - crispy on the outside and the beef was very juicy. The consume was very good as well - not too salty or too oily as I’ve experienced with other consume. It also came with plenty of beef in the broth.\n\nThe pastor tacos were pretty average - the grilled pineapple was thinly slice and the pastor was … wet? I wouldn’t order the pastor again.\n\nOverall, the Birria was tender and tasty but nothing to go out of your way for. The soda we ordered were kinda flat even though they came from the fridge and the seating outside was a bit sketch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM3IyUWJBEAE",
            "text": "I’ve been ordering from this restaurant for over a year now and I want to say that every single time they don’t miss it is amazing. Keep up your hard work and thank you very much. Also when I call they are professional and courteous and ready to help PS compliments to the chef they need a raise 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobzVLZWdBRRAB",
            "text": "I’m from Chicago where the Mexican food scene is 💯. I decided to check this “highly rated” place out. The Al Pastor was soaked in it’s marinade and they charged me $2 for a very small habanero salsa. Not worth the $7 I spent on a fake Al pastor taco plus over priced salsa"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NFlIX19nRRAB",
            "text": "Sweet Jesus!!!! I ordered on Grubhub and my only issue is that I didn’t order MORE food. The food is absolutely delicious. Very tasty and fresh. They actually followed my instructions (no onions) and highlighted my special instructions to make sure it was followed. The food is absolutely top notch. And them following instructions  won my heart. I will order from them EVERY time I want Mexican food. Thank you Taco Mix.\nCouldn’t get a pic of the taco because I ate it. The food was so good and I was so pleased. I CALLED them to say thank you."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MFkyNHBBRRAB",
            "text": "Apart from the al pastor tacos which were decent at this Harlem taco shop, other tacos were fairly underwhelming - meat all a bit dry and lacking in flavor. With so many other options in NYC, I don’t think I’ll be returning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ekplczF3RRAB",
            "text": "Amazing tacos. Tried the carnitas and pastor tacos and both of them were great. The service is a bit slow, and they took my order incorrectly - I blame it on the face masks, so no hard feelings.\n\nWill come again!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLU1MQm53RRAB",
            "text": "Hice un pedido por Doordash y debo decir que tiene un sabor increíble. Me encantó. Supero mis expectativas en cuanto al sabor, pero encuentro que le falto un poco más de comida al Burrito Bowl. Pero debo decir que está delicioso 🥰. (En la foto ya habia comido un poquito)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdElDVXhBRRAB",
            "text": "This was the worst ever, cheese isn’t melted my whole order is wrong, I will never order from here ever again. The worst thing is to be hungry and wait for your food and it comes all wrong. They even sent me the wrong soda. Do you guys not…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdDVpLWdnRRAB",
            "text": "Deliciosos tacos poco espacio pero is what it is this is a place to eat and have a nice salsas y chile"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0MGRyNVpBEAE",
            "text": "Terrible experience. The tacos looked good when we got them. But immediately after eating them me and my friends where sick too our stomach for days! 🤢🤮🤢🤮 We got chicken tacos. Stay away from here there food is old and you will get sick! We…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzM3NHMnpRRRAB",
            "text": "I went to this restaurant when I visited a friend and I was so satisfied. When I visited again with my family, it was a “have to go” moment. They have a variety of different kinds of meat to choose from. Inside is very small and can be crowded but it’s well worth it."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncDRtcmV3EAE",
            "text": "The al pastor taco is a must try. I prefer to eat mine without the double tortilla. Taking one off will allow you to experience the full goodness of the meat and sauces."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaU03M2tnRRAB",
            "text": "Great place and great taco !! but pricey for a taco !!\nBut if you willing to pay come and check it out !"
        }
    ],
    "reviews_count": 79
}