{
    "name": "East Harlem Bottling Co.",
    "place_id": "ChIJxbNEDQP2wokRIF9aZH8v7sw",
    "grid": "MN11",
    "address": "1711 Lexington Ave, New York, NY 10029, USA",
    "rating": 4.6,
    "user_ratings_total": 844,
    "phone_number": "(646) 922-7705",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM2IyMVpVbTlWYlhCd2JsOVFSa3BWVTFCMFlVRRAB",
            "text": "Had a wonderful first experience. The staff went above and beyond to accommodate me.the gumbo was amazing will definitely go back"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVRtZGpUME16UzBkcFNtTjVZemxmTUhSbk4yYxAB",
            "text": "This place was such an awesome find! The staff were super friendly and made the whole experience really fun and easy. East Harlem Bottling Company has a chill neighborhood vibe, good beer on tap, and serves up great comfort food. I had the chicken sandwich and it was fantastic—crispy, tender, and served on a great biscuit. The onion strings were a nice twist on onion rings and seriously addictive. Washed it all down with a cold IPA, which hit the spot. Just a great, low-key spot with good food, friendly people, and a relaxed vibe. I’ll definitely be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ1drSmtVRlZKY0U1c1gzQnFObDlxV2tRMlIzYxAB",
            "text": "Food and drinks are great. Highly recommend this spot."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUmNVWnhTak0wYkZaMloydHBVRk5YVVRscmIyYxAB",
            "text": "Great place for craft beer, close to subway."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZME1EaGFlVFp2VjI5SWVIbFlSbXAyTlZSWVpHYxAB",
            "text": "As someone who rarely leaves reviews on establishments I felt the need to leave one. I need to mention this isn’t my first time here at this location. But this is the first time I left unhappy and dissatisfied. First off our server was so inpatient. I mean we had just sat down for like 3 minutes barely enough time to look through a menu. Told her we needed more time and she came back so fast I felt rushed and pressured and that’s annoying. And at the end she watched us make our electronic payments so we had to tip in front of her; who does that. Courtesy is leave the check and come pick it up after it’s paid. This is why I left 1 star.  Moreover on the food I ordered the steak and eggs and maybe a couple years before I’d order this and it came with a whole steak (cut up and with sauce on top) and I’m pretty sure it wasn’t $24. The steak I received was half a steak like come on these prices are sky high. And my cheddar jalapeño biscuit was so dry I had to ask for butter just to eat it. We also ordered food to go for our significant others and when I got home the bottom bun of my chicken sandwich was rock hard. (Two stars because we finished our food as to not call attention to anything) I had to look at the lowest reviews to see if what I’m talking about is not just a me thing or a bad day."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toc01VRTBiVGgzYUhaMWNXSkRZaTEwTTBwdmRrRRAB",
            "text": "Just to have a drink on a Wednesday night. The Yankees game was on which was a +"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MWNTMUtWVWMwV0dOMFpsRjRSMHhTZDBSQlYxRRAB",
            "text": "A cozy place with great sandwich’s 🫰🏻"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeWJucFBTMFZsYmpoRVRYQTNValF5WTNSQ2FrRRAB",
            "text": "Great food. Great service. Will come again."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclFXMWxjbXRHVlVsM1FYVmlkUzEyWVRoblNWRRAB",
            "text": "The owners and staff are all very welcoming. The chili is very good, as well as everything else on the menu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeVYwOHpZV2hLWlVkR1UwTk1aRWRzTTA4d2QyYxAB",
            "text": "The best of the best — Blueberry Ricotta Pancakes and the Jala-cheddar Biscuit are staples, but everything here is worth trying. Complete with the friendliest staff, outdoor seating, and beer on tap, EHBC makes for one of my favorite brunch spots in the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTGVHODRSV2RGYVhZeVlVOWlVSFZ5Tms5eWNFRRAB",
            "text": "Great neighborhood spot. Solid tap list. Tasty eats"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTUxYazNaemRsV1ZObFFWVnRTRzlSV21aR1RtYxAB",
            "text": "I love this corner spot in east Harlem. Service is great, servers are very attentive and friendly; the food is great and so the drinks. They have an outdoor patio which I have been enjoying this summer after work getting back home. If you want to go to a very local casual quiet spot to hang out, solo chill or dine with your partner, this is the place :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Od1ZXczVaRnBzWjJKZmMxSlRNMW81U214UmJFRRAB",
            "text": "super friendly! loved the pancakes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMFkyWlROV1V6TW05WGJtUkxlRXRtY2xwVFVIYxAB",
            "text": "What a lovely time!! Great wings/pickles/fries, and most importantly... good beer!!!! Corinne is a fantastic, extra-personal server. I will highly recommend this place, especially if she's working."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVFVdGpVbmR0UzJsNE1USjBMVGRCY1U5M2NrRRAB",
            "text": "Stopped in for an unplanned snack and bev.  It was such a great find!  Staff are awesome, the options for food and drinks were excellent.  It happened to be cool enough to sit outside and we loved it.  Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMWNVcENaRWMzWDI0elMxOVZjVEZpVEdnMGIxRRAB",
            "text": "The service was A+ and the food was great. We ordered the beer battered pickles. I was expecting a small amount but that was more than enough for two. My date had the chicken sandwich and she loved it. I had the fish & chips. I was so full I couldn't finish it. Great quantity for the prices and it was a nice vibe. We are definitely coming back and next time I'll be bringing a bigger appetite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbmJuRXhhVTV4YXpaUGJuRmxkbkpUUkdscVFWRRAB",
            "text": "It’s always top notch food, drinks and service. The owners are very welcoming and the staff is always very friendly with great service.One can meet friendly customers at the Bar if you are solo.\nWent in there after a while and had missed their burgers. Ordered medium-rare and was cooked to perfection. Great indoor and outdoor atmosphere.\nIf you go with your motorcycles then there is street parking and you can see your bike from the bar. Just wouldn’t leave helmets or any valuables on the bike."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMlVFWlFVSFZSYjB4aWFuTTNhblJrZG5jMk5sRRAB",
            "text": "It was my second time here today, and both times have been great. Everyone who works here is so hospitable - today they pulled down the awning to keep us in the shade without us asking - and the beer selection is always fantastic. As someone who doesn’t often review places, this is somewhere worth reviewing and revisiting :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd2R6SlVjMGs0TWxGRFMwbHpjSGR0VVhsaVRVRRAB",
            "text": "Great place in East Harlem for a bite and a cocktail!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRlRWTTVhVTAwTWxZNVlrSnRNR2R3VkdkVWJsRRAB",
            "text": "Good for what it. Pretty gentrified for east harlem"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVFIyTktSM0pEVjBkNFlWbDJhSGhtVG1OUGVGRRAB",
            "text": "I took my kids here after school for some food. We ordered a medium well burger for my son and chicken tenders for my daughter. The burger was well done bread was foggy, chicken tenders was a chicken breast sliced into strips and blend ! The cook needs to be fired! . I will not be back here !! I do not recommend this place for food , that’s coming from a cook myself!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVlJHaExaRkprZUVWUGR6TjJVVkV0T1VsVWVFRRAB",
            "text": "Not cool setting up shop in our neighborhood adding to the gentrification. Unless this place is giving back to the community, there is no reason why this place needs to exist in our neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wemVqSlZPVTV4TW5SelJ6RmFNMFJaU3pGRVdYYxAB",
            "text": "So friendly and attentive!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlptd3dkM0UxV25sbE5rcGlOMkV3TFVsRlpsRRAB",
            "text": "Hands down the best Brunch!!! We come up from Upper East Side most Sundays just for this Harlem Gem! ❤️🌈"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUE16RjNiakJtVFVWcVNYaG5NM05xTFdGRE1WRRAB",
            "text": "Place is nice until you eat your food. Steak was smelling VERY bad like all the rest of the meat ordered (chicken wings, fish sandwich). Even the salad had a weird taste like rotten/very low quality. It doesn’t take much to serve a decent salad! And the food is SO BAD means that you really don’t care about it. Never again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU1VtY2k0d2JTS2pnRRAB",
            "text": "Nice place.  Good selection of craft beer.  The t-shirts look nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMM1Vyc192ZzctbXRnRRAB",
            "text": "East Harlem Bottling Co. is a must-visit when in town! Whether I'm catching up with family or just stopping by, this spot never disappoints. The food is fantastic—I highly recommend the steak frite and sandwiches, especially their delicious Po' Boy. The drinks are great, the service is always on point, and the vibe is welcoming whether you sit indoors or out on the patio. If you're in the area, don't miss out—this place is a gem!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS0I1clA2bXUySU5REAE",
            "text": "Muy amables los dueños"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOM1R0T1Rld1lXSjBRRRAB",
            "text": "After visiting a dear friend at Mount Sinai on 99th St, we needed a good nearby eatery before the late night drive back to Brooklyn. I searched and lucked up on the East Harlem Bottling Company. The name was intriguing, but to learn that they we open until 12AM (on a Monday) was greater appeal for us,  The food hit the spot! 👏 👏 👏 Delicious !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNbmtnNVd5c182R0NnEAE",
            "text": "We like the fried pickles, fried chicken sammie, and all the different beers on tap options! The servers never rush us, we've been here multiple times and have been able to take our time and chat. One of the times, their AC was leaking in several different areas that we had to move seats twice, though"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNllydTdqM09QVFN3EAE",
            "text": "Ah man, this place is awesome! We went to watch the Knicks/Pacers Game 2 (I don't want to talk about it) and had a blast.  the staff is attentive and friendly. the food is amazing. I highly recommend the pretzels and carrot ginger soup. GREAT atmosphere.  A real neighborhood gem!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVEIycW53dUxDTnZnRRAB",
            "text": "I’ve been coming here for a few years now and I’ve loved it each time. The EHBC burger is really great and I love their fries! They always have a great selection of beers on tap and their staff is friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJU2tzclhfdllIamNnEAE",
            "text": "Always a good time. Great beer selection and great bar food. I gave the food a 5/5 BUT the new radicchio fennel salad could use some walnuts."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWFMtT09NeWVHRWdBRRAB",
            "text": "Really good food, with a nice comfortable ambience in a big city, all in all a five star rating from me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXZhZUVREAE",
            "text": "Absolutely stellar brunch! The tunes, burger, beer selection, and fried onions side were all incredible. Special shoutout to our server Cindy is much deserved; she brought all the best vibes and best recommendations. We will definitely be coming back!"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1pYZl9BRRAB",
            "text": "Très bon moment, bon plat, bonne bière et accueil super"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcVBXUnB3RRAB",
            "text": "Overpriced bland food and found a hair cooked in the battered pickles. Servers were overbearing and came to our table every 30 seconds and it was uncomfortable. The cocktail wasn't good either. Don't recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc1lMdG9RRRAB",
            "text": "more diner style food than a real restaurant-save for their appetizers which are not that good-sorry!…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXR2NUJnEAE",
            "text": "Absolutely delicious food, highly recommend the butternut squash soup made with browned butter."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJX1B2NjhBRRAB",
            "text": "East Harlem Bottling Co. – A True Neighborhood Gem!\nI can’t say enough great things about East Harlem Bottling Co. Darcie and Leo have created something truly special here—this place isn’t just a restaurant bar, it’s a cornerstone of the East Harlem community. They’ve always shown me, and  my lovely family nothing but warmth and respect, and it’s clear their hearts are in this place.\n\nThe food is consistently amazing, the ambiance is unmatched—truly like no other spot in East Harlem—and the vibe is always welcoming. Whether you’re stopping in for a meal or just relaxing with a drink, the experience is always top-tier.\n\nSpecial shoutout to the hardworking staff: Cindy, Ramon, Zack, Andrea, and the entire kitchen crew. Your dedication, professionalism, and energy bring the whole place to life.\n\nEast Harlem Bottling Co. gets my highest recommendation—this is the kind of place that makes a neighborhood feel like home since day one."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcjVIQVh3EAE",
            "text": "Love the chili and the sausage! Good beers on tap, too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cE42TXN3RRAB",
            "text": "Amazing spot. Feels like watching a game in your living room with an amazing kitchen and bar to keep you full. Great staff who wants you to have a good time while you’re there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReThpczVnRRAB",
            "text": "First, it's intermittent cozy the staff is very inviting. The food is delicious and so are the drinks. You have to try the hot apple cider tati ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzlpZ3JRRRAB",
            "text": "Fabulous choice for brunch while in town for the weekend! The Bloody Mary was a top 3 for me, and hubby enjoyed trying a couple drafts. Would return in a heartbeat"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOGFxLXNnRRAB",
            "text": "Great neighborhood joint. Love their burger and fries. Good selection of beers on tap. Friendly, attentive service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbFp1LTZnRRAB",
            "text": "I was there this past weekend. The drinks and service were alright, it's the food that needs to be addressed with the utmost urgency. I had the pear flatbread and my boyfriend had calamari and steak frites , I'm sad to say the food was horrible, inedible horrible.\n\nThe batter for the calamari was bland and unseasoned. The steak was rubbery and bland with the green chimmichuri looking sauce plopped on like something from a school cafeteria. The flatbread (deep sigh) looked like they warmed up the bread for a few seconds straight out of the package then plopped the ingredients on top which had no flavor. I think the pear doesn't need to be warmed up because it wasn't crunchy , it was this warm soppy limp brown thing; not to mention the presentation looked unappealing.\n\nAgain friendly service but I'd only go back for a beer, the food needs serious attention."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbUk3eW9RRRAB",
            "text": "Allowed myself to chill & splurge on a hazy IPA & a porter, because I hadn't hung out at a cozy yet comprehensive local bar & restaurant like this since the early 2010s or so. Fun!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaG82akZBEAE",
            "text": "Cozy place for dinner and drinks. Excellent food and crafted cocktails. Friendly and professional staff. Highly recommend 👌🏼"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaXItUlh3EAE",
            "text": "Great neighborhood bar. Large selection of interesting beers. Generous food portions. Good pub fair and specials."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z2FuTGV3EAE",
            "text": "Wonderful people 🥳🥳🥳"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaEw3WU1BEAE",
            "text": "Quelle belle expérience! Nous étions de passage à Harlem et avons découvert ce resto par hasard. Dès que nous sommes entrés, nous avons eu l’impression d’avoir été accueillis par des amies! Les deux serveuses étaient super cool, aimables et vraiment sympathiques. Nous avons été ravis par l’excellent choix de bières et par le menu d’entrées, de plats principaux et de desserts qui étaient tous alléchants. Bref, nous avons bien mangé et nous avons passé une soirée mémorable! Nous aimerions y retourner pour essayer leurs brunchs, qui apparemment sont très bons aussi."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscV9PQUdnEAE",
            "text": "One of my favorite neighborhood spots. I mostly come here for brunch (try the soju Bloody Mary!) with friends but dinner is just as delicious. Staff is awesome and makes this restaurant even better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aFptcDJ3RRAB",
            "text": "Chill brunch spot in East Harlem, indoor and outdoor seating. We had a reservation but seemed like a walk-in would be fine. I had the shrimp and grits, very tasty!, came with bread too, and my friend had the burger, with fries at an additional cost, which she said she enjoyed as well. We both liked the white passion fruit sangria. Great price, great food, great service. Would come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNmU3cnRnRRAB",
            "text": "I really enjoyed this place. Joe was so cool and the food was great. I was talking a lot with my friend and the music was low enough that we could hear each other but I loved the tunes that was playing. Had I been a bolder person, I may have started singing.  Lol Me and my friend decided that we need to stop here more often. All n all,  a great vibe"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcklXME9REAE",
            "text": "Best calamari I have ever had in my life , lightly fried and so tender. Absolutely a work of art. The beer was a local one which hit the spot just right. Then rhr burgers that were flavorful and well balanced. Over all if I can give a 6th star I would cause my experience was also very good nd the food came out in no time at all"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3a3N5T3pRRRAB",
            "text": "Hugely disappointed that the happy hour was only for those sitting at the bar but, the drinks at the table were good, although, they cost more! The pacing of the food was good and the appetizers were great. I recommend the prosciutto & fig flatbread and the braised chicken entree."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbnJ1dzJ3RRAB",
            "text": "upon arrival, we waited by door for 7 mins. The bartender and waiter were chatting away. We were seated  after, and they realized we were there. We ordered Buffalo wings, the wings were good, and then the main course came out. the churrasco was really tuff and had no flavor and the chimichuri sauce was blended like sofrito so that was a fail the house mac cheese had no flavor at all very disappointed I had box mac and cheese that was better than this. The house blend burger was good, no complaints there... bottom line, the burger and Buffalo wings were good. Everything else was not worth it. if you guys want some good burgers and Buffalo wings, stop by. As for me, I will not return"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeE5qREZREAE",
            "text": "This place was so pleasant. It's very kid friendly. I took my niece to enjoy a nice brunch and she really enjoyed herself.  Everything as we were saying was chef's kiss, delicious. We will dine here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwanRPWk93EAE",
            "text": "Happened upon this restaurant for lunch.  Great selection of beers on tap and bottled.  Food was fresh and oh so good. Service was the best.  Fried pickles were perfectly battered and sour the fried asparagus was delish never seen such large sticks. And the fried chicken sandwich was perfectly cooked, nice piece of chicken breaks and the Cajun remoulade tops it all. Could dip everything in that.  Will definitely go back!!"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc056OXJRRRAB",
            "text": "Ottimo sia a pranzo che a cena, questo posto regala un’ottima cucina americana in un ambiente informale in cui si guarda lo sport e si beve ottima birra."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcmFDS2ZnEAE",
            "text": "Been wantingbto try this place for a while. Now having been here I'm bloody annoyed with myself for not having tried it sooner. It ticks all the boxes. Great drinks, great staff, great service and great food. Oh and just for the piece de resistance the music is great as well - and not too loud. Definitely a 10/10 bar and the best I've found in Harlem. I will be back for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyay1DanFnRRAB",
            "text": "Came by on a cool spring afternoon for some beer. We sat by the window for some people watching. Ordered a few IPA’s, a few tastes and enjoyed the prosciutto fig flatbread. Server was KYLE and he was awesome. Just down to earth- attentive-…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSXy1mb2dnRRAB",
            "text": "When I walked in I was greeted like I was an old friend that the staff had seen every day of their lives. Felt so welcomed from the get go. Only stayed for a couple of drinks but the vibe was so right and the staff and owners were so…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ1p6RDdRRRAB",
            "text": "I just left this restaurant, and I had a really good time. Here ,the bartenders and servers are really nice and care about the business. It’s always like one happy family there…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1eHJYN1ZREAE",
            "text": "We love our neighborhood bar! EHBC has great service, great food and great beer. That’s why we chose to have our engagement party here, and everyone could not stop talking about the cozy atmosphere and delicious food. Darcy is the best and helped us put together a great party without any hiccups."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MEl6Rl9nRRAB",
            "text": "East Harlem Bottling Co. stands out with its exceptional service, affordable and diverse drink menu, and a culinary lineup that fuses traditional delights like fried pickles, calamari, burgers, and fish and chips. The appetizers, from crispy fried pickles to tender calamari, set the tone for a memorable meal, while the burgers and classic fish and chips are executed with precision and flavor. For those seeking a place to enjoy both a great time and delectable food in Harlem, this establishment is a top-tier choice that guarantees a delightful experience."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3anVEeHd3RRAB",
            "text": "Had some beer with my friends several days ago. This bar was also where we had the last dinner before leaving NY. It's a small bar with a variety of beer, draft, and food. You can have some beer while listening to songs from 70s to 80s,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX3NPaDZ3RRAB",
            "text": "The food was good - we had salads and added protein that was a good, generous portion.  The Nachos was delicious. The ice tea was overpriced ($5) given they never offered to refill my glass. I mean c'mon. AOC for presidency as usual. Trans lives matter. Be kind."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjNjYyVFJBEAE",
            "text": "Really good hamburger! Awesome fried chicken sandwiches and very good draft beer selection! However, the cheese curds too expensive and not up to par compared to WI and MN quality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiak9TY2xnRRAB",
            "text": "High variety of beers on tap and in cans. Catskills Devil my favorite one on the tap. Cocktails are pretty noic and looks gorgeous. Old fashioned was with the aroma of citrus 🍋‍🟩 and even in warm weather it refreshes with its slightly citrus taste and good bourbon with demerara surrounded by ice cubes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4XzVHTFF3EAE",
            "text": "Plenty of draft beer options and delicious food. Nice location in East Harlem. Very kind service and good prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaEliWEdREAE",
            "text": "What makes East Harlem Bottling stand out is the friendliness of its service.  The staff engage with customers and seem to have fun in doing so.  Other craft beer venues could take a lesson here…doesn’t matter what you have on tap…it’s in the service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMEtlUnJ3RRAB",
            "text": "Loved it. Got helpful tips on a fall drink to taste. Friendly, fun and  knowledgeable staff. I loved hearing music that i listen to while I was there. Seems like an easy place to stop in for a bite or to catch a neighbor or game."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdTZXN29BRRAB",
            "text": "Stopped by for brunch this weekend and the place had a nice buzz. Lots of TVs for sports if you’re into that. Outdoor space was nice and comfortable and the service was excellent throughout the meal. The Bloody Mary was freshly made and…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NS15dFNBEAE",
            "text": "Consistently delicious ♡ Great selection of beers. The Brunch options are amazing. Blueberry pancakes rival Clinton Street Bakery's pancakes."
        }
    ],
    "reviews_count": 75
}