{
    "name": "Barawine",
    "place_id": "ChIJ_WGAABL2wokRNthCl_PuyFc",
    "grid": "MN11",
    "address": "200 Malcolm X Blvd, New York, NY 10027, USA",
    "rating": 4.3,
    "user_ratings_total": 881,
    "phone_number": "(646) 756-4154",
    "reviews": [
        {
            "date": "3일 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podFpHUldiWGhXUms1UGVVbGtOVEZ2WVVvdFQxRRAB",
            "text": "Un vrai plaisir gourmand au Barawine Harlem ! Nous avons dégusté un excellent repas français, savoureux et généreux, digne des meilleures brasseries de Paris. Les plats étaient copieux, bien présentés, et le personnel vraiment attentionné et chaleureux. Une très belle adresse pour partager un bon moment en famille dans une ambiance conviviale. Je recommande sans hésiter !"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreFUwOVplVzVPZVRodlpYQjZVVVZaZGpCc1JXYxAB",
            "text": "Great food but bad service (inattentive and low enthusiasm) and the chairs are TERRIBLE. All of the bar chairs have a leg that’s off balance and seat cushions that are slightly tilted down so you feel like you’re falling."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVlJtZG1helpqZUY5elZGRjZhR3Q1VEZOb1NHYxAB",
            "text": "I wanted to finally visit the little wine bar, not far from my new home and do some work this evening. I wasn’t super annoyed when the water was poured so high that it overflowed on my clothes, or when I ordered a glass of wine and was brought out the incorrect one  or when they brought out the wrong food order, or even when I asked for the check three times. I was disappointed when I saw that a gratuity was added, and I was a solo Diner. Perhaps this is a practice because they have sadly encountered multiple people who were not considerate enough to tip however, as a restaurant and Bar Owner myself, it is a minimum requirement for me to tip 20% even when the service is mediocre. I generally tip 40 to 50 as a practice when service is good. I don’t know what to attribute the need to add a gratuity for a party of one, but I at least took solace in knowing that I tipped the back waiter more than the gratuity that was offered from the server. My hope is that the owner or whomever the decision-maker is reads this review from a fellow Restaurant Owner and simply does better so that customers don’t feel as unappreciated. Again, if this has been a common practice and several servers have left without being adequately compensated, this action is justified. I can only express how it made me feel."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV2N6TlplVk5HV0RkblptbGZXRlptVVZGV1VrRRAB",
            "text": "A cute little vibe just go get you some wine and chill inside there. I really like the vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbGJtNHlOMjVJWkZSRlYzbzNVMkkyU0c5SFRsRRAB",
            "text": "The service here is deplorable.  Last night around 8:30pm Sunday 9.21. The bartender wasn't welcoming, no greeting or hello and then proceeded to chat with guests at the end of the bar for an extended period of time. Completely ignoring my friends and I waiting to place our order. Then my friend asked if we could order and one of the servers (Russian girl with a bun) said she's not responsible for taking orders and said the bartender is busy and to just wait. She gave us an attitude and was really rude. Then we just decided to leave and she continued to argue with me and go back and forth about it. i've never had an experience like this at an establishment and it's my 1st time writing a review! I will NEVER go back to this place. Really bad team and they need to rework their staff & management. ASAP."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gck5WZFRiVWQ1YkRWdGJ6QkdaVXRxVVhkcVdIYxAB",
            "text": "Burgers good, fries decent, ambiance good, servers kind. The Caesar salad tasted like something out of a bag, maybe it was? The crackers were stale on charcuterie board."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNGVESm5VbWRhWVhKU1VHRmxkemxVWm14dkxYYxAB",
            "text": "Hot night in New York. We decided to have dinner indoors, but the air conditioning was off, which made it quite uncomfortable. The Barawine Burger was very tasty, but when it came time to pay, they had already added almost a 24% tip with no option to change it, and then they asked for an additional tip on top of that. This was our second time here, but we don’t think we’ll be coming back because of this abusive practice of trying to charge customers extra tip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVWFHbHFOMjh5TVhkeE0zSm9aVk00TkV4SVUyYxAB",
            "text": "I went to Barwine on Lenox Avenue in Harlem with my friend and her husband, and it was such a nice experience. The place has an upscale but cozy vibe—very clean, stylish, and tucked away in a great spot.\n\nMy friend’s husband ordered the leg of lamb, my friend had a steak, and I went with the chicken Caesar salad. Everything looked amazing, and we all agreed the food was delicious. I had to drive, so I just had a ginger ale, but it paired perfectly with my meal.\n\nIt wasn’t too busy since we went kind of late, which made it even better—calm, relaxing, and a perfect setting to enjoy a good meal. The service was on point, and overall I’d give the food and the whole experience a 10/10.\n\nDefinitely a place I’ll be coming back to!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMk1Fc3hlV2xzTlZVNWFYcDFSR1paUzJ4ellYYxAB",
            "text": "Food was bad\nService was bad but we still had to pay for it 20$\nI don’t recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMGNETk9RekZ2WW5aUmR6aGZUMFJaU1VkNlVXYxAB",
            "text": "Average food, terrible service. Our waiter kept forgetting about us so I had to track her down multiple times. I could understand if the restaurant was crowded, but it was fairly empty. I will never eat here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MFduVk9iRUZTUVc1cVdFNTVkRGwyZEVodmNHYxAB",
            "text": "Can we talk about the sloping bar seats?!!! Like WHAT?!  Wine selection is subpar.  Sangria is your best option. Food, meh!\nHowever, great location to ppl watch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Uk1XdGxkMnMxVG5oV1R6aFRlV2RpYzJWQ01rRRAB",
            "text": "The first going there and had a wonderful time. I don't even eat vegetables and I enjoyed it. The food and the serves wonderful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dFFqaERXWGh1UzJkMWJuTjNjRFE0YXpoUk5sRRAB",
            "text": "Food and drinks were great.  Will be back again when I visit Harlem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWVJXYzRTelF4U1VWblJGTmZSVVowZWpKeGFIYxAB",
            "text": "There’s a point of France here in Harlem. The ambiance is cozy and warm with ambient lighting and great drink specials at the bar. The house Rosé is delicious and a nice pairing for the season. We went for Valentine’s Day and there is not any strangers here just folks you never said hello to. Wonderful date night atmosphere and nice size portions with a French flair!\n\nDon’t walk, run here and stay a while."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbmVFUjRkMkZJU2xKclNsQktjbVZEZW1FNU9FRRAB",
            "text": "One of my to go to places in Harlem, beautiful looking lounges .\n\nOnly negative I have is that the service is inconsistent.  Not sure if it the lack of staffing. But overall I still love the spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKTDVzcFRrajV1ZlFnEAE",
            "text": "The service is horrendous. The bartender (tall, maybe Russian guy?) was so rude to multiple groups of people, it was unbelievable. Just a bad attitude and condescending like customers were a bother to him. Why the owners have him there for that crowd is questionable anyway.\nBusboys constantly interrupted family dinner randomly picking up items still being eaten.\nThe waitress was stressed. Never said hello and plopped the bill down mid-bite saying she had to go. Good wine selection. AMAZING food. Great location. Good vibe from the neighborhood. Absolutely horrific management and service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQMnhxNmY2aW9mS2VBEAE",
            "text": "The food was delicious, however, the service was unfortunately quite poor, which detracted from our overall dining experience.  Our server was often unavailable, and at one point, it seemed our order had been overlooked.  This occurred on a Sunday evening when the restaurant was relatively empty, so we can only imagine how challenging service might be during a busier period."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLWNwYjdKd2V5bXlRRRAB",
            "text": "Absolutely Love this place. Great food. Dope vibes & drinks"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNdUdxNkd0cnVQU2hRRRAB",
            "text": "Got an order of french fries, a caesar salad, and two margaritas for $75. The margaritas which were made with triple sec and sour mix and poured into tiny glasses were $17 EACH. If that’s what you’re charging for a tiny margarita, then squeeze your own lime juice, use agave, and use a better tequila. Extremely overpriced for what it is. The food was good but also really overpriced. Wouldn’t visit again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS1U5YkN6eVlHOTVBRRAB",
            "text": "The waitress was excellent. She appeared to be the only waitress working in our area but the busboys were super attentive and cleared dishes quickly. We had the branzino which was very seasoned, when eaten with the tomatoes and asparagus the bite was flavorful and not salty. There was a DJ and the bar area was crowded and a bit louder but the seating in the back was nice. The reisling was on the sweeter side and the Harlem mula was not great but I think that’s because of the sour mix. The tiger prawns were small but the garlic butter sauce was really good. It would be great if it included bread to sop up that sauce. Overall the ambiance is super cute and the music was a vibe. Great date night spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2RhU1R3EAE",
            "text": "I finally had the chance to check this place out, but I was quickly let down by the hostess/waitress. She wasn’t friendly at all and seemed irritated that my friend and I were even there. I ended up asking to move to the bar, where the bartender was absolutely wonderful. He offered great food and drink recommendations and did it all with a smile. Throughout the evening, I noticed the same waitress greeting other guests with a similar unpleasant attitude, which made the atmosphere a bit uncomfortable. I completely understand that everyone has personal struggles, but it’s important to leave that energy at the door when you’re at work. No need to go over the top, but a simple smile or hello makes a huge difference. I might consider giving this place another try sometime in the future."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvemVLb1V3EAE",
            "text": "Amazing dining experience from beginning to end with a wide range of tantalizing dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveGFpa1V3EAE",
            "text": "First impression, great atmosphere. We were greeted warmly in the beginning but once our food came customer service was limited. Rubbery tasteless calamari, wings were just ok, and margarita was lacking. overpriced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbU1HRVNBEAE",
            "text": "Friday night’s with Dj Omen and bartender Filip are just the best! It truly turns into the great party."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNlBPUTJnRRAB",
            "text": "First off, the service was PISS - POOR!!!++\nWe had to ask for condiments four times and still didn't receive the butter i asked for, for my French toast, that came 8 minutes later than my egg whites. IHOP and Jimbos taste better than the waffles and French toast i had here. Maybe it was an off day, or this is a spot for drinks 🍸 and wine.  For the price, it was a huge let down and I didn't see or taste what the hype was about.  It was a disappointing meal, and more so the service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLS1TVjZ3RRAB",
            "text": "This is my first time visiting and it was exactly what I expected. I had the deep calamari and wine only but even with these choices. It was soooo gooddd. I will be back again to try the lunch/dinner menu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z0xqeWxBRRAB",
            "text": "Snagged a late night reservation to celebrate my birthday and the food was absolutely horrible. Rubbery escargot with a sour taste and the mac and cheese completely overpowered with truffle oil. The potatoes served with my steak were saturated in truffle oil as well. Service was rushed and spotty. The drinks were the only saving grace. Definitely not a great experience and won’t be returning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRODZYRG53RRAB",
            "text": "the service was definitely off tonight; sat at the bar not hospitable at all. i’ve wanted to check out barawine decided to go tonight and was really disappointed. the server behind the bar was not welcoming then he took back someone sangria drink and pour it back into the big jug on the bar infront of us. Unacceptable, when we told him that was unsanitary he was dismissive and said the customer didn’t touch it but once you took it out to serve a customer you don’t bring it pack to give someone else."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncmFiT0dnEAE",
            "text": "$9 for a glass of a $6 bottle of wine (“happy hour”)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0lhc05BEAE",
            "text": "Amazing vibes. It was a lovely curated experience for Valentine’s Day with a delicious prefixed menu for Valentine’s Day with a great selection of drink. The ribeye was delicious and the music was great.and lastly, shout out to Sade. She made sure we were comfortable and accommodated. Make sure you ask for her!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM0k2RzdRRRAB",
            "text": "This place was really good for Valentine’s Day."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0lieFVREAE",
            "text": "Had a great Galentines here. Shoutouts to the waitress Sade! She was a 10/10!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM05xQVZREAE",
            "text": "I had the best time ever! The food, drinks, and service was amazing. Sade was the best waitress. She was so attentive and fun. I highly recommend this place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaDkzUjZBRRAB",
            "text": "Just had my valentine reservation canceled.  I was called last night to see if I had heard about the prefixe menu, and to get back if interested in that.  No mention of deadline to decide, did not say we could only order the prefixe menu.  Just left a message saying the reservation is canceled. I haven't even had a chance to talk to my boyfriend about it yet."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMjgyVU1nEAE",
            "text": "Barawine is our favorite happy hour spot, it is just a few blocks away from all the hype where everything slows down a notch!\nBurger, goat cheese salad, glass of wine and chill vibes is what we have been coming back for!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfamZubUxREAE",
            "text": "Abou was the most amazing server. Very attentive! The dj was great the place has a nice ambience. Will definitely be back !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOVkyaFBREAE",
            "text": "Definitely a must. Abou, my new favorite bartender was on point, very attentive to me and my guests and drinks are on point. Food was amazing and especially since I love lamb. Dj was playing some classic tunes. Highly recommend it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOWNYck53EAE",
            "text": "Barawine did not disappoint. We walked in on a Saturday evening without a reservation and sat at the bar. I ordered the escargot, branzino, crème brûlée and the French Velet (martini).  Everything was delicious.  Abou took great care of us at the bar.  Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGN1dHp3RRAB",
            "text": "The atmosphere is wonderful and the service as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc1l2SjZ3RRAB",
            "text": "Barawine is a great local wine bar! Have never had a bad time here. Service, drinks, and food are all great. Abou took great care of us!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2ZPWjlRRRAB",
            "text": "Meticulously prepared meals, attentive service provided by Abou and staff, replete with an alluring late night ambience,"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdHRYTU9BEAE",
            "text": "Abou was a great server. He was very accommodating. Food was fresh and I loved the ambiance of the restaurant. Definitely will be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdG9xMEdBEAE",
            "text": "This is my favorite place to come and unwind. The food, good wine, and great music keep you coming back. The staff are also very hospitable."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NUlUUjBnRRAB",
            "text": "Nice spot for brunch or cocktails, but I would appreciate more non-pork options for the charcuterie. I’m not sure if the server was new the last time I went, but she messed up our order a few times. We didn’t hold it against her, though, because she was very pleasant and friendly. I would’ve given the atmosphere a higher rating, but they were playing loud music for brunch, which didn’t match the setting nor Harlem on a Sunday morning."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM2F2dkVnEAE",
            "text": "We got chatting to a lovely girl and enjoyed our visits 😊"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHQ3MTdnRRAB",
            "text": "Loved this wine bar that has a full service bar!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMDlPMTd3RRAB",
            "text": "I've been here several times.  The food, drink, and atmosphere are very good.  However, the service could be better and a bit more welcoming."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbmRIRjJRRRAB",
            "text": "Love the vibe in this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdTcybUl3EAE",
            "text": "Great place!  Live DJ on Friday night."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcy02SllnEAE",
            "text": "I ordered the lamb shank and they served me a turkey leg. When I questioned the chef as to why I was served a turkey leg I was told I was mistaken and the turkey Leg was really a lamb shank. The whole thing was so ridiculous it wasn't even worth debating. At least it was a tasty turkey leg masquerading as a lamb shank."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2NMZUJBEAE",
            "text": "I live on east harlem and love this restaurant on west 120st street. The wine selection is great and vegan food has improved over the years. I always have a quinoa salad with that is perfectly seasoned and today had a tomato bruschetta that was incredible with some rose Wine . Music and the service  it is Always great.  I highly recommend you come to this restaurant !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENUoyaThRRRAB",
            "text": "I can’t believe I’ve lived in Harlem for this long and only just now visited this restaurant. The food was absolutely amazing, and the service was fantastic (shoutout to Filip). I’m always hesitant ordering lamb dishes at restaurants because of how often they get them wrong, but I’m so glad I ended up ordering it. Perfectly fork tender, and the sauce it was served in was divine"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdnVPSFVREAE",
            "text": "Pleasant smallish restaurant and bar in a beautiful area of Harlem.  The food was very good and the outside seating was perfect for nice weather. Who knew?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaFp6TFJ3EAE",
            "text": "I love Barawine. Such a great vibe and delicious food. I absolutely love their truffle fries. They are insane. The steak was delicious and so was the ravioli. I hear it’s really fun on Saturday night so I will definitely be back !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGeDRyV3J3RRAB",
            "text": "Made a reservation online for 7:30 and was seated right away. I did call to try and change my reservation multiple times but was unable to reach a person\n\nFood\nFrench onion soup was cheesy and scrumptious\nThe sauce for the ravioli had a tart taste that I just couldn’t get with\nLamb shank was delicious and mashed potatoes were good\nMy drink was horrible - Mezcal Negroni\n\nAtmosphere\nThe space is very nice and intimate. There have a space for those interested in happy hour and drinks in the front and in the back they have space for larger groups. Also have outdoor seating. Good date night and family dining spot.\n\nService\nMy waitress came over every time I asked for her attention, which was refreshing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX09lSDRnRRAB",
            "text": "I've seen this several times walking by and finally decided to try it.  Made a reservation via Open Table same night which was great.  Arrived about 25 minutes early and we were sat right away. The hostess was very friendly as well as the waitstaff.  Order two glasses of white wine and I didn't take the name down.  For meals, we shared the French Onion soup.  Now you must love cheese...because it had the most cheese, I've ever seen on top of French Onion soup!  I did like that there was enough cheese to have some in every bite..so no complaints here.  Escargot was next up and tasty....the bread dipped nicely into the leftover butter sauce.\n\nThe didn't have the pork tenderloin as stated on the menu, substituting with pork chops.  I can't recall the last time I've had a great pork chop, it was delicious!  And the sauce could have been more it was soooo good.  Lamb shank was the second entree and didn't disappoint with the polenta on the side.  Gravy/sauce was to die for.\n\nNo dessert on this round...but I will keep in mind an try other items on their menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcWFuUHNnRRAB",
            "text": "Excellent food, excellent service, great ambience.  Perfect place to go for a business lunch/dinner. I got the burger and the French onion soup.  Both were amazing. For dessert I also got the chocolate lava cake with a scoop of vanilla ice cream. You will love this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaFBXb21RRRAB",
            "text": "Made reservations for Valentine's Day here and was absolutely blown away. The ambiance was great made for a great date. Food was delicious and portions were the perfect amount I left feeling full but not bloated. Also enjoyed getting try something a little different. Service was also spot on I will definitely be coming back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMWZuZTJ3RRAB",
            "text": "Such a great place, I wish I knew about it sooner! We had the salmon with mushroom risotto, the mussels, and truffle fries - everything was SO SO GOOD. Flavors were amazing and cooked perfectly. We also had the Sangria that I was pleasantly…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM3JhZm93RRAB",
            "text": "The food was great. However, the service needs to be improved. I knew this would be a crazy experience when the bartender asked if we had a reservation. Two thirds of the restaurant was empty.\n\nIt took 20 minutes for someone to ask what we wanted to order. This was only after I flagged someone down. Once we got our food 45 minutes later, no one checked on us. I had to ask for syrup for my french toast and for someone to refill my water. I felt ignored at this place.\n\nThen they had the nerve to throw on a $14 tip and a 3% credit card fee. It's rare that the service is so bad that I ask for the tip to be removed. But I did and left nothing. I didn't have an assigned waiter so whomever it was didn't communicate to me. With all of the restaurants in Harlem, if this lack of service continues, I doubt this place will survive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaHBLcUd3EAE",
            "text": "Great food and service. Loved the bara fries, escargot and risotto. Good selection of wine, fairly priced. Can someone PLEASE do something about all the fruit flies please?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteGZIMkZREAE",
            "text": "I always pass this place and wanted to stop by so we went for a brunch.\nFood, mimosas and service were great. Egg Norwegian very recommend. It was some live music inside and not so loud luckily to have decent conversation\nI had to take off 2 stars from 5 starts for 2 things:\n- we have billed gratuity automatically for our party of 3, when menu says it applies for party of 6 and more. We almost left double tips\n- they charge 3.5 % credit card surcharge. Good places normally offer 3% discount if you pay with cash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNkpYUzl3RRAB",
            "text": "The food is good, a bit expensive but the place is very nice.\nI just don’t recommend this place for the fact that the waitress is charging 20% tip : they say that it’s the policy and we can’t change it. + 3% charge if you pay by card : for a bill over than 40$ per person\n\nBad experience at the end!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMWZLTU9nEAE",
            "text": "We came here on our first night in new york. We were greeted in and offered drinks (the first problem) We ordered a pint and vodka lemonade, we were brought a sprite with no vodka. We then ended up getting the vodka and ordered our food. Steak and fries. The “first” meal came out and I started eating about about 10 minutes still not another plate.. we asked about it and they assumed we would be sharing one steak and fries… so then we had to wait on a second one being sent out to be eaten. The steak itself was lovely but waiting 20 minutes between each person eating it’s crazy?\nWhen it came to paying they claimed the card was not working, 3 different staff attempted to “pay with the card” we ended up taking the card machine ourselfs and it magically worked!\nWe did not sign for a tip as it was absolutely insane what we went through in the short time we were there and yet they still took a 26 dollar tip from our card? We will not be returning. 170 dollars was not worth what we went though"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaTZhWi1RRRAB",
            "text": "I brought a friend here to finish off her bday weekend with a nice brunch, and I wish I had chosen a different spot.  The only positives were the outdoor seating and the nice server. We waited about 45 minutes for our food which was just a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOW9MNVdBEAE",
            "text": "I had a high hope for this place because of all the great reviews. However, food and service was mediocre. Especially dessert was terrible."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcjd2Szh3RRAB",
            "text": "Very fun and lively place! The DJ they had during brunch played great music! I ate the Madame Croquet, which tasted good, but the bottom half of my bread was too toasted, making it hard. The fries taste great, especially with that spicy…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJa0ktUWJnEAE",
            "text": "This place is definitely a chill spot on a Saturday night, with a very good DJ that spins hip-hop and R&B classics. The drinks were tasty and strong. I had the steamed mussels and fries which I really enjoyed. The fries were crispy and the…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJa3RuZ0lBEAE",
            "text": "The night started off slowly, waitress took a bit to come to our table. The rest of the evening her attention was as to be expected. My plate I felt was a bit scant for the price but it is French.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMy1QeFNREAE",
            "text": "Great atmosphere.\n\nFood is good.\n\nWine selection is limited. If they are listening, a higher quality is in order."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtX0l6enVnRRAB",
            "text": "Waiters and waitresses were grumpy. I ordered the hanger steak, which came with potatoes. The meat was hard and chewy. Price 46$, including one beer. I won't come back and i don't recommend it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNU9pXzRRRRAB",
            "text": "Happy hour was amazing! We enjoyed the charcuterie & will come back to try their brunch options. My only complaint was I ordered the angus steak “medium well” and I did not receive medium well, it was very chewy & cooked well done. But lovely ambiance, great wine selections."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOHYtLTZBRRAB",
            "text": "I went for happy hours indoors. There were so many flies. We told the waitress who said they were aware of the problem.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX0l5eWFREAE",
            "text": "The food is mediocre and the service poor and slow. After waiting almost 40 min for food during brunch service I was brought the wrong order (Eggs Benedict instead of Eggs Norwegian) but I didn’t even bother sending it back or it would have taken other 30 min. 3% surcharge for payment with credit card is just ridiculous in 2024.. Too bad because the location and the decor are nice. Will\nnot be back and do not recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcjVDaTVBRRAB",
            "text": "Nice and cozy French spot in Harlem, friendly staff and excellent selection of wine, next time I will be sure to try the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybk5LN05REAE",
            "text": "Food is average, drinks are cool, service is somewhere out there! The thing is that everyone there is super nice, it's a cool vibe, and super convenient if you live uptown. However, we ordered ONE app for two people, had two drinks,  never got our food (even after reminding the waitress twice), and the manager didn't even come to even apologize.  The waitress did apologize after the last time we asked, but then we just cancelled the order. We had been there for 1.5+ hours already, and were ready to go. Sigh...I still pop in, but I am local and know what to expect. Is it  recommendation worthy...unfortunately, that's a no for me."
        }
    ],
    "reviews_count": 76
}