{
    "name": "Cuchifritos",
    "place_id": "ChIJT2lgGwb2wokRQ1y71rEfmZA",
    "grid": "MN11",
    "address": "168 E 116th St, New York, NY 10029, USA",
    "rating": 4.2,
    "user_ratings_total": 1653,
    "phone_number": "(212) 876-4846",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScWRUTmlaVXBSVmxKaGNWRjRhV1JRU1ZZM2MwRRAB",
            "text": "Took my coworkers from miami all the way here and was treated bad, the service was horrible,  only 2 ladies working and the one who kept taking my order kept pushing me aside taking other orders and I was there with two others. Food was good, portion size was good, price was good but service was shit!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd1ZHbGZZaTFLTmtZdFFpMDRSMEZRUldaT1ZsRRAB",
            "text": "Fast service, great food, friendly ladies!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VmMzaGlhM3BCVlY5WU0yWlZRelZKWWxOcGJuYxAB",
            "text": "Hadn't been there since I was a child. The place still looks the same welcoming but not bougie. The quick chatter of friendly service and customers, the smells slowly transformed me to a time long ago. I placed my order, an alcapuria and a coconut drink, my favorite order as a child. The moment of truth... the alcapuria did not disappoint, the best alcapuria I have had in years. However, it was the coconut juice, the flavor was what I remembered... It was as if I had been transported back in time.\n\nI HIGHLY RECOMMEND this place."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGak5VUjVaMEpwWldWRVpXbzRSbnAxUmpKWmJVRRAB",
            "text": "Tried 3-4things, all dry. Even chicken was dry and bland. But what’s worse is the rude staff not accommodating to non-Spanish speakers. Just not a welcoming neighborhood joint and def. not destination worthy."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR01YcFhWbkpYT0hGdVdVUTJOazFCYkhCVlFuYxAB",
            "text": "Muy buena la coida"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1pXcExTV05vU0d4UUxYRm1jbmR1YkMxWVNXYxAB",
            "text": "Took a quick run to Cuchifritos during a layover to try them out. DID NOT disappoint! Food was delish and service was great!! My only little small con is that it gets PACKED! Most likely wont find a seat if you go while it's busy, but absolutely worth trying!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQlRWSjRjelZaTUVNek5XMXBkRzR4UlRCYVFWRRAB",
            "text": "This is the “pernil mofongo” that i was provided and not even the nasty sauce that was provided worked for it plus the salad is disgusting it taste like someone threw it on the floor stepped on it and served it in a plate and it don’t even have not one pinch of garlic smashed in it…disgusting and dissapointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVlFrcFhiVGhyWlhWbU9YQjNabUphVmw4dFRrRRAB",
            "text": "The food is ok.\nFood Service out of the 3 women working. One had a very nasty attitude, did not handle the food well...fingers and all..need to learn the health code. The other two were more professional.\nThe place needs to be more clean inside."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNVVFdGFXa2xIZGxaTGFVZEJVRmN6UzBwRGRtYxAB",
            "text": "Haven't been here in a while.. Food doesn't taste like it use to! Been going here since a young child. But recently went and the flavor was off! I went out of my way because I been craving this place and I was in New York! Decided to drive out my way! Not worth the drive.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU2FsbHJkVkZzZFhkRGJtNXdSMFZTUW5ZMmIxRRAB",
            "text": "Food may be good service is terrible these people that work there are so nasty and rude . Especially the young lady who works there. These people will tell you they don’t have something and it’s be right behind them where you can see.. I never been to a restaurant where you spend money and they give you what they want. And then if you don’t order in Spanish they’re very prejudice. This guy order a chicken and got 5 sauces and Hand full of lemons. I order 3 complex meals and asked for lemons on the side and I get told to go to the grocery store to buy them. Is that how you talk to your customers? It’s  sick and the owner should really know about this behavior!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNHRuR0N3EAE",
            "text": "I really loved the delicious food, especially the whole chicken, which was fantastic! However, I noticed that the steak was cut up in a way that was a bit surprising and didn't quite meet my expectations. I believe the seasonings could really shine with a tad more flavor. I also think there's an opportunity for improvement in service when ordering through DoorDash. If the staff could pay closer attention to customer notes and reach out for clarifications, I’m sure the overall experience would be exceptional! They have so much potential, and by embracing customer feedback, they can only enhance the wonderful meals they already serve. I'm excited to see how they grow!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVWRWaG1Ta00yTms4eE0yWXRXak5qWDNKSWRrRRAB",
            "text": "The best fried PR food in the city. My family has been coming here for decades.  People travel for hours just to pickup food. There's no seats inside. It's all takeout. Worth the trip."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGRXaFZjRlZmZDIxWmVHdEtkMEpxY0RKZldrRRAB",
            "text": "Fresh Latin food I love this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MU5USm5PRFJuY0dSR04zUmZlRTV4TUV4RVQyYxAB",
            "text": "Great 👍 food  watch out yummy 😋 for your tummy lol 😆 😋 😜 😄"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swemFUUkJaRTl4U0VjeFEzVm9ZakowVVhSbmNVRRAB",
            "text": "La comida no es comida criolla de la isla no tiene sabor criolla y la carne no parece carne o sabe a carne la carne se ve bien rara, no recomiendo este sitio para comer comida criolla."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saVRTMTZaRlJHZGxNeGVuVXRiblkwZGxZdFMxRRAB",
            "text": "I came here the other day, and the older lady working on the was rude, and I didn't like the way she treated me. Just because the food is good does mean you can treat people like poorly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ock1IZHNORmt4TkhOaGNWaDZVWEZDVVdkR0xYYxAB",
            "text": "I have been coming here since before I could reach the counter. Lol. The food is always good and as usual I leave with a bag of food because I want a bit of everything."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TFl5MUpRM2hsZVRKcFYzTm5WRVpFVFRSck1HYxAB",
            "text": "The taste of the food has somewhat changed its still good. I just don't taste that authentic original taste it yse to have growing up. Ange8 Concepcion-Hinton From Jefferson Projects"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOYTNzb08wNElHTmxRRRAB",
            "text": "I drove over an hour to get food here. Unfortunately most of it was rotten. I ordered pork Chicharon with Yuca and red onions, and some fried chicken. As soon as I opened the yuca it smelled funny. I have been cooking for 32 years trust me I know what spoiled food smells like but to go further i literally took a bite of the yuca and had to spit it out immediately, and to go even further I tasted the pork and had to spit it out as well. When my husband and I went back in to complain they told me you must not like onions because there’s nothing wrong with the food. Listen, I am a mother of 5 and there’s not a dish that I cannot cook, This Was spoiled! It was disgusting! The chicken was ok, at least it wasn’t spoiled but everything else was bad please do not waste your money. They did not try to give me my money back or something else I brought them the entire food back and they told me I don’t know what I was talking about. It was a complete waste! Another thing there were drug addicts ordering food breathing and spitting over the food. I feel sick from a bite that I spit out! That’s insane! Please don’t go to this spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U1NqVjJhRWxuVXkxemVqbExZMmxGUzB4NmFtYxAB",
            "text": "The food is very delicious good and affordable. Get your food to go the area is not the best BUT lots of police presence so you will be safe. Try their coco drink"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLR0U3dmFXN2RxSURnEAE",
            "text": "Great food!\nService is compromised by the overwhelming of Staff due to numerous orders."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNWEcwWldnOXMzeHZRRRAB",
            "text": "So so sad. This place was the place we would always stop at growing up...I just stopped here for the first time in 4 years amd everything was absolutely gross. The empanadas were huge with little filling that was undercooked.... the pastelles were undercooked - mushy- smelled weird AND tasted super gross. And the platano with the meat in it was soo soo sad. The meat was different.. like dog meat.  I literally just cant even express the sadness in my soul over this.\n2 stars only because the people were nice and served me quickly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNM1A0YV9pc1lxVXBBRRAB",
            "text": "I wasted 35$ on disgusting food with no taste or flavor, and rude service from the women serving you"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPXy1pS21RdkpLeXRnRRAB",
            "text": "Con todo el respeto pero esa comida no tiene el sabor o Sazon de la comida Puertorriqueña. El arroz con gandules no tenía buen sabor,  el relleno de papa suuuper empanado, las frituras saben a manteca vieja y el sabor de la carne de las frituras definitivamente no es un sabor de frituras Puertorriqueñas casi $50.00 muy mal gastados."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVhyOEhxb3Q2T3lBRRAB",
            "text": "This is where I go when I want my mothers cooking. From the picture perfect front (displays of the fried hand food) at the front, and inside generous plates of chicken, pernil (pork), and beef with a yellow rice that absolutely tastes like home in the back.\n\nSeriously, bring $20 (more than you'll need to eat), and just feel how heavy the bag is that you walk away with. This is something I noted my first time (also, Spanish really helps, but you can write down a list for them)\n\nEnjoy. Try and show restraint on the next trips! I won't!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3NEQmtBRRAB",
            "text": "Great food ....very tasty"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2FPUUNnEAE",
            "text": "Decent food but the short girl working there has a bad attitude lmao"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaHZmQ1NBEAE",
            "text": "Todo es Hermoso y Riquísimo ✅️🙏🏼💯💪🏼"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHI3OUp3EAE",
            "text": "It’s so popular I was excited to try it. First time the chicken had no flavor or seasoning. Tried it a second time and the empanadas are all crust and breading with barely any filling. Third time the Chicharrón was over cooked or had been sitting under the heat lamps and was burnt to the point it was non edible. Won’t be wasting anymore money there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODdfSExBEAE",
            "text": "This place is a staples! Food is good and affordable, and portions are great. It's a great cheap eat. Lines move really fast. If you're in the mood for a belly filled with food that'll hit the spot. Stop in!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMHVDOE9REAE",
            "text": "I bought some alcapurias on 4/7/2025 from here, and they were delicious.  I'm waiting for them to open again today so I can go buy some more. Yum. My husband loves the relleno de papa's."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDZYRHVBRRAB",
            "text": "If you like the La Cultura Hispana or the Hispanic Culture and all the various foods associated with it. This is the place to visit and eat at. You will not be disappointed. Staff is great and the food definitely represents the Hispanic Culture."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFpLOHBnRRAB",
            "text": "Not puertoricans! this was probably the worst pastelillos i’ve had in my life.im so disappointed but at least it was cheap so i didn’t lose too much cash. as you can see i had to throw it away after 2 bites. the parcha juice was ok."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajhqT213RRAB",
            "text": "I was back home in NY visiting my family and my brother took me to this Spanish spot in Harlem. The food was really good. I got pernil with rice and beans , Alcapurria & a pasteles. All delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a0pTMVpBEAE",
            "text": "Best place for local cheap and tasty Spanish food on the go.Their Pasteles and Alcapurrias are delicious.All their drinks are tasty.No place to sit they took chairs away during Covid because local homeless would lounge around other than that place is worth going for the food and prices.You can eat in there standing.Variety of the menu and the prices makes the place a Gem."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZzVHQ0VBEAE",
            "text": "When I tell you I'm extremely DISAPPOINTED & DISGUSTED by this food,BARF! I got the beef stew, white rice with a side of beans, and plantanos. The beef stew is so tough it's hard to bite it. It's hard to even pull it apart with my fingers. Plus, they didn't give me no potatoes or carrots! The rice was mush! The plantain taste old, w.e they used to coat it taste like alcohol! I'm beyond upset by this because I have been craving this n I didn't eat all day n i don't feel well n here I am now with the worse stomach ache n out $15! I will NEVER eat here again‼️\n(Sorry, my video cut off)"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aFpMNmtRRRAB",
            "text": "Me gustó mucho"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcmNDLXVBRRAB",
            "text": "Old school eatery love coming thru for a visit check it out you won't be disappointed."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDUyTThRRRAB",
            "text": "Me encanta 💖 la morcilla mi favorita.   Los jugos naturales nmmm...…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbWR1Q3dRRRAB",
            "text": "Pernil is dry. Rice has no flavor. Chicharon was old. Terrible."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbEpIZENBEAE",
            "text": "I have been going to this cuchifrito for over 30 years. We live in NJ and take 1-2 trips per year, It’s my favorite place to have Alcapurrias, pastelillos, morcillas, papas rellenas, and mofongo, the food is delicious If you are puertorican you can appreciate the authentic food.  Love this place"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN05qaG1RRRAB",
            "text": "The workers work really slow and it kinda seems like its on purpose. The food lacks so much flavor, and the overall atmosphere is not up to par. I see why they have a B rating."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBZzV6RW13RRAB",
            "text": "Horrible. They completely fell off. I swear they making alcapurrias with ground turkey. It was horrible. I bought a little of everything. Spent like $50 and the lady gave me coconut juice instead of Tamarindo and wanted to argue with me lol. It was nasty all around. I've been coming to this place since I was born. Haven't been there in 5 years because I moved back to Puerto Rico. It was all around sad, heartbreaking experience. LO DIGO CON DOLOR EN MI ALMA,  I DON'T SEE MYSELF EVER COMING BACK TO THIS PLACE.\n\nRIP 116th cuchifritos 🇵🇷😔⚰️🕊️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNVpQQlRREAE",
            "text": "If you don’t speak Spanish they treat you as if you’re less than … There was 4 African American customers waiting to be served and they called the Spanish lady who was in the back of the line and said Can I help you first … They get frustrated once it’s to packed and all customer service (which isn’t much) goes out the window"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeWRDWExBEAE",
            "text": "Delicious morcillas"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMS1tSDJBRRAB",
            "text": "Lo siento mucho pero ese cuchifitos no son puertorriqueños. Además que clase de pasteles son esos, perdonando pero parece vomito de perro. Ese cuchifrito lo van a cerrar pronto lamentablemente. El que tiene negocio tiene que ser amable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNTdfT0lBEAE",
            "text": "It is not the same as it used to be 20+ years ago  The people are all different and the service too. 😢  Was in the mood for Mofongo because I always ordered it in the past.\nWhen it came out I noticed that it looked funny but I thought no maybe I was wrong but when I bought it home and I started eating I noticed that it didn’t taste good the plátanos that were used to make my Mofongo  were old. It was not made fresh it was made with platanos that were probably cooked previously and refried.I couldn’t finish eating it .I had to throw the whole thing in the garbage I  did not enjoy my meal that night at all and I was so disappointed. It Used to be the most busiest place in  en el barrio The Best Cuchifrito  Around. But I don’t know if it’s that it’s Dominican owners now or the cooks but the food is not the same as it used to be before the place is never packed there’s no seating the way they used to be before and it just doesn’t feel the same that atmosphere is not the same, the food is not the same. And do t ever go there after 5-6 because you will see all the fritura that’s left , all dry from sitting there .  I am so disappointed  they ALWAYS had an A rating. Now it’s  a B rating\nI don’t know maybe it’s the time of day you should go, but even on a"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNUxXY0V3EAE",
            "text": "저렴하고 푸짐한 가격에 즐길 수 있는 푸에트리칸 엄마들이 해주는 가정식요리"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcTdLcWFnEAE",
            "text": "푸에르토리칸 음식을 맛보는 즐거움. 음료는 싼맛."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINDctRnJ3RRAB",
            "text": "The Spanish food here has consistently been excellent since my childhood. This family-run establishment is incredibly welcoming and supportive of the neighborhood. On September 7, 2024, I visited with my cousin, who hadn't been back to Harlem since 2000. We had a wonderful time together, enjoying delicious food and spending quality time with our aunt at her home for dinner and a movie. It was a memorable and enjoyable experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqb1A3OUlREAE",
            "text": "Quick stop for food this place as been here for years I haven't come in probably over 10years I thought my mom had got me the crispy chicken chunks but got me fried chicken instead. It was ok the potato meat patties was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa19mU293RRAB",
            "text": "I have to say that I wasn’t sure what to expect after reading some of the reviews in the last few months, but I guess whoever that lady is that everyone is complaining about either left or they told her to change her attitude cause the ladies there today were mostly attentive. So about the food; I wasn’t disappointed really because my expectations weren’t really that high. I was told the food was great but it really was just good. The pasteles were actually good with large chunks of meat and no fat. But all the food would have been better if it was hot. The food was nowhere near 140 degrees so I’m hoping no body gets sick eventually, I’m 12 hours in and no issues yet. The alcapurrias had too much masa and not enough meat (and not hot), however they weren’t super greasy like some complained about so that was good. Sweet plantains were good, but as long as they are ripe it’s hard to mess that up. If I lived somewhere where this type of food I’d hard to get I would settle for this place, but in New York or Florida there’s better places."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLUtHUGFBEAE",
            "text": "Craving Puerto Rican fritters, in Spanish Harlem. I used to go here as a kid, still family oriented but it’s definitely changed. Not many cuchifritos are left. It’s also hit or miss if you arrive late the fritters pretty much sit underneath the heating light where it gets pretty hard. Or arrive early where the fritters are fresh and just came out the fryer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia0w3R29RRRAB",
            "text": "For full transparency, I only had a relleno de papa, bacalaito, and ajonjolí drink.  The ajonjolí was very good, though a tiny bit too sweet for me (small was the perfect size), and the bacalaito was pretty good - not too fishy, a nice crisp crunch around the edge, though a tough and chewy center.  One star on food is really for the relleno, which would have gotten a -5 if I could.  Soggy, dripping with grease, some weird sticky yellow exterior with a lumpy, spongy masa inside, hardly any meat, tasted sour, almost like a bad attempted take on a Chinese bao bun.  I threw it out after a couple bites, it was that terrible, and I *never* throw away food.  Service was fine and prices were very reasonable, no place to eat inside if you care about that."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDkzcHVBRRAB",
            "text": "They have good food, but I don’t speak spanish…so it’s usually very difficult for me to order.  I usually get scared of coming in here due to the language barrier (sometimes there’s a customer that will help translate).  I like to get white rice with this slow roasted chicken with sauce, beans, potatoes, and carrots.  It’s about $10.  The super old grandma is really mean - stay away from her.  She won’t put it all in one tray, so she can upsell/upcharge you for each item as a small (a la carte)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb09URjFRRRAB",
            "text": "this spot is a delicious well portioned family run business,i will be back"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcTktbjZnRRAB",
            "text": "BANGIN authentic Puerto Rican comida. Chicharon was everything. Fried to crispy perfection. Rice and beans were dumb delicious. Wifey had the mofungo with salami con queso. My couple of bites of her dinner were off the charts. Perfect…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeU9mMENBEAE",
            "text": "I wanted to visit the place Anthony Bourdain tried. I had the Dominican style pork chicharrones with yellow rice and beans. It was tasty. I washed it down with some piña colada agua, which was refreshing! The meat was somewhat dry, but the visit was worth it! They do not serve sodas only aguas, however."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4N2QyemRBEAE",
            "text": "Went on PR day and it was packed, needless to say order was a bit off. Food is good, but check your order before leaving. Pineapple juice yummy! Definitely a place I'd recommend on a work week not event or holiday."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxZ0p5Rmh3RRAB",
            "text": "Terrific food at terrific prices. Locals eat here so you know it's gotta be good. We keep coming back here over and over. If you get yellow or white rice, get the beans to add to them. They have exotic fruit drinks too. No seating inside…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbFB6REVREAE",
            "text": "You want down to Earth Puerto Rican Spanish Harlem eats? This is your place...The kind of place they still wash the dishes by hand and the food has love in it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOM3FfRm9BRRAB",
            "text": "I just went there because we were craving some chicharones, we Google the nearest location, and they have the best chicharones ever! And everything else looks amazing! Too bad we live far"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjdXVtNm5BRRAB",
            "text": "I’m told they’ve been a neighborhood staple for 60+ years. Serving puerto rican classics, including some harder to find dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbHQtS3h3RRAB",
            "text": "Really enjoyed the Dominican Chicharron, excellent value for money. Papa rellena also pretty good. No dine in at the moment, take out only. Wish I'd have got some hot sauce or something, food just needed a little bit more spice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcE03b3NBRRAB",
            "text": "I'll go out of my way just for the rellenos de papa 👌🤌 but the chicken, rice and beans are middling. Service on the slower side.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbE5TZHd3RRAB",
            "text": "The food (chicken with rice and beans) was good but the frituras tasted a little off. I got a bacalaito which tasted too fishy for my taste and the alcapurria which wasn’t too bad but most of the taste was oil. The prices are great,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5Z0xpLUN3EAE",
            "text": "Could be better if the ambiance was SAFE. constantly,  homeless and addicts asking for $$$.  It feels unsafe, not what it used to be"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRc00yRnhnRRAB",
            "text": "1st time customer . I ordered the chicken soup , it was just ok but the white rice that came with it was both under cooked & tasteless . I took a order of rice beans & a whole rotisserie chicken to go it was ( & I'm being nice ) bland &…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOFlLTWZREAE",
            "text": "If your order  is family size....you cannot sit inside the restaurant to eat....wich is messed up...and for the record....my salad had no tomatoe....😟"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtclphRlV3EAE",
            "text": "Service was fast and it was packed. Very friendly. Great food. Scrumptious."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMzZhWXNnRRAB",
            "text": "So so so so delicious! But you almost have to speak Spanish to get a true feel for the people and the area, but wow is this place a historic spot in Spanish Harlem. Incredible tasty food for very inexpensive prices. They mix Latin flavors…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwckwtSFdnEAE",
            "text": "Good place to eat. Good service and a friendly atmosphere."
        }
    ],
    "reviews_count": 72
}