{
    "name": "Sandy Restaurant",
    "place_id": "ChIJGVPzwwf2wokR2hDmls7ZwIQ",
    "grid": "MN11",
    "address": "2261 2nd Ave, New York, NY 10035, USA",
    "rating": 4.3,
    "user_ratings_total": 1128,
    "phone_number": "(212) 348-8654",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdExUaG5WbGxRUmpaMFZYcFBTbVYyU1Y5WVUzYxAB",
            "text": "I'll update this with plates i try\n\nRabo guisado (4/5) amazing but u should get it early so you get big pieces otherwise you'll be left with lots of small ones\n\nLocrio (3/5) not bad but don't love it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweFNHWjNNbFpNWkRWU1JtOUZXVkJNWVZwcmFVRRAB",
            "text": "Peril was Luke warm, by the time they microwaved it warm the bean were luke warm and tasted like tomato sauce. Not good.  Don't go."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd1REWnFMWEJZZWtJM2QxOHpUMGh2TUVWTWFFRRAB",
            "text": "We always order from MSH Hospital, food is always amazing. The service incredible. Good portion! Love it here, thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFNISnJSSEIxV21obFN6ZFBSSFJDVWpSRlRXYxAB",
            "text": "The food tastes really good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM2FIVk1OVzFHTlVveFkwRTJjMUE0ZVhCRVJrRRAB",
            "text": "Delicious but pricey for humble food. I think the lady over charged me. I never saw my receipt but I didnt have enough energy to argue."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVExVZFpMV2h6V2tRemJsazVWa2RLT0VaS0xWRRAB",
            "text": "Food is always fresh, servers are courteous and attentive. Love this place! Usually ample seating..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNGRYaGpiRVZrTFdwaU5qRnhaMDlEU1RGUVpYYxAB",
            "text": "I’m extremely disappointed in the food which surprised me because I normally order from them. . I ordered the mega combo 1.  I didn’t see them pack the food so I didn’t notice it until I got home that the Maduros was burnt. The pork was burnt/dry. I thought I was getting pernil per the menu, but what it look like was chopped up pork chops that was burnt and looked like it was refried. The baked chicken wasn’t good.  I won’t be ordering from them again."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlJIWmxWMmhMTmpSUVRIWlVlalpaZEY4dGIyYxAB",
            "text": "El problema aquí no es la frescura de los ingredientes, sino la calidad en la preparación. Una comida puede ser fresca y aún así estar mal hecha. Lamentablemente, este lugar falla de manera constante en aspectos básicos, y en lugar de reconocer los errores, prefieren excusarse. Esa actitud refleja una falta de respeto hacia el cliente y demuestra poca seriedad en el servicio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMmQybzJWRjk2VEY5alZ6ZHFkMjVXTTJKWWFYYxAB",
            "text": "Great domincan food... wide variety."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaGVFNXVTRVoxUm0xeFRVcE9iMEZzTkZSQ09IYxAB",
            "text": "We believe Sandy Restaurant stands among the best options locally. The extra dishes tasted excellent, containing spices I don't usually try. Where you find Sandy Restaurant adds value to the experience. Every staff member shows real kindness. This spot offers honest cooking."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUlNtOHRXVmMyVmpCdlZqVllSRFJoZVhOeFJFRRAB",
            "text": "Terrible experience at this restaurant. The service was completely unacceptable. The staff seemed more interested in chatting with each other than attending to customers. When I tried to order, the guy in front of me was basically ignored me and helped the person behind me instead. I had to ask him for assistance, and even then, he barely acknowledged me. When I finally got his attention, instead of helping me himself, he just pointed at another staff member and told me to go talk to them. It was like I was invisible. The attitude was awful, and it felt like I was bothering him by even being there."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ2NYcFVRWEJxWXpsbE1sRlhWMnhCYjAxZmNGRRAB",
            "text": "Puse una orden a las 10:38am para delivery y ya son las 11:58am. La señora que tomó la orden ni caso bien me hizo, y parece que hasta la orden se le olvidó ponerla ya que nunca llegó y no llaman o algo. Con el hambre de la gente no se relaja así y pongan a alguien más profesional al frente a tomar órdenes. No me dio ni tiempo y ni el total de la orden, me dejó hablando solo y me cerró, yo aquí con la esperanza de que mi comida llegara. 🤡"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVdtUlJTemwwT1RKMFpHcFFhSFpwWkhSUWMyYxAB",
            "text": "It's a great place to get tasty spanish food for a good price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdFFXOXJXRXBKYW0xWU9FZHFXamN6VFZGRFVGRRAB",
            "text": "A true gem in the local food scene."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFFWSkpZVTFzVlhkb1JEaGxhRE53VVdRMlZsRRAB",
            "text": "Caro y malo.\nExpensive and terrible food and service."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabGJ6SnJMV0k1ZGxWVmNITjFVMXBVT1ZSVldFRRAB",
            "text": "Los lunch son caros para la porción que sirven y para la zona donde está ubicado este restaurante."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWU1IVnNNbFJxTVVRM1MzcG1hVzU2VldKM1YwRRAB",
            "text": "My mouth was in heaven! Every employee was naturally personable. Their meals demonstrated cooking skill. The value here is obvious. The spot won my complete approval."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWFR6aDVibEJQVDA5SFltbFVUbmRyZEVWRWVVRRAB",
            "text": "Im sorry but this has to be one of the worst Dominican foods I ever tasted. I order grilled chicken with rice and beans and potatoes salad. Everything was unseasoned. The beans tasted nasty. Poor quality food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cGJsRTRibGRNV2pGS2FtZFZXamhmU0RsSlRFRRAB",
            "text": "Food needs more seasoning. Service is good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdFQwSkpRVzFHY1hveVZscFBObGRaUm14UmRsRRAB",
            "text": "There was a bug in my ustensils, my tostones came cold and my fried pork was fat only. Then they tried to charge me $25. I would not recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WVYzUnhOWFJxUmxKU2FHMWxlVEpSWlZkV01uYxAB",
            "text": "Good staff they were so sweet . Love it here ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwclRYUkZha1pmU214MWVrRk5NVGMzYkRoT2JWRRAB",
            "text": "Love the food here. Great service. I recommend this place to anyone…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaGRETjJPWEl0YUdKd2RHcExla0YwVm5rdFVXYxAB",
            "text": "The food was good and the service was good too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMakp5YVdZZ043bmtBRRAB",
            "text": "The woman that work here work very hrd their friendly and fun the atmostphere is layed back and confortable they also have a small bar sevies and beer servies and there food is amazing and im Puerto rican the servies is fast and easy they have a window servies with three diffrent rices and about five diffrent types of meat to pick from qnd they also have an eat in menu service so if u want to sit and enjoy dinner with friends you canand they do deliveries too so you can enjoy the latin flavors you love at home to.All in all they really a great resturant to enjoy spanish food.only thing is they have a steep card charge so i recomend bringing cash so u dont have to pay a ten dollar surcharge for using your credit card"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU3d4X2ZNX2FmcGpnRRAB",
            "text": "Food is always amazing, servings are large.  Hosts are great and the prices are average for good food around the same area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMM2Y2WjNTOUt1aFNBEAE",
            "text": "My girlfriend was craving mangú and we found it! Very good all around!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQR3gzWXZfMjZyVXp3RRAB",
            "text": "We love your pot pie"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPeXQ2LWlwcVlUOXV3RRAB",
            "text": "It was my second time going there, the first time wasn't good and I said let me try again. Well, the second time was no different they always spoke Spanish and walked by as if they didn't see you when you standing there trying to order. Very rude and disrespectful 😤."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMdmprOUgxeWRpbGJ3EAE",
            "text": "Restaurant seems to have “grade pending”.\nInspection results show negative comments regarding food safety / hygienic upkeep.\n\nHopefully these restaurants can start correcting these priorities which isn’t all that expensive as long as the daily maintenance is done properly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORHZodUhQeGVxNkh3EAE",
            "text": "My waiter was amazing, which made my experience even better on Palm Sunday. I was craving tres golpes -Dominican breakfast dish that feeds one soul. 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNF91S25RRRAB",
            "text": "The passion fruit juice was very refreshing!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeVBUS2J3EAE",
            "text": "I bought a family meal, and the lady said something about $10 dollars for the table charge, I said okay, she didn't say $10 per person. They probably thought we were tourists, so they overcharged me. They also didn't give me an itemized receipt showing the charge, they just added it in, and STILL asked for a tip on top of it. Thieves."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU1pMDdBRRAB",
            "text": "I ordered Chicken Noodle Soup yesterday and when I poked my fork in it blood was oozing all out the chicken (DISGUSTING)"
        },
        {
            "date": "수정일: 7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReExEc2Z3EAE",
            "text": "Paso cuatro días a la semana al lado de este restaurant y tuve la oportunidad de comprar una vez comida y la comida estuvo buena, también compré café y aunque no tenía espuma el café estaba bien, me gustó !\n\nFui un par de veces y ese par de veces que fui la chica que estaba en ese momento me ignoró completamente y lo que ella estaba haciendo era repetirle una y otra vez lo mismo a la misma persona\n\nlo mismo que anteriormente ya le había dicho\n\nRealmente me gustaría comer aquí pero en vista de qué no fui tomada en cuenta deseché la opción de ir otra vez .."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b0xQc3FBRRAB",
            "text": "Bueno la comida.  Y calente que saba !   Arroz y habichuelas estaban  sabroso.  🇵🇷🥰👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MXR2eUl3EAE",
            "text": "Overpriced"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a0tqby13RRAB",
            "text": "Been a few times they mess up my order i keep trying but this is the last time mostly because they are always correct and you are not they give attitude every time like its my fault they messed up i always tip good i dont even argue about…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eHVUcjZBRRAB",
            "text": "My meal was very flavorful.  Even after years of being business, they have not lost their touch. Great lunch specials"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMktmN2RREAE",
            "text": "I explained to the lady how I wanted my food. When she brought it to me, I explained this is not how I wanted it. I explained again, and she walked off talking in Spanish. I think she's going to make it the way I asked. No, she wasn't making anything. I asked the guy if I could explain to him what I wanted. After waiting for about 10 minutes, he tells me he's not serving me go across the street."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaE5ydWV3EAE",
            "text": "I love the food here! Breakfast and dinner are both great you can’t miss. Service in the mornings are definitely better than at night."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOGRfcWN3EAE",
            "text": "So delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBODZqWkVREAE",
            "text": "Thank You for the experience my friend Marisol B. had when she to NY for the first time. There was no other place that I would have taken her to eat but Sandy’s. This lil Blanca from 116th and 1st appreciated that I had the best place to bring  Boriqua sista from Chicago!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMU4zS1lBEAE",
            "text": "This was definitely a treat and was so amazed at how great the food tasted. It was my first time in there and New York in general and I felt like I was home seeing I'm from Chicago. Would definitely recommend this place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOVlhTGlnRRAB",
            "text": "Waitress was nice but there was a crazy dude across from us that kept pointing at people and yelling and there was baby roaches in my drink I would add a picture but I don't know how"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdHEzaEl3EAE",
            "text": "Siempre es una buena experiencia visitar este lugar. La comida es buena y los empleados son super amable. Lo recomiendo!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREME1Qa2dnRRAB",
            "text": "I recently ordered delivery of avena. I asked for 2 large avenas, which I thought would be the tall brown paper cups they serve it in.  What I got was 2 large plastic containers.  98% was watered down avena and 2% actual avena. They robbed me. Not to mention the fee they charge for using a credit card instead of cash. Another time I was in the restaurant, we got the bill and wanted to pay a tip on cash. The check included the tip. I told her I\nwanted to pay my own tip amount, and she said she could not re do the bill. After some back and forth, she changed it, mumbling under her breath and slapping the bill on the counter. Very rude. I will be going back to cuchifrits on 116."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNklxc09REAE",
            "text": "Sandy, in particular, made it memorable with attentive service. Either for Dominican food lovers or just adventurous tryers, this place is a must. Definitely will return with every opportunity when I am in the area. Flavors tasted authentic; service was hospitable-10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbF92N1ZREAE",
            "text": "My son and I had lunch here the food was wonderful,Service was grand.\nMade us feel very at home ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubDhiLXd3RRAB",
            "text": "I don’t understand how they manage to mess up to go orders so much. Ordered white rice they give you rice and peas. Order boneless chicken you get bone in. Happens every other time I order from them on doordash. So annoying"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueGRhYXFnRRAB",
            "text": "They always treat me great, the service is quick, casual, and positive. They’re my local restaurant, but even if they were downtown I’d still make the trip!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaGNMQkh3EAE",
            "text": "My order\n3 beef empanadas\n3 chicken empanadas!\n\nCame in for a quick bite after my examination malfunctioned (lost internet service). It was extremely busy when I walked in. But I was immediately greeted by the staff behind the counter. I definitely recommend stopping by this restaurant. They serve breakfast, lunch and dinner! The food behind the glass (hot bar) looks extremely fresh. The staff works together and are very consistent when it comes to catering to their patrons. Family friendly, date worthy place. Please support this business for those days and nights you don’t want to cook! They also have delivery as well. Plus I just tried JUGO DE COCO for the first time…i 100% recommend!!! This is a local staple for Harlem.\n\nPlease support the locals!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScGJxZEZREAE",
            "text": "The food is too pricey, they serve you only a half of cup of beans and white rice. Usually authentic restaurants serve you more beans then that especially if it's for two people. Their bathrooms have water saving old system which sadly they need to change asap. It gets clogged to easy and to me that's a big don't go back.  They only get 2 stars because they do have a bar and the place is bit centric for a stop and go but I would not recommend it for a picky, clean eater like myself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeG9Mb1JnEAE",
            "text": "I recently had an unfortunate experience at a restaurant I frequently patronize, where I decided to order a to-go meal. Despite the establishment's reputation for excellent cuisine and my previous positive experiences dining in, this particular incident left me deeply dissatisfied. The waiting time for my to-go order was almost an hour, which was both frustrating and disappointing, considering the significant amount of money I had spent. This is what I waited for almost an hour for very dissatisfied"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyN09YVDVBRRAB",
            "text": "Let’s just say the reviews for this place is lies the food was not good the morir sonando was horrible was not sweet I had chicken chunks it was cold and dry and the rice was okay the bill came up to like 50 for food tht was trash and they were bare drunk men I’m the place by the bar smh never again the mojito was just oil"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM3RhRUJREAE",
            "text": "I got a cup of cold water in hot summer day from Mr. mogul espinal . I felt touched to see that as a business man he would like to offer help to “strangers” He is one of best manager. More ever The food 🥘 here looks very fresh and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMXUzcl9BRRAB",
            "text": "I loved everything about our experience at Sandys. The food was absolutely delicious. The portions were huge. And the waitress was an absolute gem. I can't recommend it enough."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybzZqZUZBEAE",
            "text": "I was introduced to this place my first few months in the city by a friend of mine. Their roast chicken was really delicious. My friends have come to rely on me as a proficient procurer of high quality chicharrón de hueso. I got a call from one of my elder friends and her daughter-in-law who were driving to the city from the Poconos and the first thing they wanted me to do was order chicharron from the place that I had last bought it for them at. It's a pretty good spot on 125th Street but when they went there what they got was nowhere near as good as what I got for them. Instead of going back to that same spot I recommended Sandy because they are always on point. And I've been there several times over the years. It was all my friends could do not to drool on the glass. I think that the prices may have gone up a bit but the quality has never been shady at Shandy. If you want to eat in; there's not a lot of space but it's well worth the visit. I'd give the pernil a B+ but everything else I've had there has been an A /A+. I also like the staff. They're nice and not and rude at all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNGF2eXFRRRAB",
            "text": "They have great food and a very good price (except the oxtail at $27 an order). I ordered half a chicken, and it had a good flavor, but it was dried. I'll definitely come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob3NqSUdBEAE",
            "text": "Nice, small Dominican restaurant serving a large menu. They have dine-in or take-out. This time, we had goat stew and stew chicken. Both meats were tender, but the food might be a bit salty if you don't eat a lot of salt.\nServe was ok. They cleaned a table right away for us, and they had steady business."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURva2NIaHpBRRAB",
            "text": "I order 2 orders of 3 Golpes. And they had a rotten onion🤢🤮🤬. Try to talk to the manager. But he ignored me. I was going to the restaurant to show him. But I'm not able to walk. Never again. And I use to order 4 times a week.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGRPTlpREAE",
            "text": "We got breakfast and 2 chicken pastelito. The food was good and I like dipping the pastelito in salsa mojito. We got the passion fruit juice and it was so tasty. Definitely recommend when you are in the neighborhood and want authentic Spanish food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbkpmeGdBRRAB",
            "text": "Food was made fresh, service was fast and just a nice atmosphere to be in when you see smiles on everyones face."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcUpxenlRRRAB",
            "text": "Es un buen lugar\nLa cosa es que al principio hace mucha calor pero ya te acostumbras\nTambién la gente es muy amable\nHablan español\nLa comida es deliciosa\nSolo pregunten por la comida\nLos combos son para llevar son aparte de la comida que venden >;) ( mi cámara no es buena pero la comida se ve bien y es deliciosa)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N05XTURBEAE",
            "text": "Don't know how this place got 4.4 the pastels had 0 flavor. Bland and terrible. I don't think this a Puerto Rican place rather Dominican place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM2V1clJREAE",
            "text": "Beans taste like tomato sauce. The beans are nasty. Their rice and peas are nasty to. They need a better cook. They serve their to go food sloppy. No presentation. Lacks customer service. This place fell off since my last visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcTViQjVnRRAB",
            "text": "Food is pretty good. Could be a bit cleaner and the displays more presentable but I'd eat here again."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOXZtQVdREAE",
            "text": "Charging me 6.50 for half a bowl. Asked them to fill it up but refused and said they need to charge more for it. Much better option across the street at caridad where they charge half the price for the same thing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd1lUZHh3RRAB",
            "text": "Woman who took the order was very professional and kind. Got the order right too. But I have to say, the food wasn’t good. the black beans and rice was ok at best, the chicken was a little dry and the pork chops were well over cooked. The sancocho was salty and had a gel like consistency that smelled similar to cat food. What so crazy is, I remember my mother and sister ordering from this restaurant years ago, and I remembered it to be delicious. Which is why I was so hopeful for a great experience tonight. The best thing on the plate was the plantains. I am sorely disappointed. $65 down the drain!!!!"
        }
    ],
    "reviews_count": 68
}