{
    "name": "The Edge Harlem",
    "place_id": "ChIJ2d54lnr2wokRK-62uG2nIx8",
    "grid": "MN11",
    "address": "101 Edgecombe Ave, New York, NY 10030, USA",
    "rating": 4.5,
    "user_ratings_total": 1482,
    "phone_number": "(212) 939-9688",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRGJHOWlSblEyYVZOV2IwOTJaMDFXV1dGSFdXYxAB",
            "text": "An absolutely fantastic experience! My pancakes were delicious, and my sister declared her shrimp and parmesan grits the “best meal I've had all weekend.” The service was equally impressive—prompt and accurate. Highly recommend this spot!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcVgzRXhTMlZHTlVOaWNtbEJRMlZzVjNsdk5HYxAB",
            "text": "I came with high hopes and left with them fulfilled. Staff members showed remarkable assistance. Most of the menu items show real skill. Coming across this spot was fortunate! We're looking forward to our next meal here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlUxSktNRXN3UW1Wc1NHMTJPRXgyZFd3MGJVRRAB",
            "text": "Low key spot! Always good food and chill vibes.."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdFZGTmZabXBSUkVOQmNEUm5aVWx3TkRGdWVuYxAB",
            "text": "Good food\nDidn’t like the crab cakes it was too sweet breaded with coconut"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dlJFNVVjMUl3YkRabWMycHhTREoyV0ZZd1MyYxAB",
            "text": "We really wanted to love this spot and the cocktails were great but the crab cakes were burnt and replaced with fritters which were super spicy (not mentioned on the menu). The shrimp entree was delicious though."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZlMzaDNlR2N6UXpkbldGQmlZbkZ3U201WFpsRRAB",
            "text": "I love the vibe at this place and none other dishes ever disappoint."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKUGF4SS13ZzgtZHN3RRAB",
            "text": "Really cool spot in Harlem , excellent service , chill vibe and the coconut fish sandwich with plantains and salad was just what the Dr ordered , felt like real home cooking 💪🏼 salud"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSk5GQk5Oa2RxUkROd1N6RkhkSFpMZW1kbGVFRRAB",
            "text": "I had the salmon Alfredo. The salmon was overcooked and dry."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMVh6UnJOV1pYWldaV1lVbDRTVzFsTUdOQ1lYYxAB",
            "text": "When the food came out I  noticed that the dish was missing ingredients, I mentioned to my server who seemed irritated so I decided not to dine there"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdWJGSmZNSEJUY0RCeGFHSk5VR2h4WVhVdFZFRRAB",
            "text": "Great food here amazing taste"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWU9FeE1SMWhyVm5Cd2IzbDFVbXRhWjNOVWIzYxAB",
            "text": "This is a nice little hidden good mind.  They have great drinks and good food.  Their prices are very reasonable.  I had the coconut fish plat and it tasted very good.  Worth the trip"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYU5uaGlOMTlJU3kxT1ZXcDBjMkpPZVdOMFJuYxAB",
            "text": "Decided to try The Edge Harlem because the menu seemed interesting. My husband had the pancakes which he enjoyed amd i had the salad which was ,ok. I also ordered the codfish fritters which were ok as well. I was expecting to taste more of the fish chunks- but there was more flour added. The atmosphere is comfy and cool. I wasnt impressed but I would give it another try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMmRTMHpaM1YzYUZVMFR5MXNTRzF0TUdSaWRsRRAB",
            "text": "Its a bit less than what i was looking for,but it turned ok."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR2RtSXlVMlV6TTNsMGNEbFZaM1ZYTjFkbk5sRRAB",
            "text": "Never disappoints, love the food and the flavors"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd01DMVNiVlIzUTBaak4wZGZjRGhqZVRGVFdrRRAB",
            "text": "Had a nice lunch brunch with my colleagues. Service was good and accommodating food arrived in good time and at the perfect temperature. Atmosphere is busy but quaint enough to hear your group talk."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bWZTV2NREAE",
            "text": "Great!!! Food and service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU1dtRnlNWFE0YTBkQlptVllSMDA0Y0dseGQyYxAB",
            "text": "OMG the food was amazing & to have been here for 11 years & I've never been is crazy. We have definitely found us a new breakfast/brunch spot. The staff was  also friendly which is very important to me .  Come try this place, you won't be disappointed. SB: I'm very hard to impress when it comes to food because I'm an amazing cook. 😂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVFQzTlFja2xKVlRsM2IzaFFaVWx2Y1RWRmExRRAB",
            "text": "Great place, ambience and wonderful servers and staff,"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeU5scEdRemt6VjI0elEwdEJhMHN3YTJGdFduYxAB",
            "text": "They adjusted cooking methods to suit my preferences. The interior design stands out immediately. The kitchen always delivers quality and the ambiance feels comfortable. All staff members exhibited warmth and support. The service here exceeds what's typical."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeVQzUjJUMjlhWmtsVmEyWXlabmhDTmkxeGRtYxAB",
            "text": "👋🏽 Everyone! During my birthday month, August, I was a guest at The Edge Harlem restaurant. I'm a person of color who makes the effort to support black and brown entrepreneurs. Lately, I've been attracted to brunch because it offers both breakfast and lunch food options. My friend ordered the shrimp and grits; I ordered jerk chicken and waffles. We also had a carafe of sangeria. Here's my experience at this restaurant: the food was \"okay\" for these reasons. The food was brought to my table 5 minutes after ordered, perhaps it was 10 minutes. The point is we received our food extremely quickly. Was it actually cooked or microwaved?? My jerk chicken was a tad dry; my waffles weren't exactly hot. I did enjoy the ambiance and the servers were professional. I would patronize The Edge Harlem again, hoping the next dining experience is a DEDICATED 5 star rating. I hope this helps! Great day to all 😊."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdk1VNUJVMDVsY1hSNk1XTjJkbDlQUTJ3NVZWRRAB",
            "text": "Excellent Food, Great Environment"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5d1JVTllNME5hYTBwSFkyeEVUMUZaT0dOVWJFRRAB",
            "text": "I seem to be in the minority of reviewers, but I’ve never had an enjoyable experience here. The restaurant once charged us extra because a band was playing, but the entire time we were eating the band was just setting up! However the food is the real disappointment for me. Their fried items are frankly overly oily and under seasoned. Maybe brunch is a better bet, since I’ve only ever come for dinner!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbmNuaFFNMFpoZWpobWRIaHhSbXQ0UW1SQlZXYxAB",
            "text": "Delicious food, good vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NGEwUXlaRWhRZERsc1JHY3hWM1p5YjJsMmJrRRAB",
            "text": "Wasn't what I expected but I enjoyed myself w the people I was with."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV09VRkRWMG95T0hGclQxSm1Sa05vV0U5RExXYxAB",
            "text": "Excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRmFsUlFMVFJEUVRGVExVWkRiemhqVG5aSFYyYxAB",
            "text": "I wanted to love this place so badly!! The ambiance and service were wonderful!!! This was my first time in Harlem and I was excited to try this Caribbean spot. I ordered the Jerk Chicken and waffles, and was surprisingly underwhelmed. The jerk chicken was dry and got cold quickly. It also could have used a bit more spices to bring out the flavor. The waffles were soft, which I liked, but everything got cold really quickly. My friend also didn’t finish her burger (and she’s Caribbean 🥴)\n\nThe codfish fritters were the best thing I had and would order them again. The atmosphere was great, music was a vibe, the service was wonderful! Just wish the food hit like everything else did as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRGFESnBlbFZMZG0xV1ZUbG9PV2RuT1ZSZlYyYxAB",
            "text": "Walked in to make a lunch reservation for a big party for the same day. For this very professional staff it was not a problem. We were seated on time and served a great meal that we all enjoyed at a leisurely pace. Among the range of choices- tuna melt, chicken and waffles, coconut fishburger, and others everyone loved their dishes. An impressive crowd for a Thursday afternoon but the staff handled everything with ease. Will return with great pleasure anytime."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeVZtTnBVWE42U0ZOT1kzQjJVVmwxWmxsek5uYxAB",
            "text": "Food selection is great. I had the fish and chips, which were some of the best I've had, and I've had them in England."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5V2NXVnJTV2htYmpkTVdETktTbUZRZGtabFExRRAB",
            "text": "Alexis at The Edge Harlem was absolutely fantastic — both as a bartender and a waiter! The service was top-notch, the food was delicious, and the drinks were outstanding. The whole experience was excellent from start to finish. Highly recommend The Edge for lunch, dinner, or brunch!”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVgyTkNRelppYldaeFZrNXJiVGRtWjJ0eGNHYxAB",
            "text": "Authentic veggie burgers!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZmFsaFhaM2xmZURST05qZHFRVGRUV21WYWIzYxAB",
            "text": "Good food nice drinks and good seating i like it overall. And its black owned 👍🏿"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saFQyMTBia28xZVcwMlpGaHdOWHBwZEU1YVMyYxAB",
            "text": "I was there last weekend. I have to say; This food was really bad but I wouldnt dare say while there. We sat at the bar after a grueling walk in the sun hoping for a great meal. Grits were lumpy, my shrimp was on its last leg and mushy. I sat at the bar with a friend; it was our first time here. I did see some great plates being served to others (fish burger with plantains looked great) but we chose 2 dishes that fell flat. Really flat\n\nThe highlight? The bartender was so knowledgeable and kind. Learned about the spirit-based cocktails and tasted some great offerings. The sangria is not only yummy but a creeper. I was surprised how much I felt after just one. I'll def be back for a drink. Not too sure if im going to gamble the food again.\n\nI just have to say. Lumpy grits is criminal to a mom who goes out rarely these days. I really was hoping for a great experience. The chef/GM needs better quality controls. Mushy shrimp is playing hopscotch with your stomach and illness."
        },
        {
            "date": "3달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZmVGSlRXamRDV0VWT09VZFhZblp1UW05YWRrRRAB",
            "text": "香ばしチキン良す。のんびり出来る雰囲気も良き。"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWGRXeFFhWFEwZWpSWlptTktNRTgxYjBGUlZXYxAB",
            "text": "The food was not good at all."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWWVVbEhXSGw0VW5CMlFUa3lWWGx2YzJsS2IzYxAB",
            "text": "Friendly staff that greeted us upon entry. Very relaxed place with vibrant energy. Food and drinks were delicious and hit the spot. Will definitely be returning for more."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaS03X2pnRRAB",
            "text": "The drinks were great. I caught an artist/singer named Eliki there. Good set. Justine was working those drinks my way. The rum punch with champagne does the job. Next time, I'll have the jerk salad. Everyone around me was tearing that dish up !!!\n\n🔴UPDATE🔴\n\n3/2022\n\nAlmost 4 years later and the Edge is one of my favorite eateries. The staff are great, and the clientele is phenomenal. I'm working on my 100th plate of jerk chicken salad, im not joking❤️.  The Edge Harlem music series on Wednesday,, should be visited and heard !!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFVsTkZjalZXUm5KaWNtSk9NM0ZoUVhObE5HYxAB",
            "text": "Cozy, neighborhood gem for cocktails, food and hanging out with friends or date night. Sorrel is homemade and everything is fresh and delightfully delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMk4yaENURVozUmpJdGVHTnlkV1ptTkZaRVJIYxAB",
            "text": "Amazing place to eat! The food was delicious. This restaurant is really well located, thus I recommend to book a table well in advance if you want to eat there on a Sunday. (I visited this place in July 2023)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWlEydHhUMFZWUlhZM05ucGpPRkZKWVdSRGJtYxAB",
            "text": "Deliciously spicy jerk chicken. Soulful live music. Service- meh."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUk1sTTVZVzlwYVUxWFNsaGZTRXB3YmpNdGFVRRAB",
            "text": "I had shrimp grits and eggs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbk1ubE9XR054VWtWSk1HSlphWGR1Ym5jMFRIYxAB",
            "text": "Everything was amazing. So much flavor! I'll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMU0yZHRWR1pTYTNkWlZrTnZiMWh5U2xCdFZtYxAB",
            "text": "Had the Jerk Shrimp Pasta was tasteful first time having that dish would order again first time at restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdmVGSkpXRk5wZEV0UlRsSmljR0U1YkZCSGNWRRAB",
            "text": "Waiters were incredibly rude. Food was good at best and had to be sent back to the kitchen as it was not cooked as ordered the first time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab1J5MVRVVTAyUjFSQmFuaGFkMXBWTWpKRGVGRRAB",
            "text": "Great restaurant with excellent service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSDFfZHk0dTRDVXBnRRAB",
            "text": "Food was pretty good, with jerk chicken wings my favorite dish.  Service was excellent.  Great attitude by entire staff.  When there were shortcomings, the staff worked hard to keep our party happy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZjcydnpwdGRhR19RRRAB",
            "text": "Food and service are excellent. It's a great place to meet friends, go on a date, or take your kid after school on a Friday like I do lollll"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMk42cldMMzVuSW5RRRAB",
            "text": "This place is IT!  We decided to try this place for brunch and we were completely blown away— the initial impression was something to write about. The place was clean the decor was lovely, albeit small, the service was impeccable and the food, sublime, even the playlist was relative and played a role in our food experience. The carafe of ginger mimosa was refreshing and I felt my palate tickled with every sweet sip. The soup was a first, and a beautiful one.  It was smooth creamy and delicious !  All the appetizers were spot-on in flavor presentation and taste. The entrees were delightful, I loved the festivals, they tasted just the way I expected them to. Yum! The grits were filling and velvety and the flavor was mild, the tacos are worth the try, the kale was not soft at all, it had a nice crunch in every bite and you could just taste the health in every bite. The bread pudding was out of this world! You have to try it! This place is the perfect place for nostalgic Jamaican food, or some authentic NYC eats. Check out the pics. Go to Edge, don’t walk, run!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJVzN5ZWJkek1YZnBBRRAB",
            "text": "Just celebrated mother's Day at this location. My mom's kids wife all like the food. Service was great. Definitely will come back. The Hanger steak was probably the best I've had. Party of 6 with numerous appetizers and entree...came out to just 400. Well worth it supporting small businesses. They have wine and assorted Beers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYkw5c1hrb2I2YjF3RRAB",
            "text": "Such a good vibes!! I will definitely come back again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVFAxOEc4bFlia29RRRAB",
            "text": "My kids me there for my birthday two years back to back and I'll be there for Mother's Day love the food ❤️❤️❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvci1USVl3EAE",
            "text": "Very cool laid-back spot. Reminds me of a speakeasy. Get there early due to limited seating.  Fish and chips was great and my wife loved the jerk wings. If ever in Harlem again, I will definitely slide through."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndHVDYUx3EAE",
            "text": "Not the best experience. We read the good reviews and we were really looking forward to eating here for Sunday brunch. I now question those reviews. The place is very small and they did not have some food items. The people who were seated near us and left before us, left a lot of food barely touched. That should have been a sign. The codfish fritters were undercooked,  we sent them back to be cooked and they still were not edible. The crab cakes were not worth the price. They were more bread than anything else. My husband thought the jerk chicken and waffles was “okay” I ordered the ackee and salt fish with kale,  it was okay. My friend did not like the jerk chicken quesadilla or kale salad. She couldn’t even finish it. I don’t know who wrote the five star reviews. There was nothing there 5 star worthy. We will not be returning or recommending this place to anyone we know."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cm9Hb3lBRRAB",
            "text": "This place is a vibe. Great brunch spot, I went on a Tuesday.  They had fresh flowers on the table . I got the\ncurry chicken sandwich.  I enjoyed the option of salad on the plate. My girl got the jerk chicken ... I would say they aren't as spicy as jerk chicken that I know, but the flavors are rich and decadent.  Will check out the dinner or drink next time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc2ZQTWtRRRAB",
            "text": "I went to this restaurant today for brunch, and I had such a great experience! The service was excellent — super attentive and friendly. The food was delicious, fresh, and beautifully presented. Overall, everything was well-organized and smooth. Definitely a place I’d recommend if you’re looking for a good brunch spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZ192cmZ3EAE",
            "text": "We visited on a Wednesday afternoon and it was bustling. I imagine weekend brunch is a whole vibe. The ambiance inside is inviting, warm and cozy (see photos). I appreciate the artwork, photographs and decor. It speaks to the rich heritage of Harlem and specifically to the area where the restaurant is located. There’s a decent amount of seating, some tables are closer to others than I prefer. However our table was perfect for me. You can make reservations which might be a good idea. There is also a good amount of outdoor seating. Visit their website for the policy regarding time allowed at table (to be able to accommodate more customers)… seems reasonable to me.\nMaia took good care of us. She was friendly, attentive without being intrusive and on point. She came back and checked on us although the restaurant was bustling as mentioned previously.\nThere is a list of specials beautifully written on their board. With so many dishes I wanted to try… I must return (maybe for one of the live music events). I was intrigued by the fusion of food from different cuisines. I ended up ordering curry chicken sandwich with salad and plantain on the side. It was a good portion. I was full without feeling overstuffed. Definitely worth a trip to Harlem to check them out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieGEzODVnRRAB",
            "text": "So freaking good! Came across this place for Sunday brunch and everything was so freaking good. Pretty big space inside. The food was so delicious and big portions too. The menu has Jamaican, English and American fare. The food came out lightning fast. Every bite of my BLT with Jamaican Jerk chicken was to die for. The shrimp and grits was also perfect in every way. And plenty left over to take home. This a great place and very popular too."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcjZtcHF3RRAB",
            "text": "The Edge Harlem es conocido por su exelente comida y muy agradable ambiente. Usualmente es muy concurrido, pero lo visité un domingo en la noche había más tranquilidad. Mi familia y yo fuimos muy amablemente atendidos por Angela. Entre ella y mi hermana que ha visitado The Edge muchas veces hicieron sugerencias que seguimos sin vacilar y no nos arrepentimos! Todo estaba verdaderamente delicioso! Me complace además haber podido degustar una cocina diferente y que estando tan cerca de mi hogar no conocía. Los postres y cocteles tambien son algo que recomiendo mucho probar.\n\nThe Edge Harlem is known for its excellent food and very pleasant atmosphere. It is usually very busy, but I visited on a Sunday night and it was quieter. My family and I were very kindly served by Angela. She and my sister, who has visited The Edge many times, made suggestions that we followed without hesitation, and we did not regret it! Everything was truly delicious! I am also pleased to have been able to taste a different cuisine that, being so close to my home, I did not know. The desserts and cocktails are also something that I highly recommend trying."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaU1fVklBEAE",
            "text": "Fantastic restaurant, relaxed and tucked away. Welcoming atmosphere and the food is delicious, so many good options on the menu. Went for dinner on a Sunday but am going to return to try the brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0ODhXdDl3RRAB",
            "text": "The restaurant sits on a quiet block outside of the hustle and bustle of where other Harlem eateries can be located and look like. I appreciated that...Food was surprisingly good! It was fresh, hot and flavorful especially because I expected to be underwhelmed by sandwiches.\nService was also good! It was busy and even though we were late for our reservation the restaurant accommodated us right away and we were ordering with in 5 minutes of sitting down and eating within 20!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbk1hNmtnRRAB",
            "text": "I had the jerk chicken alfredo and my friend had the salmon they were both lacking seasoning. It doesn't seem like Caribbean people or people of color make these dishes either that or they pander to a gentrified crowd."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHIzUWZBEAE",
            "text": "Ce fut un très agréable moment dans cet endroit chic mais accessible. La cuisine est excellente. Une véritable explosion de saveurs. Les ingrédients sont de bonne qualité.\nLe service est rapide, avec un personnel attentif et toujours disponible.\nNous avons mangé sur place, la musique d'ambiance est bonne mais pas forte pour mieux s'entendre parler.\nJe mets 5* sans hésiter. Et c'est mérité.\nBonne continuation"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdmJ1S25nRRAB",
            "text": "Coffee was cold and food wasn't very fresh. The young lady with the braids who was the hostess was very nice though . The festival tastes like it was cooked the day before and reheated the fritters were not cooked all the way through the Grits were old they weren't creamy they were stiff and the pancakes were just really not good at all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbS1PLWtnRRAB",
            "text": "a basement level restaurant as soon as you walk in you smell musty. It could use better ventilation. The decor was eclectic. I really wanted to like this place, the food really disappointed. When it came to the food they had specials, which is great but they had this small board up which, depending on where you’re sitting, you can’t see it. It would be helpful if the waiters recited them to us instead of pointing at it. We orders they were out of jerk wings. Cod fritters were tough and chewy, curried chicken was a tough meat, and we ordered the sliders and we were seriously disappointed. It felt like a corner deli trying to be fancy with some burgers on toast.  The drinks were actually my favorite part. They have a signature 580 drink that was really good I recommend, the drink…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOW8yMW1nRRAB",
            "text": "Review of The Edge Harlem\n\nFood:\nThe food at The Edge Harlem is undoubtedly a highlight. I ordered the ackee and saltfish, which was flavorful and well-prepared. However, the portion size was on the smaller side. If you’re planning to order this dish, I recommend requesting a double portion to fully satisfy your appetite.\n\nAmbiance:\nThe initial atmosphere at The Edge Harlem is warm and inviting, with a chill urban vibe that complements the menu. Unfortunately, the ambiance takes a hit as the restaurant fills up, becoming quite noisy and making conversation difficult. Additionally, we were seated under the chalkboard with the daily specials, which proved to be disruptive as guests frequently interrupted our conversation to view or photograph the menu. For a more pleasant experience, avoid this seating area. Also, the restaurant isn’t wheelchair accessible and has only one washroom, so expect potential wait times if it’s busy.\n\nCustomer Service:\nThe service was a letdown. While the host was polite and seated us promptly, the servers seemed disingenuous and lacked enthusiasm. We had a minor issue with our order—a latte was served as an espresso. When we mentioned this, the server became defensive and involved multiple staff members in an unprofessional manner. Instead of addressing our request to adjust the bill for the incorrect item, the server insisted on removing the charge entirely, which was not what we asked for.\n\nOverall:\nDespite the service and seating issues, The Edge Harlem’s food makes it worth a visit. The ackee and saltfish, in particular, stands out, but be prepared for potential challenges with the ambiance and customer service."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLTVDRWJ3EAE",
            "text": "The Edge Harlem is one of my favorite brunch spots. I rank it in my top 5 places to go for quality of food, portion size and service.\n\nPancakes topped with fresh fruits & cream is a great brunch choice, with sides of bacon and eggs! It’s the perfect breakfast.\n\nIf you’re ordering drinks I recommend the 580, served in large glasses and made strong! A few of these will have you feeling very nice.\n\nBe sure to get to the restaurant early because wait times can be up to an hour during brunch. It’s a tiny space that fills up quick but the staff does a great job managing table wait times.\n\nI can’t wait to go back for more delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeU9IOC13RRAB",
            "text": "What can I say? I love this quaint neighborhood spot! My cousin and I had a cousin-date there for brunch and the food was on point! The crispness of the fish and the creaminess of the grits was beyond great. Sorrel was really fresh and tasted just right 🥰 Service was very good as well. I thought about the grits today😉😋🤣"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ1l1LXp3RRAB",
            "text": "Loved the food, the vibe, the service, the music they played. Ginger mimosa was amazing and coconut fish burger with fried plantains and green salad was delish, jerk chicken quesadilla had right amount of spice and flavor. Service was professional, friendly and helpful. Satisfying meal. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeTc2NWJ3EAE",
            "text": "Fantastic! This delightful spot is perfect for brunch, lunch, and well everything. Absolutely delicious food, great-sized portions, and reasonable prices. They offer mind-blowing hot sauces. We had a grilled cheese sandwich with avocados and a coconut fish burger. With a beer, our bill was $50 for two people. Bar seating, indoors and outdoor tables available. Gives Greenwich village vibes - cozy, warm, worn in, and homey. Impressive art on the walls. Gonna be my frequented spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa3VxeWl3RRAB",
            "text": "I have yet to try more of their food (I had the open faced fried egg sandwich/ turkey bacon/ oat latte), but I already know the other food will be fantastic. The service was fast and very attentive, and they even recommended hot sauces that would be best with my food & told me the background of the restaurant. Peaceful and spacious outdoor seating (in the shade and the sun!) Definitely give it a try! What a nice experience.\n\nEDIT: I decided to get some dessert too - the chocolate mousse is to die for 🥵❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac0kzbHp3RRAB",
            "text": "The absolute best meal we have had in a very long time. The jerk chicken,  the coconut fish burgers, the FRIES!  Even the avocado on the side was perfection. Highly recommend the full carafe of rum punch as a starter :-)  You will leave full amd satisfied."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWNDSGlRRRAB",
            "text": "This place was a recommendation from a friend and a good one. We came for breakfast and this is not your typical breakfast place. Our order of crab cakes, fish, fritters, eggs, grits, cheese and chive biscuits and coffee was delicious but also every plate that passed by us looked good. I will definitely come back to  try more things. Follow them on Instagram to see daily specials and more photos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaEo3ZmdBRRAB",
            "text": "I absolutely loved this place! I was visiting from South Africa and I was looking for a great brunch spot and found this gem. The food is delicious! I recommend fish fritters and coconut fish tacos. I came here twice during my visit because the food is so good :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd0xQZFd3EAE",
            "text": "Great cozy place for brunch, owner’s/management were very welcoming, friendly and helpful with accommodating our large group reservations. Service and food was excellent, they have a variety of options you can choose from."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxX3NmMWp3RRAB",
            "text": "Great vibe and yummy food.\n\nMy family went for a brunch meal and we had a great meal. All of us had a different things and everything was delicious.\n\nI am sure we will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanBmWXh3RRAB",
            "text": "I didn’t have the best experience today. It was almost like we got kicked out. I get it there’s a policy for brunch. Maybe ask if there’s anything else we would like to order or remind us of the time so we can move accordingly. Otherwise the food was great. I probably won’t be coming back here because of the service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcHBuQmRnEAE",
            "text": "We had a reservation and were greeted outside for out reservation! Moses was our server and took great care of us. I got the ackee and salt fish special with grits and avocado, a festival, and codfish fritters. Everything was delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLXZqc3RBRRAB",
            "text": "First time going. Ordered the jerk wings, crab cakes, fries & jerk shrimp Alfredo to go. The fries are delicious. Jerk wings were good. The sauce that came with it was 10/10! I would by a tub of it. Crab cakes were disappointing. They were pretty cold and just wasn’t what I was expecting. The pasta was good. Gave me 5 shrimps.\n\nThe place is on the smaller end. Navigating btw tables can be a bit difficult because of the chairs. And people leaning back and what not."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCd3E2RGlRRRAB",
            "text": "Hands down awesome place for food and drink in the area. Excellent service, lively atmosphere, awesome food. I had the crab cakes with plantains, my date had shrimps with grits. Both great dishes, without fault. Would love to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTgtejVBRRAB",
            "text": "I’ve eaten here a few times, mostly with friends and family visiting the city.  I’ve never been compelled to return on my own, as the food and service is inconsistent, and for the same price, you can go to 20 places in the neighborhood that will give you better value for your buck.\n\nFrom my most recent visit, this photo was of the $6 side of sweet plantains I ordered.  It came like this, and didn’t cover even half the plate it was served on.  It costs $1-$2 to get a ripe plantain from the store, and it looks like they served me a quarter of one for 6 times the price.  I felt like I was being ripped off.  My food otherwise tasted good, but nothing incredible.\n\nWhen I’ve been to brunch, it’s been crowded and uncomfortable.  I’d love to have a reason to return, but I usually end up going because someone else wants to try it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveC02ZHhBRRAB",
            "text": "Picked this place based on reviews. Food was basic. I had the jerk chicken and waffles.The food needs seasoning.The codfish fritters were okay because I was able to get a bit of flavor. I was charged for something I ordered and was never sent to the table. I had to point that out to be removed from my bill.\nThis is a small spot the service was just okay.I notice the waiter asked the guest directly next to me if everything was okay and if they needed anything way more. The vibe was just off in this place for me and I visit alot of restaurants. Sorry this one is a no for me.A little fan needed for the current weather. If your playing music put it at a volume were people can make out whats being played and music that brings a little vibe even that was a no for me. I heard a few people complaining it was hot. This review is me be completely honest. Not sure how the review rating is a 4.5 for this place.. but I was disappointed.Not the type of restaurant experience I,m use too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX09ieVNnEAE",
            "text": "A great reason to visit Harlem…if you haven’t! The food at the Edge is really good. I thoroughly enjoyed the plantain crusted crab cakes and the hibiscus sorrel which wasn’t too sweet. The Sautéed Kale was rich with flavors and complimented my meal really well as a side. The staff are also very professional and sweet. You should also try the codfish fritters with the jerk lime dip. Yummmm! The meals also came quickly which was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb18tcVRBEAE",
            "text": "Very cute spot. Service was nice and it wasn’t too crowded. They had delicious specials and regular items on the menu as well. Everyone’s plate looked delicious. Mine didn’t look as appealing or much but it was very good. The smoke salmon was extra."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaU5QbTJRRRAB",
            "text": "I’d just cut straight to the point, I loved what I ordered - fish and chips, the fish was delicious! Would order it again. It’s a simple laid back spot, I went to brunch on a Sunday with friends in mid May 2021 and even with reservations we had to wait 20 mins to be seated, seems like a really popular spot. The service was okay, could be better.\nThere are a lot of things in the menu which could be overwhelming but I liked how they grouped the menu into Jamaica, England and New York dishes. Try the sorrel drink, it’s good."
        }
    ],
    "reviews_count": 83
}