{
    "name": "Melba's Restaurant",
    "place_id": "ChIJ-bhM6yL2wokRAtIoWi_TL2k",
    "grid": "MN11",
    "address": "300 W 114th St, New York, NY 10026, USA",
    "rating": 4.3,
    "user_ratings_total": 4486,
    "phone_number": "(212) 864-7777",
    "reviews": [
        {
            "date": "수정일: 6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcFBiNEp3EAE",
            "text": "On arrival, the hostess greeting was more than welcoming. It felt like home.\nOur waitress, OLAY, is amazing! Went above and beyond on an off the menu request and was capable of obliging me. Excellent work from back to front. Will return soon"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQmRTMXhRMUl3WDNkYU9UZExWWGt0YlZwS1RuYxAB",
            "text": "Supper yummy oxtails, collards, yams and Mac and cheese. I wasn't crazy about the chicken and waffles (the waffle was too soft)"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMVVUaHRNRGRHYkhsSFMwMXlkMDF1VkdwelNGRRAB",
            "text": "Great experience"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRVMyVlZURzF5V0dOV1gyOURNVU15UkVoek5tYxAB",
            "text": "I brought my mom to Melba’s to celebrate her birthday and we could not have had a better experience. The food itself was phenomenal, but the service and attention we received from Olleigh and the other staff really exceeded expectations. They made my mom feel so special and treated us like family. For that, I will definitely come back."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVQzWklNMkl4ZFcxTloycG1TR0ZYVFRCalpGRRAB",
            "text": "Nice restaurant, not too big or small. There were two sides, both had seating area but one side had a bar. I tried the jerk oxtails which were small, but seasoned very well and I received a good portion.\nMy son enjoyed the chicken and waffles, which was probably our favorite.\nThe short ribs were also seasoned well, but overcooked. Overall, I enjoyed and would go again."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd0tIQUZREAE",
            "text": "Catfish and Eggnog 🧇 was delicious 😋😋😋 + Harlem Bourbon ice tea was unbelievable!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRlVYQmxjVkZxV2xKdWNEUlpNVVZmTkhwemVYYxAB",
            "text": "I find new reasons to mention this place in conversations daily. The team combines perfect service with notable cuisine. Melba's Restaurant stood out from other names instantly. All our chosen dishes were fresh, flavorful and carefully prepared. Melba's Restaurant is a place you need to visit."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVR6UnVPR1pqWDNKM1ptODVWa0pJWXpkb2IxRRAB",
            "text": "Auténtico!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVlXb3pibHBrV205eUxXUjZTbFUyVVZoelJsRRAB",
            "text": "Fantastic food! Great stop after exploring Central Park North. Braised short ribs were amazing. Had the mashed potatoes and sautéed spinach with it!! Everything was spot on. Had 2 of Melba’s HIT (Harlem iced tea) they were really great. Took a piece of sweet potato pie to go too. My daughter had the sliders and a side of fries. She loved them. French fries were hot and crispy. Tuquan took care of us. He was kind and efficient."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFJXUnFiR2xQVkdNNVZuWlpVVWxGYVZnMmQxRRAB",
            "text": "As a culinary graduate, I must express my disappointment with the overall experience, from the appetizers to the customer service, which fell short of my expectations for a soul food establishment, particularly given the chef's notable achievements, including a victory against Bobby Flay. In my opinion, a refresher course in culinary education may be beneficial, as the dishes lacked the essence of soul food and love. During my visit today, I observed the restaurant's decline, with the staff struggling to keep up, while the chef failed to provide adequate support, resulting in a disappointing experience that warrants a 0/10 rating from me."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcWVteEROVVI1VkRGTWRFSXhia2N4TjJ4NGVtYxAB",
            "text": "Try it you won’t regret ! Very flavorful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWMyYzBTR2w1UTFVM2NIcGxZVWsyTkRjd2RWRRAB",
            "text": "The food was fabulous and well seasoned. Everything was good, the smothered chicken,  candied yams and collard greens."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNGIxVlhaM2N6ZHpOV1pXaElaak5YU21oR1JsRRAB",
            "text": "Ate and nibbled the salmon  was dried out and the skin was on it tasted like they had it sitting out for a long time  The mac and cheese was dry no taste but processed cheese was not seasoned the yams were blocks of stiffness no seasoning cold I do not know what any of this food came from but the fish smelled as if it was not cleaned nor was it tasty what a waste of money and time that I would never get back just horrible unbelievable gut stuffed food I had to dump it all out of my body is the reason we all are walking around fat and looking stuffed southern my behind they do not cook like that in the south travel  this is how it looked on my plate I threw it in the box I could not add to it at home the food was never fresh Chewing was not a pleasant  The ingredients never mixed  first and last time  EVER if you all call this food travel"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeU5ERXpSRlptZURGSmNEVjRXRzVOWjFseGFsRRAB",
            "text": "Food was good service was bad thanks to the guy by the door to get me a table only that guy was nice no one else"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWFgwNW5XbWMyZDFKa1lUWTBhVTkwYWtKblEwRRAB",
            "text": "The best food ; familiar cosy delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200ek5GVkNlV1l0YzFZNE5WOUNSV3RQV2t4dFdsRRAB",
            "text": "Please don't order the meatloaf.\nIt was terrible...looks like dog food with bbq sauce on top.\nThe meatloaf was hard.\nThe mac and cheese had no taste\nThe collard greens was under seasoned as well..\nIt is overpriced and definitely not worth the money"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNWJ6TjJNWGRPWDBJNFowVnBTMm81V0VneWFGRRAB",
            "text": "The services quick, the server was pleasant. But, the food arrived too soon. It seems as if the food was made earlier. I ordered fish and Rice and greens the fish with chewie and some of the rice were crunchy. Would you let me to believe that my food was microwaved and not cooked fresh on that moment and again it arrived way too soon.\nWithin 10 minutes or less the food was at the table. I'm quite sure if the meal was made fresh, it would have been better and I would gladly waited for it."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmekxXYXRnRRAB",
            "text": "Great quality soul food and friendly service. The taste was where it needed to be. Will definitely be back!\n\nEdit: went back and am taking off a star. Service was horrendous and the hostess at the door wasted 45 minutes of my time when I could have just sat at the bar. They seated community elders without a reservation who came after me, but told me I needed a reservation. Found out I could have just sat at the bar the whole time. Wasn't even offered to me as a choice. No, I'm annoyed, I'll take off another star on top of it. Don't treat customers like that."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMlIwdzNlVkJxV0ZGbVRVZG5helUwYjNkSVIwRRAB",
            "text": "Absolutely  loved it food is wonderfully atmosphere is nice"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1pFdE9ZekUyT0VKNFVsY3dPR0poTTNNd1dtYxAB",
            "text": "I ordered the Mac and cheese, collard greens and the brisket. The portion size was large which was great because I was able to take food home and had enough for another two days. The Mac was very oily but was okay. I really loved that the collard greens had a nice sweet subtle flavor to it which paired well with the brisket. The brisket also had a bit of sweetness to it which could be overwhelming to me had I eaten the entire thing. I would probably try something else the next time I visit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMFEyTk1WbGhTZW1vd2FIaHpRMnBTVmxCM1FXYxAB",
            "text": "💔 “The Soul is Gone from the Soul Food”\nThis hurts me to say, but it needs to be said the soul is dead in the soul food here.\nI’ve been coming to Melba’s since around 2011. Back then, there was passion in the flavors something special I looked forward to on a Friday or Saturday night. It felt like down home cooking outside the house. The fried chicken, potato salad, and mac & cheese were my holy trinity of comfort.\nBut my last few visits convinced me that this Harlem icon once a representation of southern Black cooking has lost its spark. The food has gone from distinctive flavor and love to flat, two-dimensional saltiness. The mac & cheese is inconsistent; one day creamy and soulful, the next day bland and confused. The potato salad has lost its tang and depth. The candied yams taste like straight sugar no cinnamon, no nutmeg, no warmth.\nThe fried chicken, once worth waiting for, now hits the table in minutes clearly pre-prepared, sometimes even tasting refried. It’s lost that crispy pride that used to make it special. Even the shrimp were rubbery and overdone, and the catfish bland, lifeless.\nMelba’s used to feel like home. Now it feels like a cafeteria. What once carried Harlem’s heartbeat the pride, the patience, the passion has faded.\nWhere is the love that used to live in this food?"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NmRGTjZUekY1YkRablpVUXhNVXRDYjI5VFdFRRAB",
            "text": "Absolutely A Place To Go When Visiting Harlem!!! A Fan Favorite ❤️"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndXAyRVV3EAE",
            "text": "Great food service and hospitality"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWFpXaE5aRmw0VnpoUFVWQlJSamx0VkVreU5sRRAB",
            "text": "Amazing Resturant HIGHLY RECOMMEND!\nThe service was great and fast and attentive, even though they were very busy.\nFood was delicious, southern comfort food.\nEveryone was so friendly. The owner was also walking around socializing with all the customers which was so cool!"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdFBmWjNBRRAB",
            "text": "I think maybe it's popularity has changed this spot a little bit.    My visit several years ago was characterized by much more personal service and larger portions, but at least food quality hasn't suffered at all.  My chicken and eggnog waffles were excellent, best in class on both items.   Likewise the fried catfish was quite good but had just one really tiny piece, and would have benefited from some hushpuppies.   Still a landmark place worth a visit!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSmFUSndXbDg1TkVad2QydERkM1ZaWWs5eVMxRRAB",
            "text": "I felt that the hostess was not welcoming. The short ribs were tasty but the portion was too small. The Mac and cheese was warm on the outside but lukewarm on the inside. Nice atmosphere and our waiter was good."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFRWTnRMVU5NZG1aclJ6TlRWV0ZrUWs5dGNVRRAB",
            "text": "Olleigh was a fantastic server!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMFVqUTJXV0ZRTjNNNFUzQmpXalZwWkc5TExYYxAB",
            "text": "I had a STUPENDOUS time at Melba's last Friday. First, I was greeted warmly by the hostess who sat our party quickly. Then, Olleigh, who was our server, took us on a food journey/flavor odyssey that I will never forget. First, she walked us through menu and we decided on the signature chicken and egg nog waffle and the country catfish plate. The waffle was light, airy and delicious without syrup, and the chicken was full of seasoning and fried perfectly. The catfish also was fried perfect, and the macaroni and cheese and greens were a great compliment. Olleigh sold us on the strawberry hennessy drink which was delectable, and imagine my surprise when she remembered it was my birthday and brought out a lovely slice of red velvet cake, complete with the staff singing happy birthday to me! In addition to Olleigh's beautiful spirit and attitude, Kenny was also fantastic, along with Ilgle and the manager Mario. If you are thinking about giving the world famous Melba's a try, do not hesitate. You will not be disappointed-the food, staff, and experience are bar none."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcmVXOXVSRTB0YlUxeldrbEpkV2x0TldacldFRRAB",
            "text": "Date: Saturday, September 27, 2025\n\nTo: Management\nMelba’s Restaurant\nFrederick Douglas Boulevard West 114th st\n\nFormal Complaint – Staff Misconduct and Intimidation\n\nDear Management,\n\nI am writing to formally report a serious incident that occurred during my recent visit to Melba’s Restaurant involving one of your employees, Olay.\n\nI am a frequent customer and have always held your establishment in high regard. However, on this occasion, I experienced behavior that was not only unprofessional but also threatening. During my visit, Olay rushed me through my order and treated me discourteously. The situation escalated after Olay bumped me causing me to drop my food. I left the restaurant, when Olay followed me outside, confronted me aggressively by getting into my personal space, and placed her hands on my shoulder without my consent. This behavior was intimidating, unwanted, and made me feel unsafe.\n\nI want to be clear that this type of conduct is unacceptable under any circumstances. Employees of any business, particularly one that serves the public, have a duty to maintain professionalism and ensure a safe environment for patrons. What I experienced was the opposite — it was harassment and an invasion of my personal boundaries.\n\nI expect this complaint to be documented and investigated immediately. Please advise me, in writing, of the steps you will take to address this matter and prevent similar incidents from occurring in the future. If necessary, I am prepared to escalate this situation further with the appropriate authorities.\n\nThank you for your prompt attention. I look forward to your response.\n\nSincerely,\nJennifer Flores"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUFkwNVRjV1pwVjBGZldIQlJiRWhqYVhadGJYYxAB",
            "text": "I booked a reservation dinner for a Bachelorette party last night. We had an amazing time especially since we had an amazing waiter Kenny. Shout out to Kenny who went above and beyond with his service and was such a pleasure to meet. The food was amazing & the portion sizes were great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWk5sQk5lV1pJT1hsVFgwdzBhV0Z4ZDBkb1JuYxAB",
            "text": "I enjoyed dinner with friends at Melba's. The staff made us feel like we were at a friend's dinner party and FOOD WAS AMAZING!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTGQwRlRja3A0VUdOVllscHZkMHg2UW1KRGNWRRAB",
            "text": "I loved Melba’s. This was a real treat. I am grateful for my experience at Melba’s. The food was 🔥🔥🔥. They accidentally spiled a drink on one of my friends and compensated us well for the accident. Much respect for making things right abd going above and beyond. The Jamaican oxtails were the right decision along with sweet potatoes and greens. The cakes were delicious as well. I appreciated the art work inside. I would definitely go back!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSFpXZHBXVlJuTW1oZmVHazRMVFpNTUV0WlZtYxAB",
            "text": "Très bonne cuisine. Personnel très aimable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWE5tcGZTM2hzVjBSdGNrOXNORlZNZVVadFkxRRAB",
            "text": "My meal here was wonderful. All my selections demonstrate flavor. Restaurant staff are pleasant and accommodating, with promptly served dishes. Finding this restaurant randomly was a good turn of events. The restaurant occupies a prime area and the staff attended to us completely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWU5YTmlSa3BGZVVWb1NsSnJkRXh5ZWw5RVduYxAB",
            "text": "Melbassssss! You have done it again! As a native New Yorker I have been here once (prior to COVID) and loved it and here I am years later and love it even more. It was soooooo good and the customer service by Kenneth and Brian was amazing! I almost thought we were friends lol! I had the smothered chicken with mac and cheese and candied yams! I loved it and my mom who isn’t easy to please had the chicken and eggnog waffles another hit she said the fried chicken was the best she has had in a restaurant! Thank you for an amazing dinner and customer service experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseFJqVTNTbmR6WjFKTlduTjBjMmc0U1c5NVZYYxAB",
            "text": "We were not in NY for long but this is a spot I'd go to again and again. Our food came out fairly out at the same time and we were silent. We were too busy eating the food and enjoying it. The team there were super helpful and made our Harlem visit one that was so enjoyable and welcoming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMlZGTmlVbk5IUzJScGNERmFVM0F4TUV4QlMwRRAB",
            "text": "Best soul food in Harlem"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZldUTTVRbkJKUVd4TkxTMWZSV1V5TnpGSVpsRRAB",
            "text": "4 stelle per il cibo. Il pollo \"smothered\" è stato sbalorditivo, servito con 2 contorni a scelta; noi abbiamo scelto i maccheroni al formaggio e le patatine fritte.\nAmbiente essenziale, non pretenzioso e assolutamente in linea con il sud america.\nServizio sbrigativo e poco attento unico vero flop.\nConsiglio comunque una cena qui dopo una passeggiata ad Harlem e (perché no?) un concerto gospel!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVQzTjFNRjlrYWxKVlRGcDVWa3BHWTB4WlUzYxAB",
            "text": "I had such high hope for this place my daughter had ranted and raved about everything she had her,\nWell now it is my turn hostess was warm server was great ! I ordered fried chicken yams Mac n cheese and collard egg rolls… price was okay\nTerrible Terrible terrible\nWhy the Mac and cheese had to have been leftover it was EXTREMELY DRY WITH NO TASTE\nTHE FRIED CHICKEN WAS COOKED TO DEATH WITH NO SEASON AT ALL my daughter had the collard greens and they where SCORCHED\nAND THE YAMS WHERE DRY AS WELL TASTE WAS OKAY\nMELBA PLEASE CHECK ON THE COOKS IN THE ESTABLISHMENT IT WASNT RIGHT ON 9/24/2025 about noon time …. So let down I could not even eat it\nI WISH I COULD ADD THE PICTURE TO SHOW"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFVFY3dUMFYyV1VwR00xZGZPSEJUZDNCaWMxRRAB",
            "text": "I’m embarrassed to say this was my 1st time here being that I grew up in NYC. Anywho I’m glad I finally got a chance to go. The service was great. We didn’t have reservations(which i would recommend) my brother hadn’t gotten there yet and when he finally did we were able to sit right away which I appreciate because they didn’t give away our table. I also had my niece with me and she’s not a people person and they tried really hard to get that little girl to smile to no avail but I appreciate the effort. On to the food. I’ll put it this way ever since I been thinking about it. That catfish was 🔥🔥. 10/10 would definitely recommend"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNb29fQWlBRRAB",
            "text": "On our go-to list when in Harlem. On our go-to list when in mid-town at Grand Central. Can't beat fast casual, nutritious, comfort food at a reasonable price in a food court setting."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1JITnRUVzlZT1VOSFZGWmhTakpVU1ZWaVZIYxAB",
            "text": "Kenny was our server and took great care of us while visiting Melba’s in Harlem. The food was served hot and fresh. We used to visit Amy Ruth’s down the street but they kinda fell off."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeVgzSk5WV1pHT0hOMVFWQnFWRVI2YmpkRExYYxAB",
            "text": "With my order I ordered shrimps. When the food arrived, there were no shrimps in the bag. When I called the restaurant they told me I had to call Uber eats to get a refund. They know they didn’t put the shrimps in the bag. How is Uber eats gonna help me with that? I paid for shrimp that I did not receive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM2JqSkJOVE5GTUdaRk0xaE1WWHBpYW5OSlZuYxAB",
            "text": "I have been to Melba's many times. Food is always good no matter what I get except the devil eggs, I didn't like the those. Took my bestie her first time she loved her meal. Braised beef, mac & cheese and collard greens. I highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZlgyTllSWE0zYjJWRldXNWpaamxTYjBoT1drRRAB",
            "text": "So those spring rolls was so addictive, the Mac and cheese was perfection, the short ribs were falling off the bone, the catfish was good just wish it was MOREEEEE 😂 but I was definitely pleased and taste buds were even happier. I'll be back soon 💜"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NjlhOE5REAE",
            "text": "I ordered the Southern Catfish, Tres Mac & Cheese and Candied Yams. No later than 15 minutes into my conversation with my friend did our food arrive. It was piping hot and delicious. The Catfish was HUGE!\n\nIt's not often you find a soul food restaurant with really good soul food. I believe soul food is hard to recreate outside of your grandmother's kitchen.\n\nOne thing I recommend is that you go before or after the weekend rush. Good Luck!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1kyNTJUMHBqTW5CME9UTjJiVWRoZG1WRldtYxAB",
            "text": "Use to sell fresh food last time I went a month ago they refried frozen catfish I could tell was not fresh at all was hard not soft like use to be. Don’t know what happened but I’m not going back after that again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTmJqVTJZM3BpV21aRGNXbHRSMlF3TjJGeVluYxAB",
            "text": "Good Service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFVWZFlUMWh4Wm5WQ1YyNVhlRVk1WkdabmVYYxAB",
            "text": "Recommend reservations on weekend. I came at 8 and has to wait about 30 minutes. Good food large portions i could not eat it all. The service was a little slow and inattentive our server missed items that were ordered and requested. Will definitely visit again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYWJ6Sk5TRW96TVZoMVVIVm9NMnBXV1VObGRYYxAB",
            "text": "The food was okay, not bad but okay . The service wasn't great. The waitress had a slight attitude and was kinda of rude, not to me but the elders I was dining with. I did speak to the manager. The volume of the music makes it hard to hear as you talk. I had seabass recommended by the waitress, it was plain with no flavor. The food was brought out at different times, the sides came out before the meat and we waited a bit, the wings undercooked. Will I come back. No, I'd rather go to Mannas. Sorry Melba"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob2ZYX1l3EAE",
            "text": "직원들이 친절하고 음식 퀄리티가\n좋아요 ㅋㅋ 혼자먹기엔 좀 비쌀수있음"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVRTMUJhVE4yUm1waFRXZG5PV1pFTkhoTUxYYxAB",
            "text": "My waiter was so funny. He made the experience better. It was unfortunate. He didn’t tell us about the Up charges although he’s the one that told us to get it saying how it was his favorite drinks. I did not enjoy the food as it was very salty. However, the restaurant was cozy and with minor improvement. It will be considered a true soul food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT04wVnFVQzFPU1hsYWVHa3lWSHB5WDA5Wk9WRRAB",
            "text": "First off, the food portions are HUGE. Each entree comes with two sides. I got the country catfish (I'd rate it 7.5/10) and my sides were mac and cheese and collard greens. The country catfish was pretty good but a bit salty. The sides were also delicious but the collard greens were pretty salty. The smothered chicken (dark meat, I'd rate it 6.5/10) was also good. The meat wasn't dry and there was a lot of gravy. The garlic mashed potatoes were very flavorful but quite salty. I lived in Atlanta for a few years and most of the comfort food down there was pretty salty too. We got the a$ap sugared yams which was probably my favorite. They were so sweet and very moist.\n\nThis is such a fun and lively place to eat at. It does get a little loud at times but not so loud that I couldn't converse. The service was also great even though it was pretty packed inside."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc2RtOVNiREJ4YkV0RmFGZzVOelJ1TWtOd1dVRRAB",
            "text": "For our trip to see Gypsy, I started thinking about what else we could do while in the city. Attractions, food spots, something memorable. Only there for 24 hours, our options were limited. Then I remembered Melba’s. When I mentioned it to my mom, she was immediately on board - especially once she recalled that Sherri Shepherd has raved about Melba’s more than once on her talk show. Just like that, one stop was locked in for this whirlwind trip.\n\nThank goodness I made a reservation for Saturday lunch. Traffic wasn’t too bad, and parking wasn’t difficult either. Even better, we didn’t have to walk far, which made both me and my mom extra happy.\n\nFrom the outside, Melba’s looks like a regular smegular spot. But the moment you step inside, you’re greeted with community and culture - it’s a vibe. The staff were warm and welcoming, and even the other diners felt like family.\n\nFor our meal, I ordered the Chilean sea bass with mac and A$AP yams. So good. Honestly, I was eating with my eyes before it even touched my lips because the plating was beautiful. My mom went with the fried catfish, collards, and A$AP yams. She loves catfish, and this plate didn’t disappoint - she was more than satisfied with both the portion size and the flavor.\n\nThe food was generous, and we couldn’t finish it all, so takeaway trays were a must. No complaints though - it definitely didn’t go to waste."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKcnhvNWZLdUxyR0p3EAE",
            "text": "Went here with my parents, we’re all born and raised in the South (Georgia). That being said, this meal felt like a southern inspired dining experience perhaps rather than a dip into soul food. Nothing was bad! Don’t get me wrong; but many of the dishes left more to be desired. First off, love the mac n cheese, they ate with that. Second, the sweet potato pie was pretty spot on. The crab cakes were confusing. They were a little bland. The fried chicken wings were also okay. The fries were unfortunately below average but I’m guessing most people don’t come for those. My catfish was solid overall and the collard greens were cooked and seasoned nicely. If you’re a new Yorker looking to dip your toes in southern cuisine, Id definitely recommend this spot, however, theres a lil southern spark missing. But ultimately it does give american comfort. Im American and I did feel comforted by this meal ☺️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TWFteG1kVFZJTTJSaU9UWlBTbll3YVc5VVkyYxAB",
            "text": "Fabulous food, excellent drinks, good people, great vibe! We had a late lunch here at the end of our vacation and it was the best way to finish the holiday on a high note. Prices are right, too. Can't wait to make it back next time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMVJteEZkalZ2ZEVWWGJUaFBMVmgxU0RKS2JsRRAB",
            "text": "I haven't even left the restaurant yet but everybody reading this needs to get their momma, aunties, uncles, and cousins down to Melba's to try this food. Best oxtail I've ever had by far, mashed potatoes were amazing, greens were amazing, mac and cheese (and I'm usually picky with this) was amazing. The Arnold Palmer was perfect. Come to Melba's today."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaElmUGJnEAE",
            "text": "Nestled in the heart of Harlem, Melba’s Restaurant is a top destination for authentic Southern comfort food in New York City. On a bustling Saturday evening, the restaurant was filled with energy, creating a lively and welcoming atmosphere.\n\nThe meal started with the fried catfish appetizer, which was expertly prepared. The fish was exceptionally tender, encased in a crisp, well-seasoned batter that delivered on both texture and flavor. For the main course, Melba’s signature chicken and waffles showcased a perfect harmony of sweet and savory, with crispy, flavorful fried chicken complementing the soft, syrup-kissed waffle.\n\nBeyond the food, the service was attentive and warm, adding to the overall dining experience. Melba’s is a must-visit for those seeking soulful, expertly crafted Southern cuisine in the city."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT21uZTJ4d05xMUFnEAE",
            "text": "The mac & cheese was amazing, delicious chicken thighs, and the sweet potato pie really hits the spot. Servers are very welcoming and friendly! The only thing I’d say is that the space can get a bit echoey when it’s a full house, making it hard to hear if you’re trying to have a conversation. Otherwise the food and services were great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKeUVuN2F5Xzd1RDhRRRAB",
            "text": "Quick lunch before heading back to the UK. I arrived at 11:15am ( I booked online & I do recommend ) i was surprised how full the restaurant was at this hour.\n\nThis spot was recommended & they sure did deliver. The chicken was crispy & the egg nog waffle & strawberry butter was just wow wow wow. The art work around the room is beautiful & service was great.\n\nBeing British I just wanted to try yams & greens wasn’t my cup of tea however was left with a big waste as they only done one size which was massive. Maybe start charging for small tasters to reduce waste is my only tip.\n\nThank you for a beautiful lunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT01DMU9jekJvVlZaNWJGOVRjblpNVkVsNmJYYxAB",
            "text": "Went to Melba's to celebrate finishing my Juneteenth 4 mile walk in Central Park.  Food was great and comforting. Service was also good. Love the atmosphere!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva1puSkNnEAE",
            "text": "Tucked into the heart of Harlem, Melba’s is a true neighborhood treasure that delivers Southern comfort on a plate with warmth, heart, and serious flavor. From the moment you step inside, the welcoming energy and lively atmosphere set the tone for a memorable meal.\n\nThe star of the show? The catfish—golden, crispy, and perfectly seasoned, it’s everything you want from a Southern classic. Paired with a side of tender, smoky collard greens and rich, buttery candied yams, the plate strikes a perfect balance between soul food tradition and polished execution.\n\nService is friendly and attentive, and the crowd is a joyful mix of locals and visitors soaking in the Harlem vibes. Whether you’re here for brunch, dinner, or just a craving for true comfort food, Melba’s delivers every time.\n\nDon’t Miss: the fried catfish platter, yams, and collard greens—Southern staples done right.\nVibe: Cozy, upbeat, and full of Harlem soul.\nVerdict: A must-visit for anyone craving authentic Southern cuisine in NYC."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOeTVrNWFQcjgyQTJnRRAB",
            "text": "I was genuinely looking forward to trying this spot, but unfortunately, my experience fell short. Service was quite slow—we waited nearly 25 minutes before a server even approached our table.\n\nWe ordered the short ribs with mashed potatoes and mac & cheese, the fried chicken, burger sliders, and collard greens. The food came out surprisingly fast, which made me question the freshness of some items. The sliders were dry and lacked seasoning, and the fried chicken had an unpleasant aftertaste, possibly from being cooked in old oil. That said, the short ribs and sides were decent.\n\nWhile I might’ve overlooked the service and food quality, I felt compelled to leave a review because I became very sick later that evening. 🤢😵‍💫 Something clearly did not sit well with my stomach, which was alarming.\n\nSadly, this was my first and last visit. I hope the restaurant takes this as constructive feedback to reassess some of their food handling and service standards."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdE9VZ3hVSHBqVUZKU1MxOHpVblptYUdodWRWRRAB",
            "text": "We visited Melba's for a birthday dinner. Our server was pleasant and the food came out very quickly. The portions were generous and everything was well cooked and seasoned! We'll be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUGQwTTRhM28wZEZaTloxRlVWak5YYkhjellWRRAB",
            "text": "The mac n’ cheese was life changing-ly good. Like, one of the best things I’ve eaten. It’s been a few days since I ate here but I’m still thinking about how good it was. Service was excellent and food came out quickly. Definitely a must visit restaurant in the Harlem area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMFEzZGFXazVyYjI5YVgzTk1NMHRDY1U1UGVFRRAB",
            "text": "I’ve been to this restaurant so many times that I’ve lost track, but I decided to celebrate my birthday here because I wanted to relive the unique taste of their soul food. This restaurant stands as my top choice for soul food in New York, offering a superb experience that includes the setting, cuisine, beverages, and crowd. Almost forgot their food is seasoned down so if you don’t like season go somewhere else, but it taste like your grandma that was back there cooking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmIzazFNa2hXTFhsTk4wWklkMjl3TTA5eFFtYxAB",
            "text": "Harlem is always a vibe. Melva's food started out very good from subsequent visits macaroni and cheese for example wasn't very tasty portion size wasn't good The menu is somewhat limited. The restaurant stays crowded so maybe you can expect a little bit of delay and maybe not as much customer service is there it wasn't as crowded and more waiters or waitresses. Definitely a drop in the quality of food in my opinion."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b2VPcmVREAE",
            "text": "Loved it! Me and my son flew in from London for his 14th birthday. I had booked the spot as his birthday meal, even though we had just flown in! Table serve was amazing, so friendly and polite (great background music), and the food was fantastic - that chicken (still dreaming of it). They even sang happy birthday to my son, with a lovely red velvet slice. Perfect start to the trip. Thank you so much, next time I’m in NY I’ll definitely visit again (not jet lagged this time)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd1lqejhnRRAB",
            "text": "My family was definitely looking forward to getting our schedules together to make it to Melba’s . We had heard so much about it from friends and watching them make it through the pandemic on takeout orders only on the news\nIt did not disappoint !! The food was definitely dish after dish of delicious southern comfort and the drinks alcoholic and non-alcoholic were on point as well.  We look forward to coming back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bVVFTmhVV3h6U1RRNVQwTXhjMVpzVW5KS1pYYxAB",
            "text": "Some of the best food I've had in a long time. The Tres Mac & Cheese was hands down the best macaroni and cheese I've had at a restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aclpYSklMVlZCWWpWWGFrTXpObDlwTlVsUmRWRRAB",
            "text": "Food was good, great portions for price.\n\nService was questionable. It was not crowded in any capacity but our server kept disappearing from our table but would give every other table attention. When you have to ask for a refill 25 minutes later after your drink has been empty, that is a severe problem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVluQjZNeko0UlV4ak9VOTBiRVoxVm5KdVZYYxAB",
            "text": "Great overall service, nice vibe. Highly recommend the Catfish and the Strawberry Henny. Some items were too greasy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQRHB2NGZ6Z09IZFV3EAE",
            "text": "Just tried their southern fried chicken. Super delicious and crispy!  You have a choice of dark meat, white meat or wings. Had mine with rice and beans. Excellent. Service was excellent too!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcWFiNndRRRAB",
            "text": "This place was a gem! Great atmosphere, outstanding service, and delicious food. I came craving fried chicken and they delivered. But as good as it was, the sides of Mac and cheese and collard greens really sent it over the top. And a slice of sweet potato pie was the perfect finish. I’ll be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcVBDX0l3EAE",
            "text": "The entire Melba experience was a vibe!!! The food top teir. The decor beautiful and the STAFF WAS AMAZING!!! The food came out quickly and it was hot and delicious. The staff was curtious accommodating and attentive.  The beautiful black art in the wall was captivating and alluring. 10/10 for me. HARLEM AT IT'S FINEST!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbDRuRWV3EAE",
            "text": "I lived right by Melba's for 1.5 years but only went to the restaurant towards the very end of my stay in New York City. I totally and wholeheartedly regret that now.\n\nWe ordered the oxtails and the short ribs - both were amazing beyond belief. The sweet yams where out of the world as well. Rest of the sides were good too.\n\nThe final cherry on the top was the sweet potato pie, which was surprisingly served cold - it managed to be so impressive that it now sits on top of my dessert list."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcElmNnN3RRAB",
            "text": "Really nice spot! Welcoming atmosphere from the moment we stepped in . Witnessed people of all ages celebrating their birthdays w/ staff & customers cheering on. Good portions. $130 w/ appetizers, entrees and drinks for 2 people.\n\nAppies: calamari + catfish.\n\nEntrees: ribs w/ collards + potato salad & fried chicken w/ yams + Mac n cheese\n\nDrinks: sangria + rum punch\n\nOverall: 8.5/10. Catfish & chicken were ok. Felt the batter could be more flavorful. Drinks were well done! Not diluted like some other restaurants."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2clpIQ3BnRRAB",
            "text": "I went to Melba’s this past Saturday, and had a great experience. I love the subtle upscale nature of this place, backed up with some great dishes. The menu is small, but what they do, they do well.\n\nI ordered just two dishes; the chicken and eggnog waffles and an order of peas and rice. Both dishes were so good, especially with the addition of the strawberry butter and maple syrup  to the chicken and waffles.\n\nI also had a strawberry lemonade drink which was refreshing. Overall, I think this is an excellent place to come for great dishes and a nice atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMEpxRnZnRRAB",
            "text": "Stopped in after my hair appointment & was not disappointed. Our server TuQuan was great, he was very attentive & provided his personal recommendations. We both enjoyed our meals, wish we would have had room for dessert! my only con was it was freezing inside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaS1qX21UdVkzR25nRRAB",
            "text": "Such kind service. It was busy due to Columbia's graduation but I was still attended to kindly and with quality, as a solo diner with no reservation. Delicious and affordable catfish sandwich with fries. Highly recommend."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eFRXY3dORUZaTTJwNmIzTkZRV2xWUWpSQ2JtYxAB",
            "text": "Advertising catfish but the\n\"Catfish sandwich\" is Swai. I also had a bug in my drink and the waitress stated, \"Oh a gnat flew in...let me get another one for you.\" Really?!?!?!\n\nI told the waitress I was on social media writing a review and she sent the manager to the table.\n\nThanks to the manager, she got it!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUG5wN0ttMDh6TVR3EAE",
            "text": "Visiting NY for a conference and a wrong way train led us to Harlem. A local recommended Melbas- and it did NOT disappoint. We tried the calamari, dry rub wings, spring rolls, cat fish, short ribs, salmon, oxtail, yams, collard greens, Mac and cheese, and potato salad. It was all delicious. My personal favorite was the oxtail and ribs. The house special drinks were delicious as well as the dessert. All of us were impressed. The establishment is a vibe. Music from our youth playing and laughter all around. This is definitely a place to stop in to for good food and good vibes. Oh. And shout out to Olay- who was our server. She was awesome, made great recommendations, and was smiling and laughing with us."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMWZlaGNREAE",
            "text": "Melba\nI just want to say firstly thank you for opening a restaurant in Grand Central. Truly magical and wonderful, congratulations.\n\nSecondly, I would like make a suggestion regarding portions and pricing. It feels a bit misleading and overwhelmingly overpriced. I paid almost $20 for half a thigh, two sides and the smallest drink I’ve ever seen.\n\nThe neighboring restaurants have more of a bargain and serve more realistic portions matching the price. I’m a true fan and supporter of yours so just imagine our disappointment. Hopefully things will get better.\n\nI suggest realistic option leg + thigh and two sides w/ drink that’s size appropriate. Is feasible and normal to do at least for $20"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNk9YUE9nEAE",
            "text": "Nestled in the heart of Harlem, Melba's has long been a staple for soul food enthusiasts. We recently dined there and sampled two classic dishes: chicken and waffles, and oxtail with yams and mac & cheese.\n\nThe chicken and waffle combination was satisfying, though not particularly memorable. The chicken was well-seasoned, but it lacked the wow factor we were expecting from a place known for soul food excellence. As for the oxtail, it was tender but a bit too sweet, and the sides of yams and mac & cheese didn't quite hit the mark. The yams were sweet but slightly underwhelming, and the mac & cheese could have used a sharper kick of cheese.\n\nService, however, was a highlight. The staff were attentive and friendly, making the experience more enjoyable. They were quick to respond to requests and ensured our meal was served promptly.\n\nOne downside was the restaurant's ambiance. Unfortunately, the dining area had a slight mildew smell, which detracted from the overall experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneW9TdU13EAE",
            "text": "I came here in a party of two on a Saturday afternoon before catching a show in the city.  As far as flavors go, as a Texan, I can throw a rock in Houston or Dallas and hit a place with better seasoned food. But, this is New York; so, I’m guessing it scratches an itch for locals who rarely travel south of the Mason-Dixon Line.\n\nIf you expect to get a table on the weekends, definitely make a reservation. Otherwise, you may not be able to be seated at all.\n\nThe servers and busboys were friendly and courteous and mildly attentive.\n\nSweet tea 6/10\nAll sweet, no tea.\n\nRum punch 7.75/10\nTasted pre-mixed and rum light.\n\nChicken and egg nog waffle 7/10\nUtilitarian portion. No razzle. Even less dazzle. Egg nog, out of season, is not as comforting as one would think.\n\nCatfish and egg nog waffle 7/10\nDitto above, plus I wish the catfish was better seasoned and crispy rather than mushy.  Requesting a bottle of hot sauce was the only way to save the fish."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFNtaEpSREJ3TUdkNWNVMHpjV1JTWlZsdmNWRRAB",
            "text": "The chicken and waffles were the best I’ve had in a long time. The chicken was perfectly seasoned and cooked to perfection, while the waffle—infused with a hint of eggnog—was simply brilliant. You could taste something special in it, but it’s the kind of flavor you can’t quite put your finger on. Honestly, I’m almost afraid to order anything else because this dish was that decadent.\n\nAs someone from Alabama, I know great Southern fried chicken, and this was top-tier. The grits were also insanely delicious—creamy and full of flavor. No need for cheese; they stand perfectly on their own.\n\nI highly recommend this menu choice."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIc2M2TWlnRRAB",
            "text": "This restaurant is absolutely amazing! We had the most fantastic waiter ever, Bryan!! My husband and I were there to celebrate both of our birthdays and he certainly made it very special! A dear friend that lives in New York suggested this restaurant and it certainly did not disappoint! Melba's food is seasoned to perfection, fresh and beyond delicious. The yams are to die for the dessert is really good as well we will definitely come back when visiting New York again. Do not sleep on this restaurant. Their culinary expertise is phenomenal!! 🌟🌟🌟🌟🌟"
        }
    ],
    "reviews_count": 87
}